TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE    1

       1              ;***************************************************************
       2              ;* TMS320x280xx Control Law Accelerator G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Fri Jul 31 12:09:42 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6              
       7              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                      .dwattr $C$DW$CU, DW_AT_name("../cla_pwm_setup.cla")
       9                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320x280xx Control Law Accelerator G3 C/C++ Codegen PC v20.2.1
      10                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Chiaming\CCSworkspace_V10\MonoMtrServo_377s\F2837x_FLASH")
      12              $C$DW$1 .dwtag  DW_TAG_variable
      13                      .dwattr $C$DW$1, DW_AT_name("EPwm4Regs")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EPwm4Regs")

         000004a7 75C0 
    1069 000004a8 0000          MNOP      ; [CPU_FPU] 
         000004a9 7FA0 
    1070                      .dwpsn  file "../cla_pwm_setup.cla",line 26,column 15,is_stmt,isa 0
    1071 000004aa 0000          MMOVIZ    MR1,#0                ; [CPU_FPU] |26| 
         000004ab 7841 
    1072 000004ac F7FF          MMOVXI    MR1,#63487            ; [CPU_FPU] |26| 
         000004ad 7881 
    1073 000004ae 0040!         MMOVZ16   MR0,@_EPwm5Regs+64    ; [CPU_FPU] |26| 
         000004af 7580 
    1074 000004b0 0004          MAND32    MR0,MR1,MR0           ; [CPU_FPU] |26| 
         000004b1 7C60 
    1075 000004b2 0000          MMOVIZ    MR1,#0                ; [CPU_FPU] |26| 
         000004b3 7841 
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   32

    1076 000004b4 0400          MMOVXI    MR1,#1024             ; [CPU_FPU] |26| 
         000004b5 7881 
    1077 000004b6 0004          MOR32     MR0,MR1,MR0           ; [CPU_FPU] |26| 
         000004b7 7C80 
    1078 000004b8 0040!         MMOV16    @_EPwm5Regs+64,MR0    ; [CPU_FPU] |26| 
         000004b9 75C0 
    1079 000004ba 0000          MNOP      ; [CPU_FPU] 
         000004bb 7FA0 
    1080                      .dwpsn  file "../cla_pwm_setup.cla",line 27,column 15,is_stmt,isa 0
    1081 000004bc 0000          MMOVIZ    MR1,#0                ; [CPU_FPU] |27| 
         000004bd 7841 
    1082 000004be FFBF          MMOVXI    MR1,#65471            ; [CPU_FPU] |27| 
         000004bf 7881 
    1083 000004c0 0040!         MMOVZ16   MR0,@_EPwm6Regs+64    ; [CPU_FPU] |27| 
         000004c1 7580 
    1084 000004c2 0004          MAND32    MR0,MR1,MR0           ; [CPU_FPU] |27| 
         000004c3 7C60 
    1085 000004c4 0000          MMOVIZ    MR1,#0                ; [CPU_FPU] |27| 
         000004c5 7841 
    1086 000004c6 0080          MMOVXI    MR1,#128              ; [CPU_FPU] |27| 
         000004c7 7881 
    1087 000004c8 0004          MOR32     MR0,MR1,MR0           ; [CPU_FPU] |27| 
         000004c9 7C80 
    1088 000004ca 0040!         MMOV16    @_EPwm6Regs+64,MR0    ; [CPU_FPU] |27| 
         000004cb 75C0 
    1089 000004cc 0000          MNOP      ; [CPU_FPU] 
         000004cd 7FA0 
    1090                      .dwpsn  file "../cla_pwm_setup.cla",line 28,column 15,is_stmt,isa 0
    1091 000004ce 0000          MMOVIZ    MR1,#0                ; [CPU_FPU] |28| 
         000004cf 7841 
    1092 000004d0 F7FF          MMOVXI    MR1,#63487            ; [CPU_FPU] |28| 
         000004d1 7881 
    1093 000004d2 0040!         MMOVZ16   MR0,@_EPwm6Regs+64    ; [CPU_FPU] |28| 
         000004d3 7580 
    1094 000004d4 0004          MAND32    MR0,MR1,MR0           ; [CPU_FPU] |28| 
         000004d5 7C60 
    1095 000004d6 0000          MMOVIZ    MR1,#0                ; [CPU_FPU] |28| 
         000004d7 7841 
    1096 000004d8 0400          MMOVXI    MR1,#1024             ; [CPU_FPU] |28| 
         000004d9 7881 
    1097 000004da 0004          MOR32     MR0,MR1,MR0           ; [CPU_FPU] |28| 
         000004db 7C80 
    1098 000004dc 0040!         MMOV16    @_EPwm6Regs+64,MR0    ; [CPU_FPU] |28| 
         000004dd 75C0 
    1099 000004de       $C$L6:    
    1100 000004de 0000          MNOP      ; [CPU_FPU] 
         000004df 7FA0 
    1101 000004e0 0000          MNOP      ; [CPU_FPU] 
         000004e1 7FA0 
    1102 000004e2 0000          MNOP      ; [CPU_FPU] 
         000004e3 7FA0 
    1103              $C$DW$20        .dwtag  DW_TAG_TI_branch
    1104                      .dwattr $C$DW$20, DW_AT_low_pc(0x00)
    1105                      .dwattr $C$DW$20, DW_AT_TI_return
    1106              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   33

    1107 000004e4 0000          MSTOP     ; [CPU_FPU] 
         000004e5 7F80 
    1108                      ; ireturn occurs ; [] 
    1109                      .dwattr $C$DW$19, DW_AT_TI_end_file("../cla_pwm_setup.cla")
    1110                      .dwattr $C$DW$19, DW_AT_TI_end_line(0x87)
    1111                      .dwattr $C$DW$19, DW_AT_TI_end_column(0x01)
    1112                      .dwendentry
    1113                      .dwendtag $C$DW$19
    1114              
    1115              ;**************************************************************
    1116              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1117              ;**************************************************************
    1118                      .global _EPwm4Regs
    1119                      .global _EPwm5Regs
    1120                      .global _EPwm6Regs
    1121                      .global _HFI_theta_test_toCLA
    1122              
    1123              ;***************************************************************
    1124              ;* TYPE INFORMATION                                            *
    1125              ;***************************************************************
    1126              
    1127              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1128                      .dwattr $C$DW$T$20, DW_AT_name("AQCSFRC_BITS")
    1129                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1130              $C$DW$21        .dwtag  DW_TAG_member
    1131                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
    1132                      .dwattr $C$DW$21, DW_AT_name("CSFA")
    1133                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_CSFA")
    1134                      .dwattr $C$DW$21, DW_AT_bit_offset(0x0e)
    1135                      .dwattr $C$DW$21, DW_AT_bit_size(0x02)
    1136                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1137                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
    1138              
    1139              $C$DW$22        .dwtag  DW_TAG_member
    1140                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
    1141                      .dwattr $C$DW$22, DW_AT_name("CSFB")
    1142                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_CSFB")
    1143                      .dwattr $C$DW$22, DW_AT_bit_offset(0x0c)
    1144                      .dwattr $C$DW$22, DW_AT_bit_size(0x02)
    1145                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1146                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
    1147              
    1148              $C$DW$23        .dwtag  DW_TAG_member
    1149                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
    1150                      .dwattr $C$DW$23, DW_AT_name("rsvd1")
    1151                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_rsvd1")
    1152                      .dwattr $C$DW$23, DW_AT_bit_offset(0x00)
    1153                      .dwattr $C$DW$23, DW_AT_bit_size(0x0c)
    1154                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1155                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
    1156              
    1157                      .dwendtag $C$DW$T$20
    1158              
    1159              
    1160              $C$DW$T$21      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   34

    1161                      .dwattr $C$DW$T$21, DW_AT_name("AQCSFRC_REG")
    1162                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1163              $C$DW$24        .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
    1165                      .dwattr $C$DW$24, DW_AT_name("all")
    1166                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_all")
    1167                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1168                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
    1169              
    1170              $C$DW$25        .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$20)
    1172                      .dwattr $C$DW$25, DW_AT_name("bit")
    1173                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_bit")
    1174                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1175                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
    1176              
    1177                      .dwendtag $C$DW$T$21
    1178              
    1179              
    1180              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1181                      .dwattr $C$DW$T$22, DW_AT_name("AQCTLA2_BITS")
    1182                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1183              $C$DW$26        .dwtag  DW_TAG_member
    1184                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
    1185                      .dwattr $C$DW$26, DW_AT_name("T1U")
    1186                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_T1U")
    1187                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0e)
    1188                      .dwattr $C$DW$26, DW_AT_bit_size(0x02)
    1189                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1190                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
    1191              
    1192              $C$DW$27        .dwtag  DW_TAG_member
    1193                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
    1194                      .dwattr $C$DW$27, DW_AT_name("T1D")
    1195                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_T1D")
    1196                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0c)
    1197                      .dwattr $C$DW$27, DW_AT_bit_size(0x02)
    1198                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1199                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
    1200              
    1201              $C$DW$28        .dwtag  DW_TAG_member
    1202                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
    1203                      .dwattr $C$DW$28, DW_AT_name("T2U")
    1204                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_T2U")
    1205                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0a)
    1206                      .dwattr $C$DW$28, DW_AT_bit_size(0x02)
    1207                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1208                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
    1209              
    1210              $C$DW$29        .dwtag  DW_TAG_member
    1211                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
    1212                      .dwattr $C$DW$29, DW_AT_name("T2D")
    1213                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_T2D")
    1214                      .dwattr $C$DW$29, DW_AT_bit_offset(0x08)
    1215                      .dwattr $C$DW$29, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   35

    1216                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1217                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
    1218              
    1219              $C$DW$30        .dwtag  DW_TAG_member
    1220                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
    1221                      .dwattr $C$DW$30, DW_AT_name("rsvd1")
    1222                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_rsvd1")
    1223                      .dwattr $C$DW$30, DW_AT_bit_offset(0x00)
    1224                      .dwattr $C$DW$30, DW_AT_bit_size(0x08)
    1225                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1226                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
    1227              
    1228                      .dwendtag $C$DW$T$22
    1229              
    1230              
    1231              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1232                      .dwattr $C$DW$T$23, DW_AT_name("AQCTLA2_REG")
    1233                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1234              $C$DW$31        .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
    1236                      .dwattr $C$DW$31, DW_AT_name("all")
    1237                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_all")
    1238                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1239                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
    1240              
    1241              $C$DW$32        .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$22)
    1243                      .dwattr $C$DW$32, DW_AT_name("bit")
    1244                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_bit")
    1245                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
    1247              
    1248                      .dwendtag $C$DW$T$23
    1249              
    1250              
    1251              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1252                      .dwattr $C$DW$T$24, DW_AT_name("AQCTLA_BITS")
    1253                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1254              $C$DW$33        .dwtag  DW_TAG_member
    1255                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
    1256                      .dwattr $C$DW$33, DW_AT_name("ZRO")
    1257                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_ZRO")
    1258                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0e)
    1259                      .dwattr $C$DW$33, DW_AT_bit_size(0x02)
    1260                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1261                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
    1262              
    1263              $C$DW$34        .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
    1265                      .dwattr $C$DW$34, DW_AT_name("PRD")
    1266                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_PRD")
    1267                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0c)
    1268                      .dwattr $C$DW$34, DW_AT_bit_size(0x02)
    1269                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1270                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   36

    1271              
    1272              $C$DW$35        .dwtag  DW_TAG_member
    1273                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
    1274                      .dwattr $C$DW$35, DW_AT_name("CAU")
    1275                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_CAU")
    1276                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0a)
    1277                      .dwattr $C$DW$35, DW_AT_bit_size(0x02)
    1278                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1279                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
    1280              
    1281              $C$DW$36        .dwtag  DW_TAG_member
    1282                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
    1283                      .dwattr $C$DW$36, DW_AT_name("CAD")
    1284                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_CAD")
    1285                      .dwattr $C$DW$36, DW_AT_bit_offset(0x08)
    1286                      .dwattr $C$DW$36, DW_AT_bit_size(0x02)
    1287                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1288                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
    1289              
    1290              $C$DW$37        .dwtag  DW_TAG_member
    1291                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
    1292                      .dwattr $C$DW$37, DW_AT_name("CBU")
    1293                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_CBU")
    1294                      .dwattr $C$DW$37, DW_AT_bit_offset(0x06)
    1295                      .dwattr $C$DW$37, DW_AT_bit_size(0x02)
    1296                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
    1298              
    1299              $C$DW$38        .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$38, DW_AT_name("CBD")
    1302                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_CBD")
    1303                      .dwattr $C$DW$38, DW_AT_bit_offset(0x04)
    1304                      .dwattr $C$DW$38, DW_AT_bit_size(0x02)
    1305                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1306                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
    1307              
    1308              $C$DW$39        .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
    1310                      .dwattr $C$DW$39, DW_AT_name("rsvd1")
    1311                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd1")
    1312                      .dwattr $C$DW$39, DW_AT_bit_offset(0x00)
    1313                      .dwattr $C$DW$39, DW_AT_bit_size(0x04)
    1314                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1315                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
    1316              
    1317                      .dwendtag $C$DW$T$24
    1318              
    1319              
    1320              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1321                      .dwattr $C$DW$T$25, DW_AT_name("AQCTLA_REG")
    1322                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1323              $C$DW$40        .dwtag  DW_TAG_member
    1324                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
    1325                      .dwattr $C$DW$40, DW_AT_name("all")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   37

    1326                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_all")
    1327                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1328                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
    1329              
    1330              $C$DW$41        .dwtag  DW_TAG_member
    1331                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$24)
    1332                      .dwattr $C$DW$41, DW_AT_name("bit")
    1333                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_bit")
    1334                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1335                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
    1336              
    1337                      .dwendtag $C$DW$T$25
    1338              
    1339              
    1340              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1341                      .dwattr $C$DW$T$26, DW_AT_name("AQCTLB2_BITS")
    1342                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1343              $C$DW$42        .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
    1345                      .dwattr $C$DW$42, DW_AT_name("T1U")
    1346                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_T1U")
    1347                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0e)
    1348                      .dwattr $C$DW$42, DW_AT_bit_size(0x02)
    1349                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1350                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
    1351              
    1352              $C$DW$43        .dwtag  DW_TAG_member
    1353                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
    1354                      .dwattr $C$DW$43, DW_AT_name("T1D")
    1355                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_T1D")
    1356                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0c)
    1357                      .dwattr $C$DW$43, DW_AT_bit_size(0x02)
    1358                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1359                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1360              
    1361              $C$DW$44        .dwtag  DW_TAG_member
    1362                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
    1363                      .dwattr $C$DW$44, DW_AT_name("T2U")
    1364                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_T2U")
    1365                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0a)
    1366                      .dwattr $C$DW$44, DW_AT_bit_size(0x02)
    1367                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1368                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1369              
    1370              $C$DW$45        .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
    1372                      .dwattr $C$DW$45, DW_AT_name("T2D")
    1373                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_T2D")
    1374                      .dwattr $C$DW$45, DW_AT_bit_offset(0x08)
    1375                      .dwattr $C$DW$45, DW_AT_bit_size(0x02)
    1376                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1377                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1378              
    1379              $C$DW$46        .dwtag  DW_TAG_member
    1380                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   38

    1381                      .dwattr $C$DW$46, DW_AT_name("rsvd1")
    1382                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_rsvd1")
    1383                      .dwattr $C$DW$46, DW_AT_bit_offset(0x00)
    1384                      .dwattr $C$DW$46, DW_AT_bit_size(0x08)
    1385                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1386                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1387              
    1388                      .dwendtag $C$DW$T$26
    1389              
    1390              
    1391              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1392                      .dwattr $C$DW$T$27, DW_AT_name("AQCTLB2_REG")
    1393                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1394              $C$DW$47        .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
    1396                      .dwattr $C$DW$47, DW_AT_name("all")
    1397                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_all")
    1398                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1399                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1400              
    1401              $C$DW$48        .dwtag  DW_TAG_member
    1402                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$26)
    1403                      .dwattr $C$DW$48, DW_AT_name("bit")
    1404                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_bit")
    1405                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1406                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1407              
    1408                      .dwendtag $C$DW$T$27
    1409              
    1410              
    1411              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1412                      .dwattr $C$DW$T$28, DW_AT_name("AQCTLB_BITS")
    1413                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1414              $C$DW$49        .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
    1416                      .dwattr $C$DW$49, DW_AT_name("ZRO")
    1417                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_ZRO")
    1418                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0e)
    1419                      .dwattr $C$DW$49, DW_AT_bit_size(0x02)
    1420                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1421                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1422              
    1423              $C$DW$50        .dwtag  DW_TAG_member
    1424                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
    1425                      .dwattr $C$DW$50, DW_AT_name("PRD")
    1426                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_PRD")
    1427                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0c)
    1428                      .dwattr $C$DW$50, DW_AT_bit_size(0x02)
    1429                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1430                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1431              
    1432              $C$DW$51        .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
    1434                      .dwattr $C$DW$51, DW_AT_name("CAU")
    1435                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_CAU")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   39

    1436                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0a)
    1437                      .dwattr $C$DW$51, DW_AT_bit_size(0x02)
    1438                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1439                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1440              
    1441              $C$DW$52        .dwtag  DW_TAG_member
    1442                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
    1443                      .dwattr $C$DW$52, DW_AT_name("CAD")
    1444                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_CAD")
    1445                      .dwattr $C$DW$52, DW_AT_bit_offset(0x08)
    1446                      .dwattr $C$DW$52, DW_AT_bit_size(0x02)
    1447                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1448                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1449              
    1450              $C$DW$53        .dwtag  DW_TAG_member
    1451                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
    1452                      .dwattr $C$DW$53, DW_AT_name("CBU")
    1453                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_CBU")
    1454                      .dwattr $C$DW$53, DW_AT_bit_offset(0x06)
    1455                      .dwattr $C$DW$53, DW_AT_bit_size(0x02)
    1456                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1457                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1458              
    1459              $C$DW$54        .dwtag  DW_TAG_member
    1460                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
    1461                      .dwattr $C$DW$54, DW_AT_name("CBD")
    1462                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_CBD")
    1463                      .dwattr $C$DW$54, DW_AT_bit_offset(0x04)
    1464                      .dwattr $C$DW$54, DW_AT_bit_size(0x02)
    1465                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1466                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1467              
    1468              $C$DW$55        .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
    1470                      .dwattr $C$DW$55, DW_AT_name("rsvd1")
    1471                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd1")
    1472                      .dwattr $C$DW$55, DW_AT_bit_offset(0x00)
    1473                      .dwattr $C$DW$55, DW_AT_bit_size(0x04)
    1474                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1475                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1476              
    1477                      .dwendtag $C$DW$T$28
    1478              
    1479              
    1480              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1481                      .dwattr $C$DW$T$29, DW_AT_name("AQCTLB_REG")
    1482                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1483              $C$DW$56        .dwtag  DW_TAG_member
    1484                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1485                      .dwattr $C$DW$56, DW_AT_name("all")
    1486                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_all")
    1487                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1488                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1489              
    1490              $C$DW$57        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   40

    1491                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$28)
    1492                      .dwattr $C$DW$57, DW_AT_name("bit")
    1493                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_bit")
    1494                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1495                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1496              
    1497                      .dwendtag $C$DW$T$29
    1498              
    1499              
    1500              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1501                      .dwattr $C$DW$T$30, DW_AT_name("AQCTL_BITS")
    1502                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1503              $C$DW$58        .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1505                      .dwattr $C$DW$58, DW_AT_name("LDAQAMODE")
    1506                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_LDAQAMODE")
    1507                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0e)
    1508                      .dwattr $C$DW$58, DW_AT_bit_size(0x02)
    1509                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1510                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1511              
    1512              $C$DW$59        .dwtag  DW_TAG_member
    1513                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1514                      .dwattr $C$DW$59, DW_AT_name("LDAQBMODE")
    1515                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_LDAQBMODE")
    1516                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0c)
    1517                      .dwattr $C$DW$59, DW_AT_bit_size(0x02)
    1518                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1519                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1520              
    1521              $C$DW$60        .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1523                      .dwattr $C$DW$60, DW_AT_name("SHDWAQAMODE")
    1524                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_SHDWAQAMODE")
    1525                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0b)
    1526                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
    1527                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1528                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1529              
    1530              $C$DW$61        .dwtag  DW_TAG_member
    1531                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1532                      .dwattr $C$DW$61, DW_AT_name("rsvd1")
    1533                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rsvd1")
    1534                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0a)
    1535                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
    1536                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1537                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1538              
    1539              $C$DW$62        .dwtag  DW_TAG_member
    1540                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1541                      .dwattr $C$DW$62, DW_AT_name("SHDWAQBMODE")
    1542                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_SHDWAQBMODE")
    1543                      .dwattr $C$DW$62, DW_AT_bit_offset(0x09)
    1544                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
    1545                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   41

    1546                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1547              
    1548              $C$DW$63        .dwtag  DW_TAG_member
    1549                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1550                      .dwattr $C$DW$63, DW_AT_name("rsvd2")
    1551                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd2")
    1552                      .dwattr $C$DW$63, DW_AT_bit_offset(0x08)
    1553                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
    1554                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1555                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1556              
    1557              $C$DW$64        .dwtag  DW_TAG_member
    1558                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1559                      .dwattr $C$DW$64, DW_AT_name("LDAQASYNC")
    1560                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_LDAQASYNC")
    1561                      .dwattr $C$DW$64, DW_AT_bit_offset(0x06)
    1562                      .dwattr $C$DW$64, DW_AT_bit_size(0x02)
    1563                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1564                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1565              
    1566              $C$DW$65        .dwtag  DW_TAG_member
    1567                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1568                      .dwattr $C$DW$65, DW_AT_name("LDAQBSYNC")
    1569                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_LDAQBSYNC")
    1570                      .dwattr $C$DW$65, DW_AT_bit_offset(0x04)
    1571                      .dwattr $C$DW$65, DW_AT_bit_size(0x02)
    1572                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1573                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1574              
    1575              $C$DW$66        .dwtag  DW_TAG_member
    1576                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1577                      .dwattr $C$DW$66, DW_AT_name("rsvd3")
    1578                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_rsvd3")
    1579                      .dwattr $C$DW$66, DW_AT_bit_offset(0x00)
    1580                      .dwattr $C$DW$66, DW_AT_bit_size(0x04)
    1581                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1583              
    1584                      .dwendtag $C$DW$T$30
    1585              
    1586              
    1587              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1588                      .dwattr $C$DW$T$31, DW_AT_name("AQCTL_REG")
    1589                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1590              $C$DW$67        .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1592                      .dwattr $C$DW$67, DW_AT_name("all")
    1593                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_all")
    1594                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1595                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1596              
    1597              $C$DW$68        .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$30)
    1599                      .dwattr $C$DW$68, DW_AT_name("bit")
    1600                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   42

    1601                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1602                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1603              
    1604                      .dwendtag $C$DW$T$31
    1605              
    1606              
    1607              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1608                      .dwattr $C$DW$T$32, DW_AT_name("AQSFRC_BITS")
    1609                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1610              $C$DW$69        .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1612                      .dwattr $C$DW$69, DW_AT_name("ACTSFA")
    1613                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_ACTSFA")
    1614                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0e)
    1615                      .dwattr $C$DW$69, DW_AT_bit_size(0x02)
    1616                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1617                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1618              
    1619              $C$DW$70        .dwtag  DW_TAG_member
    1620                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1621                      .dwattr $C$DW$70, DW_AT_name("OTSFA")
    1622                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_OTSFA")
    1623                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0d)
    1624                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
    1625                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1626                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1627              
    1628              $C$DW$71        .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1630                      .dwattr $C$DW$71, DW_AT_name("ACTSFB")
    1631                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_ACTSFB")
    1632                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0b)
    1633                      .dwattr $C$DW$71, DW_AT_bit_size(0x02)
    1634                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1635                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1636              
    1637              $C$DW$72        .dwtag  DW_TAG_member
    1638                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1639                      .dwattr $C$DW$72, DW_AT_name("OTSFB")
    1640                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_OTSFB")
    1641                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0a)
    1642                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
    1643                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1644                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1645              
    1646              $C$DW$73        .dwtag  DW_TAG_member
    1647                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1648                      .dwattr $C$DW$73, DW_AT_name("RLDCSF")
    1649                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_RLDCSF")
    1650                      .dwattr $C$DW$73, DW_AT_bit_offset(0x08)
    1651                      .dwattr $C$DW$73, DW_AT_bit_size(0x02)
    1652                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1653                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1654              
    1655              $C$DW$74        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   43

    1656                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1657                      .dwattr $C$DW$74, DW_AT_name("rsvd1")
    1658                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_rsvd1")
    1659                      .dwattr $C$DW$74, DW_AT_bit_offset(0x00)
    1660                      .dwattr $C$DW$74, DW_AT_bit_size(0x08)
    1661                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1662                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1663              
    1664                      .dwendtag $C$DW$T$32
    1665              
    1666              
    1667              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1668                      .dwattr $C$DW$T$33, DW_AT_name("AQSFRC_REG")
    1669                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1670              $C$DW$75        .dwtag  DW_TAG_member
    1671                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1672                      .dwattr $C$DW$75, DW_AT_name("all")
    1673                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_all")
    1674                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1675                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1676              
    1677              $C$DW$76        .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$32)
    1679                      .dwattr $C$DW$76, DW_AT_name("bit")
    1680                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_bit")
    1681                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1682                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1683              
    1684                      .dwendtag $C$DW$T$33
    1685              
    1686              
    1687              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1688                      .dwattr $C$DW$T$34, DW_AT_name("AQTSRCSEL_BITS")
    1689                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1690              $C$DW$77        .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1692                      .dwattr $C$DW$77, DW_AT_name("T1SEL")
    1693                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_T1SEL")
    1694                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0c)
    1695                      .dwattr $C$DW$77, DW_AT_bit_size(0x04)
    1696                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1697                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1698              
    1699              $C$DW$78        .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1701                      .dwattr $C$DW$78, DW_AT_name("T2SEL")
    1702                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_T2SEL")
    1703                      .dwattr $C$DW$78, DW_AT_bit_offset(0x08)
    1704                      .dwattr $C$DW$78, DW_AT_bit_size(0x04)
    1705                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1706                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1707              
    1708              $C$DW$79        .dwtag  DW_TAG_member
    1709                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1710                      .dwattr $C$DW$79, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   44

    1711                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rsvd1")
    1712                      .dwattr $C$DW$79, DW_AT_bit_offset(0x00)
    1713                      .dwattr $C$DW$79, DW_AT_bit_size(0x08)
    1714                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1715                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1716              
    1717                      .dwendtag $C$DW$T$34
    1718              
    1719              
    1720              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1721                      .dwattr $C$DW$T$35, DW_AT_name("AQTSRCSEL_REG")
    1722                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1723              $C$DW$80        .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1725                      .dwattr $C$DW$80, DW_AT_name("all")
    1726                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_all")
    1727                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1728                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1729              
    1730              $C$DW$81        .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$34)
    1732                      .dwattr $C$DW$81, DW_AT_name("bit")
    1733                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_bit")
    1734                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1735                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1736              
    1737                      .dwendtag $C$DW$T$35
    1738              
    1739              
    1740              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1741                      .dwattr $C$DW$T$36, DW_AT_name("CMPA_BITS")
    1742                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1743              $C$DW$82        .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$82, DW_AT_name("CMPAHR")
    1746                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_CMPAHR")
    1747                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
    1748                      .dwattr $C$DW$82, DW_AT_bit_size(0x10)
    1749                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1751              
    1752              $C$DW$83        .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$83, DW_AT_name("CMPA")
    1755                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_CMPA")
    1756                      .dwattr $C$DW$83, DW_AT_bit_offset(0x00)
    1757                      .dwattr $C$DW$83, DW_AT_bit_size(0x10)
    1758                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1759                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1760              
    1761                      .dwendtag $C$DW$T$36
    1762              
    1763              
    1764              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1765                      .dwattr $C$DW$T$38, DW_AT_name("CMPA_REG")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   45

    1766                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1767              $C$DW$84        .dwtag  DW_TAG_member
    1768                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$37)
    1769                      .dwattr $C$DW$84, DW_AT_name("all")
    1770                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_all")
    1771                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1772                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1773              
    1774              $C$DW$85        .dwtag  DW_TAG_member
    1775                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$36)
    1776                      .dwattr $C$DW$85, DW_AT_name("bit")
    1777                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_bit")
    1778                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1779                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1780              
    1781                      .dwendtag $C$DW$T$38
    1782              
    1783              
    1784              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1785                      .dwattr $C$DW$T$39, DW_AT_name("CMPB_BITS")
    1786                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    1787              $C$DW$86        .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1789                      .dwattr $C$DW$86, DW_AT_name("CMPBHR")
    1790                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_CMPBHR")
    1791                      .dwattr $C$DW$86, DW_AT_bit_offset(0x00)
    1792                      .dwattr $C$DW$86, DW_AT_bit_size(0x10)
    1793                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1794                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1795              
    1796              $C$DW$87        .dwtag  DW_TAG_member
    1797                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1798                      .dwattr $C$DW$87, DW_AT_name("CMPB")
    1799                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_CMPB")
    1800                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00)
    1801                      .dwattr $C$DW$87, DW_AT_bit_size(0x10)
    1802                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1803                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1804              
    1805                      .dwendtag $C$DW$T$39
    1806              
    1807              
    1808              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1809                      .dwattr $C$DW$T$40, DW_AT_name("CMPB_REG")
    1810                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1811              $C$DW$88        .dwtag  DW_TAG_member
    1812                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$37)
    1813                      .dwattr $C$DW$88, DW_AT_name("all")
    1814                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_all")
    1815                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1816                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1817              
    1818              $C$DW$89        .dwtag  DW_TAG_member
    1819                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$39)
    1820                      .dwattr $C$DW$89, DW_AT_name("bit")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   46

    1821                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_bit")
    1822                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1823                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1824              
    1825                      .dwendtag $C$DW$T$40
    1826              
    1827              
    1828              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1829                      .dwattr $C$DW$T$41, DW_AT_name("CMPCTL2_BITS")
    1830                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1831              $C$DW$90        .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1833                      .dwattr $C$DW$90, DW_AT_name("LOADCMODE")
    1834                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_LOADCMODE")
    1835                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0e)
    1836                      .dwattr $C$DW$90, DW_AT_bit_size(0x02)
    1837                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1838                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1839              
    1840              $C$DW$91        .dwtag  DW_TAG_member
    1841                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1842                      .dwattr $C$DW$91, DW_AT_name("LOADDMODE")
    1843                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_LOADDMODE")
    1844                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0c)
    1845                      .dwattr $C$DW$91, DW_AT_bit_size(0x02)
    1846                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1847                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1848              
    1849              $C$DW$92        .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1851                      .dwattr $C$DW$92, DW_AT_name("SHDWCMODE")
    1852                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_SHDWCMODE")
    1853                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0b)
    1854                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1855                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1856                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1857              
    1858              $C$DW$93        .dwtag  DW_TAG_member
    1859                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1860                      .dwattr $C$DW$93, DW_AT_name("rsvd1")
    1861                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd1")
    1862                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0a)
    1863                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1864                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1865                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1866              
    1867              $C$DW$94        .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1869                      .dwattr $C$DW$94, DW_AT_name("SHDWDMODE")
    1870                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_SHDWDMODE")
    1871                      .dwattr $C$DW$94, DW_AT_bit_offset(0x09)
    1872                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1873                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1874                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1875              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   47

    1876              $C$DW$95        .dwtag  DW_TAG_member
    1877                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1878                      .dwattr $C$DW$95, DW_AT_name("rsvd2")
    1879                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd2")
    1880                      .dwattr $C$DW$95, DW_AT_bit_offset(0x06)
    1881                      .dwattr $C$DW$95, DW_AT_bit_size(0x03)
    1882                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1883                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1884              
    1885              $C$DW$96        .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1887                      .dwattr $C$DW$96, DW_AT_name("LOADCSYNC")
    1888                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_LOADCSYNC")
    1889                      .dwattr $C$DW$96, DW_AT_bit_offset(0x04)
    1890                      .dwattr $C$DW$96, DW_AT_bit_size(0x02)
    1891                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1892                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1893              
    1894              $C$DW$97        .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1896                      .dwattr $C$DW$97, DW_AT_name("LOADDSYNC")
    1897                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_LOADDSYNC")
    1898                      .dwattr $C$DW$97, DW_AT_bit_offset(0x02)
    1899                      .dwattr $C$DW$97, DW_AT_bit_size(0x02)
    1900                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1901                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1902              
    1903              $C$DW$98        .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1905                      .dwattr $C$DW$98, DW_AT_name("rsvd3")
    1906                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd3")
    1907                      .dwattr $C$DW$98, DW_AT_bit_offset(0x00)
    1908                      .dwattr $C$DW$98, DW_AT_bit_size(0x02)
    1909                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1910                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1911              
    1912                      .dwendtag $C$DW$T$41
    1913              
    1914              
    1915              $C$DW$T$42      .dwtag  DW_TAG_union_type
    1916                      .dwattr $C$DW$T$42, DW_AT_name("CMPCTL2_REG")
    1917                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1918              $C$DW$99        .dwtag  DW_TAG_member
    1919                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1920                      .dwattr $C$DW$99, DW_AT_name("all")
    1921                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_all")
    1922                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1923                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1924              
    1925              $C$DW$100       .dwtag  DW_TAG_member
    1926                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$41)
    1927                      .dwattr $C$DW$100, DW_AT_name("bit")
    1928                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_bit")
    1929                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1930                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   48

    1931              
    1932                      .dwendtag $C$DW$T$42
    1933              
    1934              
    1935              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1936                      .dwattr $C$DW$T$43, DW_AT_name("CMPCTL_BITS")
    1937                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1938              $C$DW$101       .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1940                      .dwattr $C$DW$101, DW_AT_name("LOADAMODE")
    1941                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_LOADAMODE")
    1942                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0e)
    1943                      .dwattr $C$DW$101, DW_AT_bit_size(0x02)
    1944                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1945                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1946              
    1947              $C$DW$102       .dwtag  DW_TAG_member
    1948                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1949                      .dwattr $C$DW$102, DW_AT_name("LOADBMODE")
    1950                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_LOADBMODE")
    1951                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0c)
    1952                      .dwattr $C$DW$102, DW_AT_bit_size(0x02)
    1953                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1954                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1955              
    1956              $C$DW$103       .dwtag  DW_TAG_member
    1957                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1958                      .dwattr $C$DW$103, DW_AT_name("SHDWAMODE")
    1959                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_SHDWAMODE")
    1960                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0b)
    1961                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1962                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1963                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1964              
    1965              $C$DW$104       .dwtag  DW_TAG_member
    1966                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1967                      .dwattr $C$DW$104, DW_AT_name("rsvd1")
    1968                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd1")
    1969                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0a)
    1970                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1971                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1972                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1973              
    1974              $C$DW$105       .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1976                      .dwattr $C$DW$105, DW_AT_name("SHDWBMODE")
    1977                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_SHDWBMODE")
    1978                      .dwattr $C$DW$105, DW_AT_bit_offset(0x09)
    1979                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1980                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1981                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1982              
    1983              $C$DW$106       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1985                      .dwattr $C$DW$106, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   49

    1986                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd2")
    1987                      .dwattr $C$DW$106, DW_AT_bit_offset(0x08)
    1988                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1989                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1990                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1991              
    1992              $C$DW$107       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1994                      .dwattr $C$DW$107, DW_AT_name("SHDWAFULL")
    1995                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_SHDWAFULL")
    1996                      .dwattr $C$DW$107, DW_AT_bit_offset(0x07)
    1997                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1998                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1999                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2000              
    2001              $C$DW$108       .dwtag  DW_TAG_member
    2002                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    2003                      .dwattr $C$DW$108, DW_AT_name("SHDWBFULL")
    2004                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_SHDWBFULL")
    2005                      .dwattr $C$DW$108, DW_AT_bit_offset(0x06)
    2006                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    2007                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2008                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2009              
    2010              $C$DW$109       .dwtag  DW_TAG_member
    2011                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2012                      .dwattr $C$DW$109, DW_AT_name("LOADASYNC")
    2013                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_LOADASYNC")
    2014                      .dwattr $C$DW$109, DW_AT_bit_offset(0x04)
    2015                      .dwattr $C$DW$109, DW_AT_bit_size(0x02)
    2016                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2017                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2018              
    2019              $C$DW$110       .dwtag  DW_TAG_member
    2020                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2021                      .dwattr $C$DW$110, DW_AT_name("LOADBSYNC")
    2022                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_LOADBSYNC")
    2023                      .dwattr $C$DW$110, DW_AT_bit_offset(0x02)
    2024                      .dwattr $C$DW$110, DW_AT_bit_size(0x02)
    2025                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2026                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2027              
    2028              $C$DW$111       .dwtag  DW_TAG_member
    2029                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2030                      .dwattr $C$DW$111, DW_AT_name("rsvd3")
    2031                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd3")
    2032                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    2033                      .dwattr $C$DW$111, DW_AT_bit_size(0x02)
    2034                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2035                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2036              
    2037                      .dwendtag $C$DW$T$43
    2038              
    2039              
    2040              $C$DW$T$44      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   50

    2041                      .dwattr $C$DW$T$44, DW_AT_name("CMPCTL_REG")
    2042                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    2043              $C$DW$112       .dwtag  DW_TAG_member
    2044                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2045                      .dwattr $C$DW$112, DW_AT_name("all")
    2046                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_all")
    2047                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2048                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2049              
    2050              $C$DW$113       .dwtag  DW_TAG_member
    2051                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$43)
    2052                      .dwattr $C$DW$113, DW_AT_name("bit")
    2053                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_bit")
    2054                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2055                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2056              
    2057                      .dwendtag $C$DW$T$44
    2058              
    2059              
    2060              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2061                      .dwattr $C$DW$T$45, DW_AT_name("DBCTL2_BITS")
    2062                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    2063              $C$DW$114       .dwtag  DW_TAG_member
    2064                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2065                      .dwattr $C$DW$114, DW_AT_name("LOADDBCTLMODE")
    2066                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_LOADDBCTLMODE")
    2067                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0e)
    2068                      .dwattr $C$DW$114, DW_AT_bit_size(0x02)
    2069                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2070                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2071              
    2072              $C$DW$115       .dwtag  DW_TAG_member
    2073                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2074                      .dwattr $C$DW$115, DW_AT_name("SHDWDBCTLMODE")
    2075                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_SHDWDBCTLMODE")
    2076                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0d)
    2077                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    2078                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2079                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2080              
    2081              $C$DW$116       .dwtag  DW_TAG_member
    2082                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2083                      .dwattr $C$DW$116, DW_AT_name("rsvd1")
    2084                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd1")
    2085                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00)
    2086                      .dwattr $C$DW$116, DW_AT_bit_size(0x0d)
    2087                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2088                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2089              
    2090                      .dwendtag $C$DW$T$45
    2091              
    2092              
    2093              $C$DW$T$46      .dwtag  DW_TAG_union_type
    2094                      .dwattr $C$DW$T$46, DW_AT_name("DBCTL2_REG")
    2095                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   51

    2096              $C$DW$117       .dwtag  DW_TAG_member
    2097                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2098                      .dwattr $C$DW$117, DW_AT_name("all")
    2099                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_all")
    2100                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2101                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2102              
    2103              $C$DW$118       .dwtag  DW_TAG_member
    2104                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$45)
    2105                      .dwattr $C$DW$118, DW_AT_name("bit")
    2106                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_bit")
    2107                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2108                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2109              
    2110                      .dwendtag $C$DW$T$46
    2111              
    2112              
    2113              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2114                      .dwattr $C$DW$T$47, DW_AT_name("DBCTL_BITS")
    2115                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    2116              $C$DW$119       .dwtag  DW_TAG_member
    2117                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2118                      .dwattr $C$DW$119, DW_AT_name("OUT_MODE")
    2119                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_OUT_MODE")
    2120                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0e)
    2121                      .dwattr $C$DW$119, DW_AT_bit_size(0x02)
    2122                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2123                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2124              
    2125              $C$DW$120       .dwtag  DW_TAG_member
    2126                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2127                      .dwattr $C$DW$120, DW_AT_name("POLSEL")
    2128                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_POLSEL")
    2129                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0c)
    2130                      .dwattr $C$DW$120, DW_AT_bit_size(0x02)
    2131                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2132                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2133              
    2134              $C$DW$121       .dwtag  DW_TAG_member
    2135                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2136                      .dwattr $C$DW$121, DW_AT_name("IN_MODE")
    2137                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_IN_MODE")
    2138                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0a)
    2139                      .dwattr $C$DW$121, DW_AT_bit_size(0x02)
    2140                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2141                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2142              
    2143              $C$DW$122       .dwtag  DW_TAG_member
    2144                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2145                      .dwattr $C$DW$122, DW_AT_name("LOADREDMODE")
    2146                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_LOADREDMODE")
    2147                      .dwattr $C$DW$122, DW_AT_bit_offset(0x08)
    2148                      .dwattr $C$DW$122, DW_AT_bit_size(0x02)
    2149                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2150                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   52

    2151              
    2152              $C$DW$123       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2154                      .dwattr $C$DW$123, DW_AT_name("LOADFEDMODE")
    2155                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_LOADFEDMODE")
    2156                      .dwattr $C$DW$123, DW_AT_bit_offset(0x06)
    2157                      .dwattr $C$DW$123, DW_AT_bit_size(0x02)
    2158                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2159                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2160              
    2161              $C$DW$124       .dwtag  DW_TAG_member
    2162                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2163                      .dwattr $C$DW$124, DW_AT_name("SHDWDBREDMODE")
    2164                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_SHDWDBREDMODE")
    2165                      .dwattr $C$DW$124, DW_AT_bit_offset(0x05)
    2166                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    2167                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2168                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2169              
    2170              $C$DW$125       .dwtag  DW_TAG_member
    2171                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2172                      .dwattr $C$DW$125, DW_AT_name("SHDWDBFEDMODE")
    2173                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_SHDWDBFEDMODE")
    2174                      .dwattr $C$DW$125, DW_AT_bit_offset(0x04)
    2175                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    2176                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2177                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2178              
    2179              $C$DW$126       .dwtag  DW_TAG_member
    2180                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2181                      .dwattr $C$DW$126, DW_AT_name("OUTSWAP")
    2182                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_OUTSWAP")
    2183                      .dwattr $C$DW$126, DW_AT_bit_offset(0x02)
    2184                      .dwattr $C$DW$126, DW_AT_bit_size(0x02)
    2185                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2186                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2187              
    2188              $C$DW$127       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2190                      .dwattr $C$DW$127, DW_AT_name("DEDB_MODE")
    2191                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_DEDB_MODE")
    2192                      .dwattr $C$DW$127, DW_AT_bit_offset(0x01)
    2193                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    2194                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2195                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2196              
    2197              $C$DW$128       .dwtag  DW_TAG_member
    2198                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2199                      .dwattr $C$DW$128, DW_AT_name("HALFCYCLE")
    2200                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_HALFCYCLE")
    2201                      .dwattr $C$DW$128, DW_AT_bit_offset(0x00)
    2202                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    2203                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2204                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2205              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   53

    2206                      .dwendtag $C$DW$T$47
    2207              
    2208              
    2209              $C$DW$T$48      .dwtag  DW_TAG_union_type
    2210                      .dwattr $C$DW$T$48, DW_AT_name("DBCTL_REG")
    2211                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    2212              $C$DW$129       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2214                      .dwattr $C$DW$129, DW_AT_name("all")
    2215                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_all")
    2216                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2217                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2218              
    2219              $C$DW$130       .dwtag  DW_TAG_member
    2220                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$47)
    2221                      .dwattr $C$DW$130, DW_AT_name("bit")
    2222                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_bit")
    2223                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2224                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2225              
    2226                      .dwendtag $C$DW$T$48
    2227              
    2228              
    2229              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    2230                      .dwattr $C$DW$T$49, DW_AT_name("DBFEDHR_BITS")
    2231                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    2232              $C$DW$131       .dwtag  DW_TAG_member
    2233                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2234                      .dwattr $C$DW$131, DW_AT_name("rsvd1")
    2235                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd1")
    2236                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0f)
    2237                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2238                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2239                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2240              
    2241              $C$DW$132       .dwtag  DW_TAG_member
    2242                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2243                      .dwattr $C$DW$132, DW_AT_name("rsvd2")
    2244                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd2")
    2245                      .dwattr $C$DW$132, DW_AT_bit_offset(0x08)
    2246                      .dwattr $C$DW$132, DW_AT_bit_size(0x07)
    2247                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2248                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2249              
    2250              $C$DW$133       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2252                      .dwattr $C$DW$133, DW_AT_name("rsvd3")
    2253                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd3")
    2254                      .dwattr $C$DW$133, DW_AT_bit_offset(0x07)
    2255                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    2256                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2257                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2258              
    2259              $C$DW$134       .dwtag  DW_TAG_member
    2260                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   54

    2261                      .dwattr $C$DW$134, DW_AT_name("DBFEDHR")
    2262                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_DBFEDHR")
    2263                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00)
    2264                      .dwattr $C$DW$134, DW_AT_bit_size(0x07)
    2265                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2266                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2267              
    2268                      .dwendtag $C$DW$T$49
    2269              
    2270              
    2271              $C$DW$T$50      .dwtag  DW_TAG_union_type
    2272                      .dwattr $C$DW$T$50, DW_AT_name("DBFEDHR_REG")
    2273                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    2274              $C$DW$135       .dwtag  DW_TAG_member
    2275                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2276                      .dwattr $C$DW$135, DW_AT_name("all")
    2277                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_all")
    2278                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2279                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2280              
    2281              $C$DW$136       .dwtag  DW_TAG_member
    2282                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$49)
    2283                      .dwattr $C$DW$136, DW_AT_name("bit")
    2284                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_bit")
    2285                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2286                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2287              
    2288                      .dwendtag $C$DW$T$50
    2289              
    2290              
    2291              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    2292                      .dwattr $C$DW$T$51, DW_AT_name("DBREDHR_BITS")
    2293                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    2294              $C$DW$137       .dwtag  DW_TAG_member
    2295                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2296                      .dwattr $C$DW$137, DW_AT_name("rsvd1")
    2297                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd1")
    2298                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0f)
    2299                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2300                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2301                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2302              
    2303              $C$DW$138       .dwtag  DW_TAG_member
    2304                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2305                      .dwattr $C$DW$138, DW_AT_name("rsvd2")
    2306                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd2")
    2307                      .dwattr $C$DW$138, DW_AT_bit_offset(0x08)
    2308                      .dwattr $C$DW$138, DW_AT_bit_size(0x07)
    2309                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2310                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2311              
    2312              $C$DW$139       .dwtag  DW_TAG_member
    2313                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2314                      .dwattr $C$DW$139, DW_AT_name("rsvd3")
    2315                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd3")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   55

    2316                      .dwattr $C$DW$139, DW_AT_bit_offset(0x07)
    2317                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2318                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2319                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2320              
    2321              $C$DW$140       .dwtag  DW_TAG_member
    2322                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2323                      .dwattr $C$DW$140, DW_AT_name("DBREDHR")
    2324                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_DBREDHR")
    2325                      .dwattr $C$DW$140, DW_AT_bit_offset(0x00)
    2326                      .dwattr $C$DW$140, DW_AT_bit_size(0x07)
    2327                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2328                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2329              
    2330                      .dwendtag $C$DW$T$51
    2331              
    2332              
    2333              $C$DW$T$52      .dwtag  DW_TAG_union_type
    2334                      .dwattr $C$DW$T$52, DW_AT_name("DBREDHR_REG")
    2335                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    2336              $C$DW$141       .dwtag  DW_TAG_member
    2337                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2338                      .dwattr $C$DW$141, DW_AT_name("all")
    2339                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_all")
    2340                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2341                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2342              
    2343              $C$DW$142       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$51)
    2345                      .dwattr $C$DW$142, DW_AT_name("bit")
    2346                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_bit")
    2347                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2348                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2349              
    2350                      .dwendtag $C$DW$T$52
    2351              
    2352              
    2353              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2354                      .dwattr $C$DW$T$53, DW_AT_name("DCACTL_BITS")
    2355                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    2356              $C$DW$143       .dwtag  DW_TAG_member
    2357                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2358                      .dwattr $C$DW$143, DW_AT_name("EVT1SRCSEL")
    2359                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_EVT1SRCSEL")
    2360                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0f)
    2361                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2362                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2363                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2364              
    2365              $C$DW$144       .dwtag  DW_TAG_member
    2366                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2367                      .dwattr $C$DW$144, DW_AT_name("EVT1FRCSYNCSEL")
    2368                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_EVT1FRCSYNCSEL")
    2369                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0e)
    2370                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
cla_pwm_setup.asm                                                    PAGE   56

    2371                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2372                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2373              
    2374              $C$DW$145       .dwtag  DW_TAG_member
    2375                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2376                      .dwattr $C$DW$145, DW_AT_name("EVT1SOCE")
    2377                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_EVT1SOCE")
    2378                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0d)
    2379                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2380                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2381                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2382              
    2383              $C$DW$146       .dwtag  DW_TAG_member
    2384                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2385                      .dwattr $C$DW$146, DW_AT_name("EVT1SYNCE")
    2386                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_EVT1SYNCE")
    2387                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0c)
    2388                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2389                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2390                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2391              
    2392              $C$DW$147       .dwtag  DW_TAG_member
    2393                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2394                      .dwattr $C$DW$147, DW_AT_name("rsvd1")
    2395                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_rsvd1")
    2396                      .dwattr $C$DW$147, DW_AT_bit_offset(0x08)
    2397                      .dwattr $C$DW$147, DW_AT_bit_size(0x04)
    2398                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2399                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2400              
    2401              $C$DW$148       .dwtag  DW_TAG_member
    2402                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2403                      .dwattr $C$DW$148, DW_AT_name("EVT2SRCSEL")
    2404                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_EVT2SRCSEL")
    2405                      .dwattr $C$DW$148, DW_AT_bit_offset(0x07)
    2406                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2407                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2408                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2409              
    2410              $C$DW$149       .dwtag  DW_TAG_member
    2411                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2412                      .dwattr $C$DW$149, DW_AT_name("EVT2FRCSYNCSEL")
    2413                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_EVT2FRCSYNCSEL")
    2414                      .dwattr $C$DW$149, DW_AT_bit_offset(0x06)
    2415                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2416                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2417                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2418              
    2419              $C$DW$150       .dwtag  DW_TAG_member
    2420                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2421                      .dwattr $C$DW$150, DW_AT_name("rsvd2")
    2422                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd2")
    2423                      .dwattr $C$DW$150, DW_AT_bit_offset(0x00)
