TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Fri Jul 31 12:09:42 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../config.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Chiaming\CCSworkspace_V10\MonoMtrServo_377s\F2837x_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_SetupPinOptions")

    1376 000001c6 1A00!         OR        @$BLOCKED(_AdcbRegs),#0x0004 ; [CPU_ALU] |233| 
         000001c7 0004 
    1377 000001c8 761F!         MOVW      DP,#_AdccRegs         ; [CPU_ARAU] 
         000001c9 0000 
    1378                      .dwpsn  file "../config.c",line 244,column 2,is_stmt,isa 0
    1379 000001ca A8A9          MOVL      ACC,XAR4              ; [CPU_ALU] |244| 
    1380                      .dwpsn  file "../config.c",line 234,column 5,is_stmt,isa 0
    1381 000001cb 1A00!         OR        @$BLOCKED(_AdccRegs),#0x0004 ; [CPU_ALU] |234| 
         000001cc 0004 
    1382 000001cd 761F!         MOVW      DP,#_AdcdRegs         ; [CPU_ARAU] 
         000001ce 0000 
    1383                      .dwpsn  file "../config.c",line 235,column 5,is_stmt,isa 0
    1384 000001cf 1A00!         OR        @$BLOCKED(_AdcdRegs),#0x0004 ; [CPU_ALU] |235| 
         000001d0 0004 
    1385 000001d1 761F!         MOVW      DP,#_AdcaRegs         ; [CPU_ARAU] 
         000001d2 0000 
    1386                      .dwpsn  file "../config.c",line 238,column 2,is_stmt,isa 0
    1387 000001d3 1A00!         OR        @$BLOCKED(_AdcaRegs),#0x0080 ; [CPU_ALU] |238| 
         000001d4 0080 
    1388 000001d5 761F!         MOVW      DP,#_AdcbRegs         ; [CPU_ARAU] 
         000001d6 0000 
    1389                      .dwpsn  file "../config.c",line 239,column 2,is_stmt,isa 0
    1390 000001d7 1A00!         OR        @$BLOCKED(_AdcbRegs),#0x0080 ; [CPU_ALU] |239| 
         000001d8 0080 
    1391 000001d9 761F!         MOVW      DP,#_AdccRegs         ; [CPU_ARAU] 
         000001da 0000 
    1392                      .dwpsn  file "../config.c",line 240,column 5,is_stmt,isa 0
    1393 000001db 1A00!         OR        @$BLOCKED(_AdccRegs),#0x0080 ; [CPU_ALU] |240| 
         000001dc 0080 
    1394 000001dd 761F!         MOVW      DP,#_AdcdRegs         ; [CPU_ARAU] 
         000001de 0000 
    1395                      .dwpsn  file "../config.c",line 241,column 5,is_stmt,isa 0
    1396 000001df 1A00!         OR        @$BLOCKED(_AdcdRegs),#0x0080 ; [CPU_ALU] |241| 
         000001e0 0080 
    1397                      .dwpsn  file "../config.c",line 244,column 2,is_stmt,isa 0
    1398              $C$DW$102       .dwtag  DW_TAG_TI_branch
    1399                      .dwattr $C$DW$102, DW_AT_low_pc(0x00)
    1400                      .dwattr $C$DW$102, DW_AT_name("_F28x_usDelay")
    1401                      .dwattr $C$DW$102, DW_AT_TI_call
    1402              
    1403 000001e1 7640!         LCR       #_F28x_usDelay        ; [CPU_ALU] |244| 
         000001e2 0000 
    1404                      ; call occurs [#_F28x_usDelay] ; [] |244| 
    1405 000001e3 761A   EDIS
    1406 000001e4 FF69          SPM       #0                    ; [CPU_ALU] 
    1407              $C$DW$103       .dwtag  DW_TAG_TI_branch
    1408                      .dwattr $C$DW$103, DW_AT_low_pc(0x00)
    1409                      .dwattr $C$DW$103, DW_AT_TI_return
    1410              
    1411 000001e5 0006          LRETR     ; [CPU_ALU] 
    1412                      ; return occurs ; [] 
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   29

    1413                      .dwattr $C$DW$97, DW_AT_TI_end_file("../config.c")
    1414                      .dwattr $C$DW$97, DW_AT_TI_end_line(0xf7)
    1415                      .dwattr $C$DW$97, DW_AT_TI_end_column(0x01)
    1416                      .dwendentry
    1417                      .dwendtag $C$DW$97
    1418              
    1419              ;**************************************************************
    1420              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1421              ;**************************************************************
    1422                      .global _GPIO_SetupPinOptions
    1423                      .global _GPIO_SetupPinMux
    1424                      .global _GPIO_WritePin
    1425                      .global _DisableDog
    1426                      .global _InitFlash_Bank0
    1427                      .global _GPIO_EnableUnbondedIOPullups
    1428                      .global _InitSysPll
    1429                      .global _InitPeripheralClocks
    1430                      .global _AdcSetMode
    1431                      .global _F28x_usDelay
    1432                      .global _RamfuncsLoadStart
    1433                      .global _RamfuncsLoadSize
    1434                      .global _RamfuncsRunStart
    1435                      .global _AnalogSubsysRegs
    1436                      .global _AdcaRegs
    1437                      .global _AdcbRegs
    1438                      .global _AdccRegs
    1439                      .global _AdcdRegs
    1440                      .global _CpuSysRegs
    1441                      .global _memcpy
    1442              
    1443              ;***************************************************************
    1444              ;* TYPE INFORMATION                                            *
    1445              ;***************************************************************
    1446              
    1447              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1448                      .dwattr $C$DW$T$20, DW_AT_name("ADCBURSTCTL_BITS")
    1449                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1450              $C$DW$104       .dwtag  DW_TAG_member
    1451                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1452                      .dwattr $C$DW$104, DW_AT_name("BURSTTRIGSEL")
    1453                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
    1454                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0a)
    1455                      .dwattr $C$DW$104, DW_AT_bit_size(0x06)
    1456                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1457                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1458              
    1459              $C$DW$105       .dwtag  DW_TAG_member
    1460                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1461                      .dwattr $C$DW$105, DW_AT_name("rsvd1")
    1462                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd1")
    1463                      .dwattr $C$DW$105, DW_AT_bit_offset(0x08)
    1464                      .dwattr $C$DW$105, DW_AT_bit_size(0x02)
    1465                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1466                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1467              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   30

    1468              $C$DW$106       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1470                      .dwattr $C$DW$106, DW_AT_name("BURSTSIZE")
    1471                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_BURSTSIZE")
    1472                      .dwattr $C$DW$106, DW_AT_bit_offset(0x04)
    1473                      .dwattr $C$DW$106, DW_AT_bit_size(0x04)
    1474                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1475                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1476              
    1477              $C$DW$107       .dwtag  DW_TAG_member
    1478                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1479                      .dwattr $C$DW$107, DW_AT_name("rsvd2")
    1480                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd2")
    1481                      .dwattr $C$DW$107, DW_AT_bit_offset(0x01)
    1482                      .dwattr $C$DW$107, DW_AT_bit_size(0x03)
    1483                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1484                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1485              
    1486              $C$DW$108       .dwtag  DW_TAG_member
    1487                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1488                      .dwattr $C$DW$108, DW_AT_name("BURSTEN")
    1489                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_BURSTEN")
    1490                      .dwattr $C$DW$108, DW_AT_bit_offset(0x00)
    1491                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1492                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1493                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1494              
    1495                      .dwendtag $C$DW$T$20
    1496              
    1497              
    1498              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1499                      .dwattr $C$DW$T$21, DW_AT_name("ADCBURSTCTL_REG")
    1500                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1501              $C$DW$109       .dwtag  DW_TAG_member
    1502                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1503                      .dwattr $C$DW$109, DW_AT_name("all")
    1504                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_all")
    1505                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1506                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1507              
    1508              $C$DW$110       .dwtag  DW_TAG_member
    1509                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
    1510                      .dwattr $C$DW$110, DW_AT_name("bit")
    1511                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_bit")
    1512                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1513                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1514              
    1515                      .dwendtag $C$DW$T$21
    1516              
    1517              
    1518              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1519                      .dwattr $C$DW$T$22, DW_AT_name("ADCCOUNTER_BITS")
    1520                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1521              $C$DW$111       .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   31

    1523                      .dwattr $C$DW$111, DW_AT_name("FREECOUNT")
    1524                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_FREECOUNT")
    1525                      .dwattr $C$DW$111, DW_AT_bit_offset(0x04)
    1526                      .dwattr $C$DW$111, DW_AT_bit_size(0x0c)
    1527                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1528                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1529              
    1530              $C$DW$112       .dwtag  DW_TAG_member
    1531                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1532                      .dwattr $C$DW$112, DW_AT_name("rsvd1")
    1533                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd1")
    1534                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00)
    1535                      .dwattr $C$DW$112, DW_AT_bit_size(0x04)
    1536                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1537                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1538              
    1539                      .dwendtag $C$DW$T$22
    1540              
    1541              
    1542              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1543                      .dwattr $C$DW$T$23, DW_AT_name("ADCCOUNTER_REG")
    1544                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1545              $C$DW$113       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1547                      .dwattr $C$DW$113, DW_AT_name("all")
    1548                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_all")
    1549                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1550                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1551              
    1552              $C$DW$114       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$22)
    1554                      .dwattr $C$DW$114, DW_AT_name("bit")
    1555                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_bit")
    1556                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1557                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1558              
    1559                      .dwendtag $C$DW$T$23
    1560              
    1561              
    1562              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1563                      .dwattr $C$DW$T$24, DW_AT_name("ADCCTL1_BITS")
    1564                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1565              $C$DW$115       .dwtag  DW_TAG_member
    1566                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1567                      .dwattr $C$DW$115, DW_AT_name("rsvd1")
    1568                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd1")
    1569                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0e)
    1570                      .dwattr $C$DW$115, DW_AT_bit_size(0x02)
    1571                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1572                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1573              
    1574              $C$DW$116       .dwtag  DW_TAG_member
    1575                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1576                      .dwattr $C$DW$116, DW_AT_name("INTPULSEPOS")
    1577                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_INTPULSEPOS")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   32

    1578                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0d)
    1579                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1580                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1581                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1582              
    1583              $C$DW$117       .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1585                      .dwattr $C$DW$117, DW_AT_name("rsvd2")
    1586                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd2")
    1587                      .dwattr $C$DW$117, DW_AT_bit_offset(0x09)
    1588                      .dwattr $C$DW$117, DW_AT_bit_size(0x04)
    1589                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1590                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1591              
    1592              $C$DW$118       .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1594                      .dwattr $C$DW$118, DW_AT_name("ADCPWDNZ")
    1595                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_ADCPWDNZ")
    1596                      .dwattr $C$DW$118, DW_AT_bit_offset(0x08)
    1597                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1598                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1599                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1600              
    1601              $C$DW$119       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1603                      .dwattr $C$DW$119, DW_AT_name("ADCBSYCHN")
    1604                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_ADCBSYCHN")
    1605                      .dwattr $C$DW$119, DW_AT_bit_offset(0x04)
    1606                      .dwattr $C$DW$119, DW_AT_bit_size(0x04)
    1607                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1608                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1609              
    1610              $C$DW$120       .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1612                      .dwattr $C$DW$120, DW_AT_name("rsvd3")
    1613                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd3")
    1614                      .dwattr $C$DW$120, DW_AT_bit_offset(0x03)
    1615                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1616                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1617                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1618              
    1619              $C$DW$121       .dwtag  DW_TAG_member
    1620                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1621                      .dwattr $C$DW$121, DW_AT_name("ADCBSY")
    1622                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_ADCBSY")
    1623                      .dwattr $C$DW$121, DW_AT_bit_offset(0x02)
    1624                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1625                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1626                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1627              
    1628              $C$DW$122       .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1630                      .dwattr $C$DW$122, DW_AT_name("rsvd4")
    1631                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd4")
    1632                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   33

    1633                      .dwattr $C$DW$122, DW_AT_bit_size(0x02)
    1634                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1635                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1636              
    1637                      .dwendtag $C$DW$T$24
    1638              
    1639              
    1640              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1641                      .dwattr $C$DW$T$25, DW_AT_name("ADCCTL1_REG")
    1642                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1643              $C$DW$123       .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1645                      .dwattr $C$DW$123, DW_AT_name("all")
    1646                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_all")
    1647                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1649              
    1650              $C$DW$124       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$24)
    1652                      .dwattr $C$DW$124, DW_AT_name("bit")
    1653                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_bit")
    1654                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1655                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1656              
    1657                      .dwendtag $C$DW$T$25
    1658              
    1659              
    1660              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1661                      .dwattr $C$DW$T$26, DW_AT_name("ADCCTL2_BITS")
    1662                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1663              $C$DW$125       .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1665                      .dwattr $C$DW$125, DW_AT_name("PRESCALE")
    1666                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_PRESCALE")
    1667                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0c)
    1668                      .dwattr $C$DW$125, DW_AT_bit_size(0x04)
    1669                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1670                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1671              
    1672              $C$DW$126       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1674                      .dwattr $C$DW$126, DW_AT_name("rsvd1")
    1675                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd1")
    1676                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0a)
    1677                      .dwattr $C$DW$126, DW_AT_bit_size(0x02)
    1678                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1679                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1680              
    1681              $C$DW$127       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1683                      .dwattr $C$DW$127, DW_AT_name("RESOLUTION")
    1684                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_RESOLUTION")
    1685                      .dwattr $C$DW$127, DW_AT_bit_offset(0x09)
    1686                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1687                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   34

    1688                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1689              
    1690              $C$DW$128       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1692                      .dwattr $C$DW$128, DW_AT_name("SIGNALMODE")
    1693                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_SIGNALMODE")
    1694                      .dwattr $C$DW$128, DW_AT_bit_offset(0x08)
    1695                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1696                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1697                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1698              
    1699              $C$DW$129       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1701                      .dwattr $C$DW$129, DW_AT_name("rsvd2")
    1702                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd2")
    1703                      .dwattr $C$DW$129, DW_AT_bit_offset(0x03)
    1704                      .dwattr $C$DW$129, DW_AT_bit_size(0x05)
    1705                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1706                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1707              
    1708              $C$DW$130       .dwtag  DW_TAG_member
    1709                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1710                      .dwattr $C$DW$130, DW_AT_name("rsvd3")
    1711                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd3")
    1712                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    1713                      .dwattr $C$DW$130, DW_AT_bit_size(0x03)
    1714                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1715                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1716              
    1717                      .dwendtag $C$DW$T$26
    1718              
    1719              
    1720              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1721                      .dwattr $C$DW$T$27, DW_AT_name("ADCCTL2_REG")
    1722                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1723              $C$DW$131       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1725                      .dwattr $C$DW$131, DW_AT_name("all")
    1726                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_all")
    1727                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1728                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1729              
    1730              $C$DW$132       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$26)
    1732                      .dwattr $C$DW$132, DW_AT_name("bit")
    1733                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_bit")
    1734                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1735                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1736              
    1737                      .dwendtag $C$DW$T$27
    1738              
    1739              
    1740              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1741                      .dwattr $C$DW$T$28, DW_AT_name("ADCEVTCLR_BITS")
    1742                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   35

    1743              $C$DW$133       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$133, DW_AT_name("PPB1TRIPHI")
    1746                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1747                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0f)
    1748                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1749                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1751              
    1752              $C$DW$134       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$134, DW_AT_name("PPB1TRIPLO")
    1755                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1756                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0e)
    1757                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1758                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1759                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1760              
    1761              $C$DW$135       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1763                      .dwattr $C$DW$135, DW_AT_name("PPB1ZERO")
    1764                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_PPB1ZERO")
    1765                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0d)
    1766                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1767                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1769              
    1770              $C$DW$136       .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1772                      .dwattr $C$DW$136, DW_AT_name("rsvd1")
    1773                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd1")
    1774                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0c)
    1775                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1776                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1777                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1778              
    1779              $C$DW$137       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1781                      .dwattr $C$DW$137, DW_AT_name("PPB2TRIPHI")
    1782                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1783                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0b)
    1784                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1785                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1786                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1787              
    1788              $C$DW$138       .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1790                      .dwattr $C$DW$138, DW_AT_name("PPB2TRIPLO")
    1791                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1792                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0a)
    1793                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1794                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1795                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1796              
    1797              $C$DW$139       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   36

    1798                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1799                      .dwattr $C$DW$139, DW_AT_name("PPB2ZERO")
    1800                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_PPB2ZERO")
    1801                      .dwattr $C$DW$139, DW_AT_bit_offset(0x09)
    1802                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1803                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1804                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1805              
    1806              $C$DW$140       .dwtag  DW_TAG_member
    1807                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1808                      .dwattr $C$DW$140, DW_AT_name("rsvd2")
    1809                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_rsvd2")
    1810                      .dwattr $C$DW$140, DW_AT_bit_offset(0x08)
    1811                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1812                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1813                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1814              
    1815              $C$DW$141       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1817                      .dwattr $C$DW$141, DW_AT_name("PPB3TRIPHI")
    1818                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1819                      .dwattr $C$DW$141, DW_AT_bit_offset(0x07)
    1820                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1821                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1823              
    1824              $C$DW$142       .dwtag  DW_TAG_member
    1825                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1826                      .dwattr $C$DW$142, DW_AT_name("PPB3TRIPLO")
    1827                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1828                      .dwattr $C$DW$142, DW_AT_bit_offset(0x06)
    1829                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1830                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1831                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1832              
    1833              $C$DW$143       .dwtag  DW_TAG_member
    1834                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1835                      .dwattr $C$DW$143, DW_AT_name("PPB3ZERO")
    1836                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PPB3ZERO")
    1837                      .dwattr $C$DW$143, DW_AT_bit_offset(0x05)
    1838                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1839                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1840                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1841              
    1842              $C$DW$144       .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1844                      .dwattr $C$DW$144, DW_AT_name("rsvd3")
    1845                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd3")
    1846                      .dwattr $C$DW$144, DW_AT_bit_offset(0x04)
    1847                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1848                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1849                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1850              
    1851              $C$DW$145       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   37

    1853                      .dwattr $C$DW$145, DW_AT_name("PPB4TRIPHI")
    1854                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1855                      .dwattr $C$DW$145, DW_AT_bit_offset(0x03)
    1856                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1857                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1858                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1859              
    1860              $C$DW$146       .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1862                      .dwattr $C$DW$146, DW_AT_name("PPB4TRIPLO")
    1863                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1864                      .dwattr $C$DW$146, DW_AT_bit_offset(0x02)
    1865                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1866                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1867                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1868              
    1869              $C$DW$147       .dwtag  DW_TAG_member
    1870                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1871                      .dwattr $C$DW$147, DW_AT_name("PPB4ZERO")
    1872                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PPB4ZERO")
    1873                      .dwattr $C$DW$147, DW_AT_bit_offset(0x01)
    1874                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1875                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1876                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1877              
    1878              $C$DW$148       .dwtag  DW_TAG_member
    1879                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1880                      .dwattr $C$DW$148, DW_AT_name("rsvd4")
    1881                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_rsvd4")
    1882                      .dwattr $C$DW$148, DW_AT_bit_offset(0x00)
    1883                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1884                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1885                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1886              
    1887                      .dwendtag $C$DW$T$28
    1888              
    1889              
    1890              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1891                      .dwattr $C$DW$T$29, DW_AT_name("ADCEVTCLR_REG")
    1892                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1893              $C$DW$149       .dwtag  DW_TAG_member
    1894                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1895                      .dwattr $C$DW$149, DW_AT_name("all")
    1896                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_all")
    1897                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1898                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1899              
    1900              $C$DW$150       .dwtag  DW_TAG_member
    1901                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$28)
    1902                      .dwattr $C$DW$150, DW_AT_name("bit")
    1903                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_bit")
    1904                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1905                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1906              
    1907                      .dwendtag $C$DW$T$29
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   38

    1908              
    1909              
    1910              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1911                      .dwattr $C$DW$T$30, DW_AT_name("ADCEVTINTSEL_BITS")
    1912                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1913              $C$DW$151       .dwtag  DW_TAG_member
    1914                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1915                      .dwattr $C$DW$151, DW_AT_name("PPB1TRIPHI")
    1916                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1917                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0f)
    1918                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1919                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1920                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1921              
    1922              $C$DW$152       .dwtag  DW_TAG_member
    1923                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1924                      .dwattr $C$DW$152, DW_AT_name("PPB1TRIPLO")
    1925                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1926                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0e)
    1927                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1928                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1929                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1930              
    1931              $C$DW$153       .dwtag  DW_TAG_member
    1932                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1933                      .dwattr $C$DW$153, DW_AT_name("PPB1ZERO")
    1934                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_PPB1ZERO")
    1935                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0d)
    1936                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1937                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1938                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1939              
    1940              $C$DW$154       .dwtag  DW_TAG_member
    1941                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1942                      .dwattr $C$DW$154, DW_AT_name("rsvd1")
    1943                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd1")
    1944                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0c)
    1945                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1946                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1947                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1948              
    1949              $C$DW$155       .dwtag  DW_TAG_member
    1950                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1951                      .dwattr $C$DW$155, DW_AT_name("PPB2TRIPHI")
    1952                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1953                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0b)
    1954                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1955                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1956                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1957              
    1958              $C$DW$156       .dwtag  DW_TAG_member
    1959                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1960                      .dwattr $C$DW$156, DW_AT_name("PPB2TRIPLO")
    1961                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1962                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0a)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   39

    1963                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1964                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1965                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1966              
    1967              $C$DW$157       .dwtag  DW_TAG_member
    1968                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1969                      .dwattr $C$DW$157, DW_AT_name("PPB2ZERO")
    1970                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_PPB2ZERO")
    1971                      .dwattr $C$DW$157, DW_AT_bit_offset(0x09)
    1972                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    1973                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1974                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1975              
    1976              $C$DW$158       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1978                      .dwattr $C$DW$158, DW_AT_name("rsvd2")
    1979                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd2")
    1980                      .dwattr $C$DW$158, DW_AT_bit_offset(0x08)
    1981                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    1982                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1983                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1984              
    1985              $C$DW$159       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1987                      .dwattr $C$DW$159, DW_AT_name("PPB3TRIPHI")
    1988                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1989                      .dwattr $C$DW$159, DW_AT_bit_offset(0x07)
    1990                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    1991                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1992                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1993              
    1994              $C$DW$160       .dwtag  DW_TAG_member
    1995                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1996                      .dwattr $C$DW$160, DW_AT_name("PPB3TRIPLO")
    1997                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1998                      .dwattr $C$DW$160, DW_AT_bit_offset(0x06)
    1999                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2000                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2002              
    2003              $C$DW$161       .dwtag  DW_TAG_member
    2004                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2005                      .dwattr $C$DW$161, DW_AT_name("PPB3ZERO")
    2006                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PPB3ZERO")
    2007                      .dwattr $C$DW$161, DW_AT_bit_offset(0x05)
    2008                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2009                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2010                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2011              
    2012              $C$DW$162       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2014                      .dwattr $C$DW$162, DW_AT_name("rsvd3")
    2015                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd3")
    2016                      .dwattr $C$DW$162, DW_AT_bit_offset(0x04)
    2017                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   40

    2018                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2019                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2020              
    2021              $C$DW$163       .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2023                      .dwattr $C$DW$163, DW_AT_name("PPB4TRIPHI")
    2024                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2025                      .dwattr $C$DW$163, DW_AT_bit_offset(0x03)
    2026                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2027                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2028                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2029              
    2030              $C$DW$164       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2032                      .dwattr $C$DW$164, DW_AT_name("PPB4TRIPLO")
    2033                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2034                      .dwattr $C$DW$164, DW_AT_bit_offset(0x02)
    2035                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2036                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2037                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2038              
    2039              $C$DW$165       .dwtag  DW_TAG_member
    2040                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2041                      .dwattr $C$DW$165, DW_AT_name("PPB4ZERO")
    2042                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_PPB4ZERO")
    2043                      .dwattr $C$DW$165, DW_AT_bit_offset(0x01)
    2044                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2045                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2046                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2047              
    2048              $C$DW$166       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2050                      .dwattr $C$DW$166, DW_AT_name("rsvd4")
    2051                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd4")
    2052                      .dwattr $C$DW$166, DW_AT_bit_offset(0x00)
    2053                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2054                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2055                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2056              
    2057                      .dwendtag $C$DW$T$30
    2058              
    2059              
    2060              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2061                      .dwattr $C$DW$T$31, DW_AT_name("ADCEVTINTSEL_REG")
    2062                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2063              $C$DW$167       .dwtag  DW_TAG_member
    2064                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2065                      .dwattr $C$DW$167, DW_AT_name("all")
    2066                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_all")
    2067                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2068                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2069              
    2070              $C$DW$168       .dwtag  DW_TAG_member
    2071                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$30)
    2072                      .dwattr $C$DW$168, DW_AT_name("bit")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   41

    2073                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_bit")
    2074                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2075                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2076              
    2077                      .dwendtag $C$DW$T$31
    2078              
    2079              
    2080              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2081                      .dwattr $C$DW$T$32, DW_AT_name("ADCEVTSEL_BITS")
    2082                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2083              $C$DW$169       .dwtag  DW_TAG_member
    2084                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2085                      .dwattr $C$DW$169, DW_AT_name("PPB1TRIPHI")
    2086                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2087                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0f)
    2088                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2089                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2090                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2091              
    2092              $C$DW$170       .dwtag  DW_TAG_member
    2093                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2094                      .dwattr $C$DW$170, DW_AT_name("PPB1TRIPLO")
    2095                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    2096                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0e)
    2097                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2098                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2099                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2100              
    2101              $C$DW$171       .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2103                      .dwattr $C$DW$171, DW_AT_name("PPB1ZERO")
    2104                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PPB1ZERO")
    2105                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0d)
    2106                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2107                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2108                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2109              
    2110              $C$DW$172       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2112                      .dwattr $C$DW$172, DW_AT_name("rsvd1")
    2113                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd1")
    2114                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0c)
    2115                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2116                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2117                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2118              
    2119              $C$DW$173       .dwtag  DW_TAG_member
    2120                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2121                      .dwattr $C$DW$173, DW_AT_name("PPB2TRIPHI")
    2122                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    2123                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0b)
    2124                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2125                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2126                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2127              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   42

    2128              $C$DW$174       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2130                      .dwattr $C$DW$174, DW_AT_name("PPB2TRIPLO")
    2131                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2132                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0a)
    2133                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2134                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2135                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2136              
    2137              $C$DW$175       .dwtag  DW_TAG_member
    2138                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2139                      .dwattr $C$DW$175, DW_AT_name("PPB2ZERO")
    2140                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PPB2ZERO")
    2141                      .dwattr $C$DW$175, DW_AT_bit_offset(0x09)
    2142                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2143                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2144                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2145              
    2146              $C$DW$176       .dwtag  DW_TAG_member
    2147                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2148                      .dwattr $C$DW$176, DW_AT_name("rsvd2")
    2149                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd2")
    2150                      .dwattr $C$DW$176, DW_AT_bit_offset(0x08)
    2151                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2152                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2153                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2154              
    2155              $C$DW$177       .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2157                      .dwattr $C$DW$177, DW_AT_name("PPB3TRIPHI")
    2158                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2159                      .dwattr $C$DW$177, DW_AT_bit_offset(0x07)
    2160                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2161                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2162                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2163              
    2164              $C$DW$178       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2166                      .dwattr $C$DW$178, DW_AT_name("PPB3TRIPLO")
    2167                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2168                      .dwattr $C$DW$178, DW_AT_bit_offset(0x06)
    2169                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    2170                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2171                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2172              
    2173              $C$DW$179       .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2175                      .dwattr $C$DW$179, DW_AT_name("PPB3ZERO")
    2176                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_PPB3ZERO")
    2177                      .dwattr $C$DW$179, DW_AT_bit_offset(0x05)
    2178                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2179                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2180                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2181              
    2182              $C$DW$180       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   43

    2183                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2184                      .dwattr $C$DW$180, DW_AT_name("rsvd3")
    2185                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd3")
    2186                      .dwattr $C$DW$180, DW_AT_bit_offset(0x04)
    2187                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2188                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2189                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2190              
    2191              $C$DW$181       .dwtag  DW_TAG_member
    2192                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2193                      .dwattr $C$DW$181, DW_AT_name("PPB4TRIPHI")
    2194                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2195                      .dwattr $C$DW$181, DW_AT_bit_offset(0x03)
    2196                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    2197                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2198                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2199              
    2200              $C$DW$182       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2202                      .dwattr $C$DW$182, DW_AT_name("PPB4TRIPLO")
    2203                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2204                      .dwattr $C$DW$182, DW_AT_bit_offset(0x02)
    2205                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    2206                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2207                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2208              
    2209              $C$DW$183       .dwtag  DW_TAG_member
    2210                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2211                      .dwattr $C$DW$183, DW_AT_name("PPB4ZERO")
    2212                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_PPB4ZERO")
    2213                      .dwattr $C$DW$183, DW_AT_bit_offset(0x01)
    2214                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    2215                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2216                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2217              
    2218              $C$DW$184       .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2220                      .dwattr $C$DW$184, DW_AT_name("rsvd4")
    2221                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_rsvd4")
    2222                      .dwattr $C$DW$184, DW_AT_bit_offset(0x00)
    2223                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    2224                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2225                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2226              
    2227                      .dwendtag $C$DW$T$32
    2228              
    2229              
    2230              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2231                      .dwattr $C$DW$T$33, DW_AT_name("ADCEVTSEL_REG")
    2232                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2233              $C$DW$185       .dwtag  DW_TAG_member
    2234                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2235                      .dwattr $C$DW$185, DW_AT_name("all")
    2236                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_all")
    2237                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   44

    2238                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2239              
    2240              $C$DW$186       .dwtag  DW_TAG_member
    2241                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$32)
    2242                      .dwattr $C$DW$186, DW_AT_name("bit")
    2243                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_bit")
    2244                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2245                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2246              
    2247                      .dwendtag $C$DW$T$33
    2248              
    2249              
    2250              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2251                      .dwattr $C$DW$T$34, DW_AT_name("ADCEVTSTAT_BITS")
    2252                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2253              $C$DW$187       .dwtag  DW_TAG_member
    2254                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2255                      .dwattr $C$DW$187, DW_AT_name("PPB1TRIPHI")
    2256                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2257                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0f)
    2258                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    2259                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2260                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2261              
    2262              $C$DW$188       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2264                      .dwattr $C$DW$188, DW_AT_name("PPB1TRIPLO")
    2265                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    2266                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0e)
    2267                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2268                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2269                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2270              
    2271              $C$DW$189       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2273                      .dwattr $C$DW$189, DW_AT_name("PPB1ZERO")
    2274                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_PPB1ZERO")
    2275                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0d)
    2276                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2277                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2278                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2279              
    2280              $C$DW$190       .dwtag  DW_TAG_member
    2281                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2282                      .dwattr $C$DW$190, DW_AT_name("rsvd1")
    2283                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_rsvd1")
    2284                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0c)
    2285                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2286                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2287                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2288              
    2289              $C$DW$191       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2291                      .dwattr $C$DW$191, DW_AT_name("PPB2TRIPHI")
    2292                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_PPB2TRIPHI")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   45

    2293                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0b)
    2294                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2295                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2296                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2297              
    2298              $C$DW$192       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2300                      .dwattr $C$DW$192, DW_AT_name("PPB2TRIPLO")
    2301                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2302                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0a)
    2303                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2304                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2305                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2306              
    2307              $C$DW$193       .dwtag  DW_TAG_member
    2308                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2309                      .dwattr $C$DW$193, DW_AT_name("PPB2ZERO")
    2310                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_PPB2ZERO")
    2311                      .dwattr $C$DW$193, DW_AT_bit_offset(0x09)
    2312                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2313                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2314                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2315              
    2316              $C$DW$194       .dwtag  DW_TAG_member
    2317                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2318                      .dwattr $C$DW$194, DW_AT_name("rsvd2")
    2319                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_rsvd2")
    2320                      .dwattr $C$DW$194, DW_AT_bit_offset(0x08)
    2321                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2322                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2323                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2324              
    2325              $C$DW$195       .dwtag  DW_TAG_member
    2326                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2327                      .dwattr $C$DW$195, DW_AT_name("PPB3TRIPHI")
    2328                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2329                      .dwattr $C$DW$195, DW_AT_bit_offset(0x07)
    2330                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2331                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2332                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2333              
    2334              $C$DW$196       .dwtag  DW_TAG_member
    2335                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2336                      .dwattr $C$DW$196, DW_AT_name("PPB3TRIPLO")
    2337                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2338                      .dwattr $C$DW$196, DW_AT_bit_offset(0x06)
    2339                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    2340                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2341                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2342              
    2343              $C$DW$197       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2345                      .dwattr $C$DW$197, DW_AT_name("PPB3ZERO")
    2346                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_PPB3ZERO")
    2347                      .dwattr $C$DW$197, DW_AT_bit_offset(0x05)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   46

    2348                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2349                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2350                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2351              
    2352              $C$DW$198       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2354                      .dwattr $C$DW$198, DW_AT_name("rsvd3")
    2355                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_rsvd3")
    2356                      .dwattr $C$DW$198, DW_AT_bit_offset(0x04)
    2357                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    2358                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2359                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2360              
    2361              $C$DW$199       .dwtag  DW_TAG_member
    2362                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2363                      .dwattr $C$DW$199, DW_AT_name("PPB4TRIPHI")
    2364                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2365                      .dwattr $C$DW$199, DW_AT_bit_offset(0x03)
    2366                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2367                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2368                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2369              
    2370              $C$DW$200       .dwtag  DW_TAG_member
    2371                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2372                      .dwattr $C$DW$200, DW_AT_name("PPB4TRIPLO")
    2373                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2374                      .dwattr $C$DW$200, DW_AT_bit_offset(0x02)
    2375                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2376                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2377                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2378              
    2379              $C$DW$201       .dwtag  DW_TAG_member
    2380                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2381                      .dwattr $C$DW$201, DW_AT_name("PPB4ZERO")
    2382                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_PPB4ZERO")
    2383                      .dwattr $C$DW$201, DW_AT_bit_offset(0x01)
    2384                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    2385                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2386                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2387              
    2388              $C$DW$202       .dwtag  DW_TAG_member
    2389                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2390                      .dwattr $C$DW$202, DW_AT_name("rsvd4")
    2391                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_rsvd4")
    2392                      .dwattr $C$DW$202, DW_AT_bit_offset(0x00)
    2393                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2394                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2395                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2396              
    2397                      .dwendtag $C$DW$T$34
    2398              
    2399              
    2400              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2401                      .dwattr $C$DW$T$35, DW_AT_name("ADCEVTSTAT_REG")
    2402                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   47

    2403              $C$DW$203       .dwtag  DW_TAG_member
    2404                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2405                      .dwattr $C$DW$203, DW_AT_name("all")
    2406                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_all")
    2407                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2408                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2409              
    2410              $C$DW$204       .dwtag  DW_TAG_member
    2411                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$34)
    2412                      .dwattr $C$DW$204, DW_AT_name("bit")
    2413                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_bit")
    2414                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2415                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2416              
    2417                      .dwendtag $C$DW$T$35
    2418              
    2419              
    2420              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2421                      .dwattr $C$DW$T$36, DW_AT_name("ADCINTFLGCLR_BITS")
    2422                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2423              $C$DW$205       .dwtag  DW_TAG_member
    2424                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2425                      .dwattr $C$DW$205, DW_AT_name("ADCINT1")
    2426                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_ADCINT1")
    2427                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0f)
    2428                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    2429                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2430                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2431              
    2432              $C$DW$206       .dwtag  DW_TAG_member
    2433                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2434                      .dwattr $C$DW$206, DW_AT_name("ADCINT2")
    2435                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_ADCINT2")
    2436                      .dwattr $C$DW$206, DW_AT_bit_offset(0x0e)
    2437                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    2438                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2439                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2440              
    2441              $C$DW$207       .dwtag  DW_TAG_member
    2442                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2443                      .dwattr $C$DW$207, DW_AT_name("ADCINT3")
    2444                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_ADCINT3")
    2445                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0d)
    2446                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2447                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2448                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2449              
    2450              $C$DW$208       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2452                      .dwattr $C$DW$208, DW_AT_name("ADCINT4")
    2453                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_ADCINT4")
    2454                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0c)
    2455                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    2456                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2457                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   48

    2458              
    2459              $C$DW$209       .dwtag  DW_TAG_member
    2460                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2461                      .dwattr $C$DW$209, DW_AT_name("rsvd1")
    2462                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_rsvd1")
    2463                      .dwattr $C$DW$209, DW_AT_bit_offset(0x00)
    2464                      .dwattr $C$DW$209, DW_AT_bit_size(0x0c)
    2465                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2466                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2467              
    2468                      .dwendtag $C$DW$T$36
    2469              
    2470              
    2471              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2472                      .dwattr $C$DW$T$37, DW_AT_name("ADCINTFLGCLR_REG")
    2473                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2474              $C$DW$210       .dwtag  DW_TAG_member
    2475                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2476                      .dwattr $C$DW$210, DW_AT_name("all")
    2477                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_all")
    2478                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2479                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2480              
    2481              $C$DW$211       .dwtag  DW_TAG_member
    2482                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$36)
    2483                      .dwattr $C$DW$211, DW_AT_name("bit")
    2484                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_bit")
    2485                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2486                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2487              
    2488                      .dwendtag $C$DW$T$37
    2489              
    2490              
    2491              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2492                      .dwattr $C$DW$T$38, DW_AT_name("ADCINTFLG_BITS")
    2493                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2494              $C$DW$212       .dwtag  DW_TAG_member
    2495                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2496                      .dwattr $C$DW$212, DW_AT_name("ADCINT1")
    2497                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_ADCINT1")
    2498                      .dwattr $C$DW$212, DW_AT_bit_offset(0x0f)
    2499                      .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    2500                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2501                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2502              
    2503              $C$DW$213       .dwtag  DW_TAG_member
    2504                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2505                      .dwattr $C$DW$213, DW_AT_name("ADCINT2")
    2506                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_ADCINT2")
    2507                      .dwattr $C$DW$213, DW_AT_bit_offset(0x0e)
    2508                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    2509                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2510                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2511              
    2512              $C$DW$214       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   49

    2513                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2514                      .dwattr $C$DW$214, DW_AT_name("ADCINT3")
    2515                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_ADCINT3")
    2516                      .dwattr $C$DW$214, DW_AT_bit_offset(0x0d)
    2517                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    2518                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2519                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2520              
    2521              $C$DW$215       .dwtag  DW_TAG_member
    2522                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2523                      .dwattr $C$DW$215, DW_AT_name("ADCINT4")
    2524                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_ADCINT4")
    2525                      .dwattr $C$DW$215, DW_AT_bit_offset(0x0c)
    2526                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    2527                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2528                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2529              
    2530              $C$DW$216       .dwtag  DW_TAG_member
    2531                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2532                      .dwattr $C$DW$216, DW_AT_name("rsvd1")
    2533                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_rsvd1")
    2534                      .dwattr $C$DW$216, DW_AT_bit_offset(0x00)
    2535                      .dwattr $C$DW$216, DW_AT_bit_size(0x0c)
    2536                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2537                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2538              
    2539                      .dwendtag $C$DW$T$38
    2540              
    2541              
    2542              $C$DW$T$39      .dwtag  DW_TAG_union_type
    2543                      .dwattr $C$DW$T$39, DW_AT_name("ADCINTFLG_REG")
    2544                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    2545              $C$DW$217       .dwtag  DW_TAG_member
    2546                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2547                      .dwattr $C$DW$217, DW_AT_name("all")
    2548                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_all")
    2549                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2550                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2551              
    2552              $C$DW$218       .dwtag  DW_TAG_member
    2553                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$38)
    2554                      .dwattr $C$DW$218, DW_AT_name("bit")
    2555                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_bit")
    2556                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2557                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2558              
    2559                      .dwendtag $C$DW$T$39
    2560              
    2561              
    2562              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2563                      .dwattr $C$DW$T$40, DW_AT_name("ADCINTOVFCLR_BITS")
    2564                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2565              $C$DW$219       .dwtag  DW_TAG_member
    2566                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2567                      .dwattr $C$DW$219, DW_AT_name("ADCINT1")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   50

    2568                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_ADCINT1")
    2569                      .dwattr $C$DW$219, DW_AT_bit_offset(0x0f)
    2570                      .dwattr $C$DW$219, DW_AT_bit_size(0x01)
    2571                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2572                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2573              
    2574              $C$DW$220       .dwtag  DW_TAG_member
    2575                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2576                      .dwattr $C$DW$220, DW_AT_name("ADCINT2")
    2577                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_ADCINT2")
    2578                      .dwattr $C$DW$220, DW_AT_bit_offset(0x0e)
    2579                      .dwattr $C$DW$220, DW_AT_bit_size(0x01)
    2580                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2581                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2582              
    2583              $C$DW$221       .dwtag  DW_TAG_member
    2584                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2585                      .dwattr $C$DW$221, DW_AT_name("ADCINT3")
    2586                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_ADCINT3")
    2587                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0d)
    2588                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    2589                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2590                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2591              
    2592              $C$DW$222       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2594                      .dwattr $C$DW$222, DW_AT_name("ADCINT4")
    2595                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_ADCINT4")
    2596                      .dwattr $C$DW$222, DW_AT_bit_offset(0x0c)
    2597                      .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    2598                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2599                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2600              
    2601              $C$DW$223       .dwtag  DW_TAG_member
    2602                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2603                      .dwattr $C$DW$223, DW_AT_name("rsvd1")
    2604                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_rsvd1")
    2605                      .dwattr $C$DW$223, DW_AT_bit_offset(0x00)
    2606                      .dwattr $C$DW$223, DW_AT_bit_size(0x0c)
    2607                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2608                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2609              
    2610                      .dwendtag $C$DW$T$40
    2611              
    2612              
    2613              $C$DW$T$41      .dwtag  DW_TAG_union_type
    2614                      .dwattr $C$DW$T$41, DW_AT_name("ADCINTOVFCLR_REG")
    2615                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2616              $C$DW$224       .dwtag  DW_TAG_member
    2617                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2618                      .dwattr $C$DW$224, DW_AT_name("all")
    2619                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_all")
    2620                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2621                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2622              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   51

    2623              $C$DW$225       .dwtag  DW_TAG_member
    2624                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$40)
    2625                      .dwattr $C$DW$225, DW_AT_name("bit")
    2626                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_bit")
    2627                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2628                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2629              
    2630                      .dwendtag $C$DW$T$41
    2631              
    2632              
    2633              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2634                      .dwattr $C$DW$T$42, DW_AT_name("ADCINTOVF_BITS")
    2635                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2636              $C$DW$226       .dwtag  DW_TAG_member
    2637                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    2638                      .dwattr $C$DW$226, DW_AT_name("ADCINT1")
    2639                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_ADCINT1")
    2640                      .dwattr $C$DW$226, DW_AT_bit_offset(0x0f)
    2641                      .dwattr $C$DW$226, DW_AT_bit_size(0x01)
    2642                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2643                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2644              
    2645              $C$DW$227       .dwtag  DW_TAG_member
    2646                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    2647                      .dwattr $C$DW$227, DW_AT_name("ADCINT2")
    2648                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_ADCINT2")
    2649                      .dwattr $C$DW$227, DW_AT_bit_offset(0x0e)
    2650                      .dwattr $C$DW$227, DW_AT_bit_size(0x01)
    2651                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2652                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2653              
    2654              $C$DW$228       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    2656                      .dwattr $C$DW$228, DW_AT_name("ADCINT3")
    2657                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_ADCINT3")
    2658                      .dwattr $C$DW$228, DW_AT_bit_offset(0x0d)
    2659                      .dwattr $C$DW$228, DW_AT_bit_size(0x01)
    2660                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2661                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2662              
    2663              $C$DW$229       .dwtag  DW_TAG_member
    2664                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    2665                      .dwattr $C$DW$229, DW_AT_name("ADCINT4")
    2666                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_ADCINT4")
    2667                      .dwattr $C$DW$229, DW_AT_bit_offset(0x0c)
    2668                      .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    2669                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2670                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2671              
    2672              $C$DW$230       .dwtag  DW_TAG_member
    2673                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    2674                      .dwattr $C$DW$230, DW_AT_name("rsvd1")
    2675                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_rsvd1")
    2676                      .dwattr $C$DW$230, DW_AT_bit_offset(0x00)
    2677                      .dwattr $C$DW$230, DW_AT_bit_size(0x0c)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:42 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   52

    2678                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2679                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2680              
    2681                      .dwendtag $C$DW$T$42
    2682              
    2683              
    2684              $C$DW$T$43      .dwtag  DW_TAG_union_type
    2685                      .dwattr $C$DW$T$43, DW_AT_name("ADCINTOVF_REG")
    2686                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    2687              $C$DW$231       .dwtag  DW_TAG_member
    2688                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    2689                      .dwattr $C$DW$231, DW_AT_name("all")
    2690                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_all")
    2691                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2692                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2693              
    2694              $C$DW$232       .dwtag  DW_TAG_member
    2695                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$42)
    2696                      .dwattr $C$DW$232, DW_AT_name("bit")
    2697                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_bit")
    2698                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2699                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2700              
    2701                      .dwendtag $C$DW$T$43
    2702              
    2703              
    2704              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2705                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTSEL1N2_BITS")
    2706                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    2707              $C$DW$233       .dwtag  DW_TAG_member
    2708                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    2709                      .dwattr $C$DW$233, DW_AT_name("INT1SEL")
    2710                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_INT1SEL")
    2711                      .dwattr $C$DW$233, DW_AT_bit_offset(0x0c)
    2712                      .dwattr $C$DW$233, DW_AT_bit_size(0x04)
    2713                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2714                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2715              
    2716              $C$DW$234       .dwtag  DW_TAG_member
    2717                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    2718                      .dwattr $C$DW$234, DW_AT_name("rsvd1")
