TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Fri Jul 31 12:09:38 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DRV830x_SPI.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Chiaming\CCSworkspace_V10\MonoMtrServo_377s\F2837x_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_WritePin")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GPIO_WritePin")

     208                      .dwattr $C$DW$19, DW_AT_name("address")
     209                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_address")
     210                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     211                      .dwattr $C$DW$19, DW_AT_location[DW_OP_reg0]
     212              
     213              $C$DW$20        .dwtag  DW_TAG_formal_parameter
     214                      .dwattr $C$DW$20, DW_AT_name("data")
     215                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_data")
     216                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     217                      .dwattr $C$DW$20, DW_AT_location[DW_OP_reg1]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE    5

     218              
     219              
     220              ;***************************************************************
     221              ;* FNAME: _SPIDAC_write                 FR SIZE:   0           *
     222              ;*                                                             *
     223              ;* FUNCTION ENVIRONMENT                                        *
     224              ;*                                                             *
     225              ;* FUNCTION PROPERTIES                                         *
     226              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     227              ;***************************************************************
     228              
     229              _SPIDAC_write:
     230              ;* AL    assigned to _address
     231              $C$DW$21        .dwtag  DW_TAG_variable
     232                      .dwattr $C$DW$21, DW_AT_name("address")
     233                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_address")
     234                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$46)
     235                      .dwattr $C$DW$21, DW_AT_location[DW_OP_reg0]
     236              
     237              ;* AR6   assigned to _data
     238              $C$DW$22        .dwtag  DW_TAG_variable
     239                      .dwattr $C$DW$22, DW_AT_name("data")
     240                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_data")
     241                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$46)
     242                      .dwattr $C$DW$22, DW_AT_location[DW_OP_reg16]
     243              
     244                      .dwcfi  cfa_offset, -2
     245                      .dwcfi  save_reg_to_mem, 26, 0
     246 0000001b 88A8          MOVZ      AR6,AH                ; [CPU_ALU] |139| 
     247                      .dwpsn  file "../DRV830x_SPI.c",line 140,column 5,is_stmt,isa 0
     248 0000001c 5603          MOV       ACC,AL << #14         ; [CPU_ALU] |140| 
         0000001d 0EA9 
     249 0000001e 9B3D          MOVB      AH,#61                ; [CPU_ALU] |140| 
     250 0000001f CAA6          OR        AL,AR6                ; [CPU_ALU] |140| 
     251 00000020 1AA9          OR        AL,#0x1000            ; [CPU_ALU] |140| 
         00000021 1000 
     252              $C$DW$23        .dwtag  DW_TAG_TI_branch
     253                      .dwattr $C$DW$23, DW_AT_low_pc(0x00)
     254                      .dwattr $C$DW$23, DW_AT_name("_SPI_Driver")
     255                      .dwattr $C$DW$23, DW_AT_TI_call
     256              
     257 00000022 7640'         LCR       #_SPI_Driver          ; [CPU_ALU] |140| 
         00000023 0000 
     258                      ; call occurs [#_SPI_Driver] ; [] |140| 
     259              $C$DW$24        .dwtag  DW_TAG_TI_branch
     260                      .dwattr $C$DW$24, DW_AT_low_pc(0x00)
     261                      .dwattr $C$DW$24, DW_AT_TI_return
     262              
     263 00000024 0006          LRETR     ; [CPU_ALU] 
     264                      ; return occurs ; [] 
     265                      .dwattr $C$DW$17, DW_AT_TI_end_file("../DRV830x_SPI.c")
     266                      .dwattr $C$DW$17, DW_AT_TI_end_line(0x8d)
     267                      .dwattr $C$DW$17, DW_AT_TI_end_column(0x01)
     268                      .dwendentry
     269                      .dwendtag $C$DW$17
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE    6

     270              
     271              ;**************************************************************
     272              ;* UNDEFINED EXTERNAL REFERENCES                              *
     273              ;**************************************************************
     274                      .global _GPIO_WritePin
     275                      .global _F28x_usDelay
     276              
     277              ;***************************************************************
     278              ;* TYPE INFORMATION                                            *
     279              ;***************************************************************
     280              
     281              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     282                      .dwattr $C$DW$T$20, DW_AT_name("SPIBRR_BITS")
     283                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     284              $C$DW$25        .dwtag  DW_TAG_member
     285                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     286                      .dwattr $C$DW$25, DW_AT_name("SPI_BIT_RATE")
     287                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_SPI_BIT_RATE")
     288                      .dwattr $C$DW$25, DW_AT_bit_offset(0x09)
     289                      .dwattr $C$DW$25, DW_AT_bit_size(0x07)
     290                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     291                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     292              
     293              $C$DW$26        .dwtag  DW_TAG_member
     294                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     295                      .dwattr $C$DW$26, DW_AT_name("rsvd1")
     296                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd1")
     297                      .dwattr $C$DW$26, DW_AT_bit_offset(0x00)
     298                      .dwattr $C$DW$26, DW_AT_bit_size(0x09)
     299                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     300                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     301              
     302                      .dwendtag $C$DW$T$20
     303              
     304              
     305              $C$DW$T$21      .dwtag  DW_TAG_union_type
     306                      .dwattr $C$DW$T$21, DW_AT_name("SPIBRR_REG")
     307                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     308              $C$DW$27        .dwtag  DW_TAG_member
     309                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     310                      .dwattr $C$DW$27, DW_AT_name("all")
     311                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_all")
     312                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     313                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     314              
     315              $C$DW$28        .dwtag  DW_TAG_member
     316                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$20)
     317                      .dwattr $C$DW$28, DW_AT_name("bit")
     318                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_bit")
     319                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     320                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     321              
     322                      .dwendtag $C$DW$T$21
     323              
     324              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE    7

     325              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     326                      .dwattr $C$DW$T$22, DW_AT_name("SPICCR_BITS")
     327                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     328              $C$DW$29        .dwtag  DW_TAG_member
     329                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     330                      .dwattr $C$DW$29, DW_AT_name("SPICHAR")
     331                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_SPICHAR")
     332                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0c)
     333                      .dwattr $C$DW$29, DW_AT_bit_size(0x04)
     334                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     335                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     336              
     337              $C$DW$30        .dwtag  DW_TAG_member
     338                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     339                      .dwattr $C$DW$30, DW_AT_name("SPILBK")
     340                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_SPILBK")
     341                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0b)
     342                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     343                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     344                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     345              
     346              $C$DW$31        .dwtag  DW_TAG_member
     347                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     348                      .dwattr $C$DW$31, DW_AT_name("HS_MODE")
     349                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_HS_MODE")
     350                      .dwattr $C$DW$31, DW_AT_bit_offset(0x0a)
     351                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     352                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     353                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     354              
     355              $C$DW$32        .dwtag  DW_TAG_member
     356                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     357                      .dwattr $C$DW$32, DW_AT_name("CLKPOLARITY")
     358                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_CLKPOLARITY")
     359                      .dwattr $C$DW$32, DW_AT_bit_offset(0x09)
     360                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     361                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     362                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     363              
     364              $C$DW$33        .dwtag  DW_TAG_member
     365                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     366                      .dwattr $C$DW$33, DW_AT_name("SPISWRESET")
     367                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_SPISWRESET")
     368                      .dwattr $C$DW$33, DW_AT_bit_offset(0x08)
     369                      .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     370                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     371                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     372              
     373              $C$DW$34        .dwtag  DW_TAG_member
     374                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     375                      .dwattr $C$DW$34, DW_AT_name("rsvd1")
     376                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_rsvd1")
     377                      .dwattr $C$DW$34, DW_AT_bit_offset(0x00)
     378                      .dwattr $C$DW$34, DW_AT_bit_size(0x08)
     379                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE    8

     380                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     381              
     382                      .dwendtag $C$DW$T$22
     383              
     384              
     385              $C$DW$T$23      .dwtag  DW_TAG_union_type
     386                      .dwattr $C$DW$T$23, DW_AT_name("SPICCR_REG")
     387                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     388              $C$DW$35        .dwtag  DW_TAG_member
     389                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     390                      .dwattr $C$DW$35, DW_AT_name("all")
     391                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_all")
     392                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     393                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     394              
     395              $C$DW$36        .dwtag  DW_TAG_member
     396                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$22)
     397                      .dwattr $C$DW$36, DW_AT_name("bit")
     398                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_bit")
     399                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     400                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     401              
     402                      .dwendtag $C$DW$T$23
     403              
     404              
     405              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     406                      .dwattr $C$DW$T$24, DW_AT_name("SPICTL_BITS")
     407                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     408              $C$DW$37        .dwtag  DW_TAG_member
     409                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     410                      .dwattr $C$DW$37, DW_AT_name("SPIINTENA")
     411                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_SPIINTENA")
     412                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0f)
     413                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     414                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     415                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     416              
     417              $C$DW$38        .dwtag  DW_TAG_member
     418                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     419                      .dwattr $C$DW$38, DW_AT_name("TALK")
     420                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_TALK")
     421                      .dwattr $C$DW$38, DW_AT_bit_offset(0x0e)
     422                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     423                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     424                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     425              
     426              $C$DW$39        .dwtag  DW_TAG_member
     427                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     428                      .dwattr $C$DW$39, DW_AT_name("MASTER_SLAVE")
     429                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_MASTER_SLAVE")
     430                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0d)
     431                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     432                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     433                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     434              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE    9

     435              $C$DW$40        .dwtag  DW_TAG_member
     436                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     437                      .dwattr $C$DW$40, DW_AT_name("CLK_PHASE")
     438                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_CLK_PHASE")
     439                      .dwattr $C$DW$40, DW_AT_bit_offset(0x0c)
     440                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     441                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     442                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     443              
     444              $C$DW$41        .dwtag  DW_TAG_member
     445                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     446                      .dwattr $C$DW$41, DW_AT_name("OVERRUNINTENA")
     447                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_OVERRUNINTENA")
     448                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0b)
     449                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     450                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     451                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     452              
     453              $C$DW$42        .dwtag  DW_TAG_member
     454                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     455                      .dwattr $C$DW$42, DW_AT_name("rsvd1")
     456                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_rsvd1")
     457                      .dwattr $C$DW$42, DW_AT_bit_offset(0x00)
     458                      .dwattr $C$DW$42, DW_AT_bit_size(0x0b)
     459                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     460                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     461              
     462                      .dwendtag $C$DW$T$24
     463              
     464              
     465              $C$DW$T$25      .dwtag  DW_TAG_union_type
     466                      .dwattr $C$DW$T$25, DW_AT_name("SPICTL_REG")
     467                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     468              $C$DW$43        .dwtag  DW_TAG_member
     469                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     470                      .dwattr $C$DW$43, DW_AT_name("all")
     471                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_all")
     472                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     473                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     474              
     475              $C$DW$44        .dwtag  DW_TAG_member
     476                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$24)
     477                      .dwattr $C$DW$44, DW_AT_name("bit")
     478                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_bit")
     479                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     480                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     481              
     482                      .dwendtag $C$DW$T$25
     483              
     484              
     485              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     486                      .dwattr $C$DW$T$26, DW_AT_name("SPIFFCT_BITS")
     487                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     488              $C$DW$45        .dwtag  DW_TAG_member
     489                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   10

     490                      .dwattr $C$DW$45, DW_AT_name("TXDLY")
     491                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_TXDLY")
     492                      .dwattr $C$DW$45, DW_AT_bit_offset(0x08)
     493                      .dwattr $C$DW$45, DW_AT_bit_size(0x08)
     494                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     495                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     496              
     497              $C$DW$46        .dwtag  DW_TAG_member
     498                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     499                      .dwattr $C$DW$46, DW_AT_name("rsvd1")
     500                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_rsvd1")
     501                      .dwattr $C$DW$46, DW_AT_bit_offset(0x00)
     502                      .dwattr $C$DW$46, DW_AT_bit_size(0x08)
     503                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     504                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     505              
     506                      .dwendtag $C$DW$T$26
     507              
     508              
     509              $C$DW$T$27      .dwtag  DW_TAG_union_type
     510                      .dwattr $C$DW$T$27, DW_AT_name("SPIFFCT_REG")
     511                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     512              $C$DW$47        .dwtag  DW_TAG_member
     513                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     514                      .dwattr $C$DW$47, DW_AT_name("all")
     515                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_all")
     516                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     517                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     518              
     519              $C$DW$48        .dwtag  DW_TAG_member
     520                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$26)
     521                      .dwattr $C$DW$48, DW_AT_name("bit")
     522                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_bit")
     523                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     524                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     525              
     526                      .dwendtag $C$DW$T$27
     527              
     528              
     529              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     530                      .dwattr $C$DW$T$28, DW_AT_name("SPIFFRX_BITS")
     531                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     532              $C$DW$49        .dwtag  DW_TAG_member
     533                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     534                      .dwattr $C$DW$49, DW_AT_name("RXFFIL")
     535                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_RXFFIL")
     536                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0b)
     537                      .dwattr $C$DW$49, DW_AT_bit_size(0x05)
     538                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     539                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     540              
     541              $C$DW$50        .dwtag  DW_TAG_member
     542                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     543                      .dwattr $C$DW$50, DW_AT_name("RXFFIENA")
     544                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_RXFFIENA")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   11

     545                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0a)
     546                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     547                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     548                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     549              
     550              $C$DW$51        .dwtag  DW_TAG_member
     551                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     552                      .dwattr $C$DW$51, DW_AT_name("RXFFINTCLR")
     553                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_RXFFINTCLR")
     554                      .dwattr $C$DW$51, DW_AT_bit_offset(0x09)
     555                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     556                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     557                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     558              
     559              $C$DW$52        .dwtag  DW_TAG_member
     560                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     561                      .dwattr $C$DW$52, DW_AT_name("RXFFINT")
     562                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_RXFFINT")
     563                      .dwattr $C$DW$52, DW_AT_bit_offset(0x08)
     564                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     565                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     566                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     567              
     568              $C$DW$53        .dwtag  DW_TAG_member
     569                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     570                      .dwattr $C$DW$53, DW_AT_name("RXFFST")
     571                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_RXFFST")
     572                      .dwattr $C$DW$53, DW_AT_bit_offset(0x03)
     573                      .dwattr $C$DW$53, DW_AT_bit_size(0x05)
     574                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     575                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     576              
     577              $C$DW$54        .dwtag  DW_TAG_member
     578                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     579                      .dwattr $C$DW$54, DW_AT_name("RXFIFORESET")
     580                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_RXFIFORESET")
     581                      .dwattr $C$DW$54, DW_AT_bit_offset(0x02)
     582                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     583                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     584                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     585              
     586              $C$DW$55        .dwtag  DW_TAG_member
     587                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     588                      .dwattr $C$DW$55, DW_AT_name("RXFFOVFCLR")
     589                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_RXFFOVFCLR")
     590                      .dwattr $C$DW$55, DW_AT_bit_offset(0x01)
     591                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     592                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     593                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     594              
     595              $C$DW$56        .dwtag  DW_TAG_member
     596                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     597                      .dwattr $C$DW$56, DW_AT_name("RXFFOVF")
     598                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_RXFFOVF")
     599                      .dwattr $C$DW$56, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   12

     600                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     601                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     602                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     603              
     604                      .dwendtag $C$DW$T$28
     605              
     606              
     607              $C$DW$T$29      .dwtag  DW_TAG_union_type
     608                      .dwattr $C$DW$T$29, DW_AT_name("SPIFFRX_REG")
     609                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     610              $C$DW$57        .dwtag  DW_TAG_member
     611                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     612                      .dwattr $C$DW$57, DW_AT_name("all")
     613                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_all")
     614                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     615                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     616              
     617              $C$DW$58        .dwtag  DW_TAG_member
     618                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$28)
     619                      .dwattr $C$DW$58, DW_AT_name("bit")
     620                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_bit")
     621                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     622                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     623              
     624                      .dwendtag $C$DW$T$29
     625              
     626              
     627              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     628                      .dwattr $C$DW$T$30, DW_AT_name("SPIFFTX_BITS")
     629                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     630              $C$DW$59        .dwtag  DW_TAG_member
     631                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     632                      .dwattr $C$DW$59, DW_AT_name("TXFFIL")
     633                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_TXFFIL")
     634                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0b)
     635                      .dwattr $C$DW$59, DW_AT_bit_size(0x05)
     636                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     637                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     638              
     639              $C$DW$60        .dwtag  DW_TAG_member
     640                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     641                      .dwattr $C$DW$60, DW_AT_name("TXFFIENA")
     642                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_TXFFIENA")
     643                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0a)
     644                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     645                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     646                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     647              
     648              $C$DW$61        .dwtag  DW_TAG_member
     649                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     650                      .dwattr $C$DW$61, DW_AT_name("TXFFINTCLR")
     651                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_TXFFINTCLR")
     652                      .dwattr $C$DW$61, DW_AT_bit_offset(0x09)
     653                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     654                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   13

     655                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     656              
     657              $C$DW$62        .dwtag  DW_TAG_member
     658                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     659                      .dwattr $C$DW$62, DW_AT_name("TXFFINT")
     660                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_TXFFINT")
     661                      .dwattr $C$DW$62, DW_AT_bit_offset(0x08)
     662                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     663                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     664                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     665              
     666              $C$DW$63        .dwtag  DW_TAG_member
     667                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     668                      .dwattr $C$DW$63, DW_AT_name("TXFFST")
     669                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_TXFFST")
     670                      .dwattr $C$DW$63, DW_AT_bit_offset(0x03)
     671                      .dwattr $C$DW$63, DW_AT_bit_size(0x05)
     672                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     673                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     674              
     675              $C$DW$64        .dwtag  DW_TAG_member
     676                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     677                      .dwattr $C$DW$64, DW_AT_name("TXFIFO")
     678                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_TXFIFO")
     679                      .dwattr $C$DW$64, DW_AT_bit_offset(0x02)
     680                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     681                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     682                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     683              
     684              $C$DW$65        .dwtag  DW_TAG_member
     685                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     686                      .dwattr $C$DW$65, DW_AT_name("SPIFFENA")
     687                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_SPIFFENA")
     688                      .dwattr $C$DW$65, DW_AT_bit_offset(0x01)
     689                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     690                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     691                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     692              
     693              $C$DW$66        .dwtag  DW_TAG_member
     694                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     695                      .dwattr $C$DW$66, DW_AT_name("SPIRST")
     696                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_SPIRST")
     697                      .dwattr $C$DW$66, DW_AT_bit_offset(0x00)
     698                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     699                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     700                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     701              
     702                      .dwendtag $C$DW$T$30
     703              
     704              
     705              $C$DW$T$31      .dwtag  DW_TAG_union_type
     706                      .dwattr $C$DW$T$31, DW_AT_name("SPIFFTX_REG")
     707                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     708              $C$DW$67        .dwtag  DW_TAG_member
     709                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   14

     710                      .dwattr $C$DW$67, DW_AT_name("all")
     711                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_all")
     712                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     713                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     714              
     715              $C$DW$68        .dwtag  DW_TAG_member
     716                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$30)
     717                      .dwattr $C$DW$68, DW_AT_name("bit")
     718                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_bit")
     719                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     720                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     721              
     722                      .dwendtag $C$DW$T$31
     723              
     724              
     725              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     726                      .dwattr $C$DW$T$32, DW_AT_name("SPIPRI_BITS")
     727                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     728              $C$DW$69        .dwtag  DW_TAG_member
     729                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     730                      .dwattr $C$DW$69, DW_AT_name("TRIWIRE")
     731                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_TRIWIRE")
     732                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0f)
     733                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     734                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     735                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     736              
     737              $C$DW$70        .dwtag  DW_TAG_member
     738                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     739                      .dwattr $C$DW$70, DW_AT_name("STEINV")
     740                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_STEINV")
     741                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0e)
     742                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     743                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     744                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     745              
     746              $C$DW$71        .dwtag  DW_TAG_member
     747                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     748                      .dwattr $C$DW$71, DW_AT_name("rsvd1")
     749                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_rsvd1")
     750                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0c)
     751                      .dwattr $C$DW$71, DW_AT_bit_size(0x02)
     752                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     753                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     754              
     755              $C$DW$72        .dwtag  DW_TAG_member
     756                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     757                      .dwattr $C$DW$72, DW_AT_name("FREE")
     758                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_FREE")
     759                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0b)
     760                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
     761                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     762                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     763              
     764              $C$DW$73        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   15

     765                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     766                      .dwattr $C$DW$73, DW_AT_name("SOFT")
     767                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_SOFT")
     768                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0a)
     769                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
     770                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     771                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     772              
     773              $C$DW$74        .dwtag  DW_TAG_member
     774                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     775                      .dwattr $C$DW$74, DW_AT_name("rsvd2")
     776                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_rsvd2")
     777                      .dwattr $C$DW$74, DW_AT_bit_offset(0x09)
     778                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     779                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     780                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     781              
     782              $C$DW$75        .dwtag  DW_TAG_member
     783                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     784                      .dwattr $C$DW$75, DW_AT_name("rsvd3")
     785                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd3")
     786                      .dwattr $C$DW$75, DW_AT_bit_offset(0x00)
     787                      .dwattr $C$DW$75, DW_AT_bit_size(0x09)
     788                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     789                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     790              
     791                      .dwendtag $C$DW$T$32
     792              
     793              
     794              $C$DW$T$33      .dwtag  DW_TAG_union_type
     795                      .dwattr $C$DW$T$33, DW_AT_name("SPIPRI_REG")
     796                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     797              $C$DW$76        .dwtag  DW_TAG_member
     798                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     799                      .dwattr $C$DW$76, DW_AT_name("all")
     800                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_all")
     801                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     803              
     804              $C$DW$77        .dwtag  DW_TAG_member
     805                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$32)
     806                      .dwattr $C$DW$77, DW_AT_name("bit")
     807                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_bit")
     808                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     809                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     810              
     811                      .dwendtag $C$DW$T$33
     812              
     813              
     814              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     815                      .dwattr $C$DW$T$34, DW_AT_name("SPISTS_BITS")
     816                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     817              $C$DW$78        .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     819                      .dwattr $C$DW$78, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   16

     820                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_rsvd1")
     821                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0b)
     822                      .dwattr $C$DW$78, DW_AT_bit_size(0x05)
     823                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     824                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     825              
     826              $C$DW$79        .dwtag  DW_TAG_member
     827                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     828                      .dwattr $C$DW$79, DW_AT_name("BUFFULL_FLAG")
     829                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_BUFFULL_FLAG")
     830                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0a)
     831                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
     832                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     833                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     834              
     835              $C$DW$80        .dwtag  DW_TAG_member
     836                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     837                      .dwattr $C$DW$80, DW_AT_name("INT_FLAG")
     838                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_INT_FLAG")
     839                      .dwattr $C$DW$80, DW_AT_bit_offset(0x09)
     840                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
     841                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     842                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     843              
     844              $C$DW$81        .dwtag  DW_TAG_member
     845                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     846                      .dwattr $C$DW$81, DW_AT_name("OVERRUN_FLAG")
     847                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_OVERRUN_FLAG")
     848                      .dwattr $C$DW$81, DW_AT_bit_offset(0x08)
     849                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
     850                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     851                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     852              
     853              $C$DW$82        .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     855                      .dwattr $C$DW$82, DW_AT_name("rsvd2")
     856                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd2")
     857                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
     858                      .dwattr $C$DW$82, DW_AT_bit_size(0x08)
     859                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     860                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     861              
     862                      .dwendtag $C$DW$T$34
     863              
     864              
     865              $C$DW$T$35      .dwtag  DW_TAG_union_type
     866                      .dwattr $C$DW$T$35, DW_AT_name("SPISTS_REG")
     867                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
     868              $C$DW$83        .dwtag  DW_TAG_member
     869                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     870                      .dwattr $C$DW$83, DW_AT_name("all")
     871                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_all")
     872                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     873                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     874              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   17

     875              $C$DW$84        .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$34)
     877                      .dwattr $C$DW$84, DW_AT_name("bit")
     878                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_bit")
     879                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     880                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     881              
     882                      .dwendtag $C$DW$T$35
     883              
     884              
     885              $C$DW$T$37      .dwtag  DW_TAG_structure_type
     886                      .dwattr $C$DW$T$37, DW_AT_name("SPI_REGS")
     887                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
     888              $C$DW$85        .dwtag  DW_TAG_member
     889                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$23)
     890                      .dwattr $C$DW$85, DW_AT_name("SPICCR")
     891                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_SPICCR")
     892                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     893                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     894              
     895              $C$DW$86        .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$25)
     897                      .dwattr $C$DW$86, DW_AT_name("SPICTL")
     898                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_SPICTL")
     899                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     900                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     901              
     902              $C$DW$87        .dwtag  DW_TAG_member
     903                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$35)
     904                      .dwattr $C$DW$87, DW_AT_name("SPISTS")
     905                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_SPISTS")
     906                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     907                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     908              
     909              $C$DW$88        .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     911                      .dwattr $C$DW$88, DW_AT_name("rsvd1")
     912                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd1")
     913                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     914                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     915              
     916              $C$DW$89        .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$21)
     918                      .dwattr $C$DW$89, DW_AT_name("SPIBRR")
     919                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_SPIBRR")
     920                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     921                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     922              
     923              $C$DW$90        .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     925                      .dwattr $C$DW$90, DW_AT_name("rsvd2")
     926                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_rsvd2")
     927                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     928                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     929              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   18

     930              $C$DW$91        .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     932                      .dwattr $C$DW$91, DW_AT_name("SPIRXEMU")
     933                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_SPIRXEMU")
     934                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     935                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     936              
     937              $C$DW$92        .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     939                      .dwattr $C$DW$92, DW_AT_name("SPIRXBUF")
     940                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_SPIRXBUF")
     941                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     942                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     943              
     944              $C$DW$93        .dwtag  DW_TAG_member
     945                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     946                      .dwattr $C$DW$93, DW_AT_name("SPITXBUF")
     947                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_SPITXBUF")
     948                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     949                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     950              
     951              $C$DW$94        .dwtag  DW_TAG_member
     952                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     953                      .dwattr $C$DW$94, DW_AT_name("SPIDAT")
     954                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_SPIDAT")
     955                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     956                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     957              
     958              $C$DW$95        .dwtag  DW_TAG_member
     959                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$31)
     960                      .dwattr $C$DW$95, DW_AT_name("SPIFFTX")
     961                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_SPIFFTX")
     962                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     963                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     964              
     965              $C$DW$96        .dwtag  DW_TAG_member
     966                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$29)
     967                      .dwattr $C$DW$96, DW_AT_name("SPIFFRX")
     968                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_SPIFFRX")
     969                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     970                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     971              
     972              $C$DW$97        .dwtag  DW_TAG_member
     973                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$27)
     974                      .dwattr $C$DW$97, DW_AT_name("SPIFFCT")
     975                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_SPIFFCT")
     976                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     977                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     978              
     979              $C$DW$98        .dwtag  DW_TAG_member
     980                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$36)
     981                      .dwattr $C$DW$98, DW_AT_name("rsvd3")
     982                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd3")
     983                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     984                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   19

     985              
     986              $C$DW$99        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$33)
     988                      .dwattr $C$DW$99, DW_AT_name("SPIPRI")
     989                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_SPIPRI")
     990                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     991                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     992              
     993                      .dwendtag $C$DW$T$37
     994              
     995              $C$DW$100       .dwtag  DW_TAG_TI_far_type
     996                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$37)
     997              
     998              $C$DW$T$38      .dwtag  DW_TAG_volatile_type
     999                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$100)
    1000              
    1001              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    1002                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1003                      .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    1004              
    1005              $C$DW$101       .dwtag  DW_TAG_TI_far_type
    1006                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$39)
    1007              
    1008              $C$DW$T$40      .dwtag  DW_TAG_const_type
    1009                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$101)
    1010              
    1011              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1012                      .dwattr $C$DW$T$2, DW_AT_name("void")
    1013              
    1014              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1015                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1016                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1017                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1018              
    1019              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1020                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1021                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1022                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1023              
    1024              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1025                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1026                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1027                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1028              
    1029              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1030                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1031                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1032                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1033              
    1034              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1035                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1036                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1037                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1038              
    1039              $C$DW$T$9       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   20

    1040                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1041                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1042                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1043              
    1044              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1045                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1046                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1047                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1048              
    1049              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1050                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1051                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
