TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Fri Jul 31 12:09:43 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drv8305.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Chiaming\CCSworkspace_V10\MonoMtrServo_377s\F2837x_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DRV8305_SPI_Write")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DRV8305_SPI_Write")

     628                      .dwpsn  file "../drv8305.c",line 157,column 2,is_stmt,isa 0
     629 00000108 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |157| 
     630                      .dwpsn  file "../drv8305.c",line 158,column 2,is_stmt,isa 0
     631 00000109 9A02          MOVB      AL,#2                 ; [CPU_ALU] |158| 
     632              $C$DW$40        .dwtag  DW_TAG_TI_branch
     633                      .dwattr $C$DW$40, DW_AT_low_pc(0x00)
     634                      .dwattr $C$DW$40, DW_AT_name("_DRV8305_SPI_Read")
     635                      .dwattr $C$DW$40, DW_AT_TI_call
     636              
     637 0000010a 7640!         LCR       #_DRV8305_SPI_Read    ; [CPU_ALU] |158| 
         0000010b 0000 
     638                      ; call occurs [#_DRV8305_SPI_Read] ; [] |158| 
     639 0000010c 8D00          MOVL      XAR0,#483             ; [CPU_ALU] |158| 
         0000010d 01E3 
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   14

     640 0000010e CCA9          AND       AL,AL,#0x07e7         ; [CPU_ALU] |158| 
         0000010f 07E7 
     641                      .dwpsn  file "../drv8305.c",line 159,column 2,is_stmt,isa 0
     642 00000110 8AA1          MOVL      XAR4,XAR1             ; [CPU_ALU] |159| 
     643                      .dwpsn  file "../drv8305.c",line 158,column 2,is_stmt,isa 0
     644 00000111 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |158| 
     645                      .dwpsn  file "../drv8305.c",line 159,column 2,is_stmt,isa 0
     646 00000112 9A03          MOVB      AL,#3                 ; [CPU_ALU] |159| 
     647              $C$DW$41        .dwtag  DW_TAG_TI_branch
     648                      .dwattr $C$DW$41, DW_AT_low_pc(0x00)
     649                      .dwattr $C$DW$41, DW_AT_name("_DRV8305_SPI_Read")
     650                      .dwattr $C$DW$41, DW_AT_TI_call
     651              
     652 00000113 7640!         LCR       #_DRV8305_SPI_Read    ; [CPU_ALU] |159| 
         00000114 0000 
     653                      ; call occurs [#_DRV8305_SPI_Read] ; [] |159| 
     654 00000115 8D00          MOVL      XAR0,#484             ; [CPU_ALU] |159| 
         00000116 01E4 
     655 00000117 CCA9          AND       AL,AL,#0x0777         ; [CPU_ALU] |159| 
         00000118 0777 
     656                      .dwpsn  file "../drv8305.c",line 160,column 2,is_stmt,isa 0
     657 00000119 8AA1          MOVL      XAR4,XAR1             ; [CPU_ALU] |160| 
     658                      .dwpsn  file "../drv8305.c",line 159,column 2,is_stmt,isa 0
     659 0000011a 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |159| 
     660                      .dwpsn  file "../drv8305.c",line 160,column 2,is_stmt,isa 0
     661 0000011b 9A04          MOVB      AL,#4                 ; [CPU_ALU] |160| 
     662              $C$DW$42        .dwtag  DW_TAG_TI_branch
     663                      .dwattr $C$DW$42, DW_AT_low_pc(0x00)
     664                      .dwattr $C$DW$42, DW_AT_name("_DRV8305_SPI_Read")
     665                      .dwattr $C$DW$42, DW_AT_TI_call
     666              
     667 0000011c 7640!         LCR       #_DRV8305_SPI_Read    ; [CPU_ALU] |160| 
         0000011d 0000 
     668                      ; call occurs [#_DRV8305_SPI_Read] ; [] |160| 
     669 0000011e 8D00          MOVL      XAR0,#485             ; [CPU_ALU] |160| 
         0000011f 01E5 
     670 00000120 CCA9          AND       AL,AL,#0x07e0         ; [CPU_ALU] |160| 
         00000121 07E0 
     671 00000122 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |160| 
     672 00000123 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     673                      .dwcfi  cfa_offset, -2
     674                      .dwcfi  restore_reg, 7
     675              $C$DW$43        .dwtag  DW_TAG_TI_branch
     676                      .dwattr $C$DW$43, DW_AT_low_pc(0x00)
     677                      .dwattr $C$DW$43, DW_AT_TI_return
     678              
     679 00000124 0006          LRETR     ; [CPU_ALU] 
     680                      ; return occurs ; [] 
     681                      .dwattr $C$DW$36, DW_AT_TI_end_file("../drv8305.c")
     682                      .dwattr $C$DW$36, DW_AT_TI_end_line(0xb7)
     683                      .dwattr $C$DW$36, DW_AT_TI_end_column(0x01)
     684                      .dwendentry
     685                      .dwendtag $C$DW$36
     686              
     687              ;**************************************************************
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   15

     688              ;* UNDEFINED EXTERNAL REFERENCES                              *
     689              ;**************************************************************
     690                      .global _DRV8305_SPI_Write
     691                      .global _DRV8305_SPI_Read
     692              
     693              ;***************************************************************
     694              ;* TYPE INFORMATION                                            *
     695              ;***************************************************************
     696              
     697              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     698                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
     699              $C$DW$44        .dwtag  DW_TAG_member
     700                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     701                      .dwattr $C$DW$44, DW_AT_name("As")
     702                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_As")
     703                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     704                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     705              
     706              $C$DW$45        .dwtag  DW_TAG_member
     707                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     708                      .dwattr $C$DW$45, DW_AT_name("Bs")
     709                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_Bs")
     710                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     711                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     712              
     713              $C$DW$46        .dwtag  DW_TAG_member
     714                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     715                      .dwattr $C$DW$46, DW_AT_name("Cs")
     716                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_Cs")
     717                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     718                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     719              
     720              $C$DW$47        .dwtag  DW_TAG_member
     721                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     722                      .dwattr $C$DW$47, DW_AT_name("Alpha")
     723                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_Alpha")
     724                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     725                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     726              
     727              $C$DW$48        .dwtag  DW_TAG_member
     728                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     729                      .dwattr $C$DW$48, DW_AT_name("Beta")
     730                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_Beta")
     731                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     732                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     733              
     734                      .dwendtag $C$DW$T$20
     735              
     736              $C$DW$T$65      .dwtag  DW_TAG_typedef
     737                      .dwattr $C$DW$T$65, DW_AT_name("CLARKE")
     738                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$20)
     739                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     740              
     741              
     742              $C$DW$T$21      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   16

     743                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
     744              $C$DW$49        .dwtag  DW_TAG_member
     745                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     746                      .dwattr $C$DW$49, DW_AT_name("Alpha")
     747                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_Alpha")
     748                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     749                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     750              
     751              $C$DW$50        .dwtag  DW_TAG_member
     752                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     753                      .dwattr $C$DW$50, DW_AT_name("Beta")
     754                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_Beta")
     755                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     756                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     757              
     758              $C$DW$51        .dwtag  DW_TAG_member
     759                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     760                      .dwattr $C$DW$51, DW_AT_name("Angle")
     761                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_Angle")
     762                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     763                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     764              
     765              $C$DW$52        .dwtag  DW_TAG_member
     766                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     767                      .dwattr $C$DW$52, DW_AT_name("Ds")
     768                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_Ds")
     769                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     770                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     771              
     772              $C$DW$53        .dwtag  DW_TAG_member
     773                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     774                      .dwattr $C$DW$53, DW_AT_name("Qs")
     775                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_Qs")
     776                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     777                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     778              
     779              $C$DW$54        .dwtag  DW_TAG_member
     780                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     781                      .dwattr $C$DW$54, DW_AT_name("Sine")
     782                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_Sine")
     783                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     784                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     785              
     786              $C$DW$55        .dwtag  DW_TAG_member
     787                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     788                      .dwattr $C$DW$55, DW_AT_name("Cosine")
     789                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_Cosine")
     790                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     791                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     792              
     793                      .dwendtag $C$DW$T$21
     794              
     795              $C$DW$T$66      .dwtag  DW_TAG_typedef
     796                      .dwattr $C$DW$T$66, DW_AT_name("PARK")
     797                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   17

     798                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
     799              
     800              
     801              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     802                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
     803              $C$DW$56        .dwtag  DW_TAG_member
     804                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     805                      .dwattr $C$DW$56, DW_AT_name("Alpha")
     806                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_Alpha")
     807                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     808                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     809              
     810              $C$DW$57        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     812                      .dwattr $C$DW$57, DW_AT_name("Beta")
     813                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_Beta")
     814                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     815                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     816              
     817              $C$DW$58        .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     819                      .dwattr $C$DW$58, DW_AT_name("Angle")
     820                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_Angle")
     821                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     822                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     823              
     824              $C$DW$59        .dwtag  DW_TAG_member
     825                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     826                      .dwattr $C$DW$59, DW_AT_name("Ds")
     827                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_Ds")
     828                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     829                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     830              
     831              $C$DW$60        .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     833                      .dwattr $C$DW$60, DW_AT_name("Qs")
     834                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_Qs")
     835                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     836                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     837              
     838              $C$DW$61        .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     840                      .dwattr $C$DW$61, DW_AT_name("Sine")
     841                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_Sine")
     842                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     843                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     844              
     845              $C$DW$62        .dwtag  DW_TAG_member
     846                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     847                      .dwattr $C$DW$62, DW_AT_name("Cosine")
     848                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_Cosine")
     849                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     850                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     851              
     852                      .dwendtag $C$DW$T$22
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   18

     853              
     854              $C$DW$T$67      .dwtag  DW_TAG_typedef
     855                      .dwattr $C$DW$T$67, DW_AT_name("IPARK")
     856                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
     857                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     858              
     859              
     860              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     861                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
     862              $C$DW$63        .dwtag  DW_TAG_member
     863                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     864                      .dwattr $C$DW$63, DW_AT_name("Vc_AB")
     865                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_Vc_AB")
     866                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     867                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     868              
     869              $C$DW$64        .dwtag  DW_TAG_member
     870                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     871                      .dwattr $C$DW$64, DW_AT_name("Vc_BC")
     872                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_Vc_BC")
     873                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     874                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     875              
     876              $C$DW$65        .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     878                      .dwattr $C$DW$65, DW_AT_name("Vc_A")
     879                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_Vc_A")
     880                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     881                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     882              
     883              $C$DW$66        .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     885                      .dwattr $C$DW$66, DW_AT_name("Vc_B")
     886                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_Vc_B")
     887                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     888                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     889              
     890                      .dwendtag $C$DW$T$23
     891              
     892              $C$DW$T$68      .dwtag  DW_TAG_typedef
     893                      .dwattr $C$DW$T$68, DW_AT_name("VCMEAS")
     894                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$23)
     895                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
     896              
     897              
     898              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     899                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
     900              $C$DW$67        .dwtag  DW_TAG_member
     901                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     902                      .dwattr $C$DW$67, DW_AT_name("Ref")
     903                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_Ref")
     904                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     905                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     906              
     907              $C$DW$68        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   19

     908                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     909                      .dwattr $C$DW$68, DW_AT_name("Fbk")
     910                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_Fbk")
     911                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     912                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     913              
     914              $C$DW$69        .dwtag  DW_TAG_member
     915                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     916                      .dwattr $C$DW$69, DW_AT_name("Out")
     917                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_Out")
     918                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     919                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     920              
     921              $C$DW$70        .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     923                      .dwattr $C$DW$70, DW_AT_name("c1")
     924                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_c1")
     925                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     926                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     927              
     928              $C$DW$71        .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     930                      .dwattr $C$DW$71, DW_AT_name("c2")
     931                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_c2")
     932                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     933                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     934              
     935              $C$DW$72        .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     937                      .dwattr $C$DW$72, DW_AT_name("Ref1")
     938                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_Ref1")
     939                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     940                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     941              
     942              $C$DW$73        .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     944                      .dwattr $C$DW$73, DW_AT_name("Fbk1")
     945                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_Fbk1")
     946                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     947                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     948              
     949              $C$DW$74        .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     951                      .dwattr $C$DW$74, DW_AT_name("We")
     952                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_We")
     953                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     954                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     955              
     956                      .dwendtag $C$DW$T$24
     957              
     958              $C$DW$T$27      .dwtag  DW_TAG_typedef
     959                      .dwattr $C$DW$T$27, DW_AT_name("PID_GRANDO_TERMINALS")
     960                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
     961                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     962              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   20

     963              
     964              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     965                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x14)
     966              $C$DW$75        .dwtag  DW_TAG_member
     967                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     968                      .dwattr $C$DW$75, DW_AT_name("Kr")
     969                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_Kr")
     970                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     971                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     972              
     973              $C$DW$76        .dwtag  DW_TAG_member
     974                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     975                      .dwattr $C$DW$76, DW_AT_name("Bw")
     976                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_Bw")
     977                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     978                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     979              
     980              $C$DW$77        .dwtag  DW_TAG_member
     981                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     982                      .dwattr $C$DW$77, DW_AT_name("Kp")
     983                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Kp")
     984                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     985                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     986              
     987              $C$DW$78        .dwtag  DW_TAG_member
     988                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     989                      .dwattr $C$DW$78, DW_AT_name("Ki")
     990                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_Ki")
     991                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     992                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     993              
     994              $C$DW$79        .dwtag  DW_TAG_member
     995                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     996                      .dwattr $C$DW$79, DW_AT_name("Kd")
     997                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_Kd")
     998                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     999                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1000              
    1001              $C$DW$80        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1003                      .dwattr $C$DW$80, DW_AT_name("Km")
    1004                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_Km")
    1005                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1006                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1007              
    1008              $C$DW$81        .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1010                      .dwattr $C$DW$81, DW_AT_name("Umax")
    1011                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_Umax")
    1012                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1013                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1014              
    1015              $C$DW$82        .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1017                      .dwattr $C$DW$82, DW_AT_name("Umin")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   21

    1018                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_Umin")
    1019                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1020                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1021              
    1022              $C$DW$83        .dwtag  DW_TAG_member
    1023                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1024                      .dwattr $C$DW$83, DW_AT_name("sig")
    1025                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_sig")
    1026                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1027                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1028              
    1029              $C$DW$84        .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1031                      .dwattr $C$DW$84, DW_AT_name("La")
    1032                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_La")
    1033                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1034                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1035              
    1036                      .dwendtag $C$DW$T$25
    1037              
    1038              $C$DW$T$28      .dwtag  DW_TAG_typedef
    1039                      .dwattr $C$DW$T$28, DW_AT_name("PID_GRANDO_PARAMETERS")
    1040                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
    1041                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1042              
    1043              
    1044              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1045                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x18)
    1046              $C$DW$85        .dwtag  DW_TAG_member
    1047                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1048                      .dwattr $C$DW$85, DW_AT_name("up")
    1049                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_up")
    1050                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1051                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1052              
    1053              $C$DW$86        .dwtag  DW_TAG_member
    1054                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1055                      .dwattr $C$DW$86, DW_AT_name("ui")
    1056                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_ui")
    1057                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1058                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1059              
    1060              $C$DW$87        .dwtag  DW_TAG_member
    1061                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1062                      .dwattr $C$DW$87, DW_AT_name("ud")
    1063                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_ud")
    1064                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1065                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1066              
    1067              $C$DW$88        .dwtag  DW_TAG_member
    1068                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1069                      .dwattr $C$DW$88, DW_AT_name("p1")
    1070                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_p1")
    1071                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1072                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   22

    1073              
    1074              $C$DW$89        .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1076                      .dwattr $C$DW$89, DW_AT_name("v1")
    1077                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_v1")
    1078                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1079                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1080              
    1081              $C$DW$90        .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1083                      .dwattr $C$DW$90, DW_AT_name("i1")
    1084                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_i1")
    1085                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1086                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1087              
    1088              $C$DW$91        .dwtag  DW_TAG_member
    1089                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1090                      .dwattr $C$DW$91, DW_AT_name("d1")
    1091                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_d1")
    1092                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1093                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1094              
    1095              $C$DW$92        .dwtag  DW_TAG_member
    1096                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1097                      .dwattr $C$DW$92, DW_AT_name("d2")
    1098                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_d2")
    1099                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1100                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1101              
    1102              $C$DW$93        .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1104                      .dwattr $C$DW$93, DW_AT_name("w1")
    1105                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_w1")
    1106                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1107                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1108              
    1109              $C$DW$94        .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1111                      .dwattr $C$DW$94, DW_AT_name("uc")
    1112                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_uc")
    1113                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1114                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1115              
    1116              $C$DW$95        .dwtag  DW_TAG_member
    1117                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1118                      .dwattr $C$DW$95, DW_AT_name("p2")
    1119                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_p2")
    1120                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1121                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1122              
    1123              $C$DW$96        .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1125                      .dwattr $C$DW$96, DW_AT_name("i2")
    1126                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_i2")
    1127                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   23

    1128                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1129              
    1130                      .dwendtag $C$DW$T$26
    1131              
    1132              $C$DW$T$29      .dwtag  DW_TAG_typedef
    1133                      .dwattr $C$DW$T$29, DW_AT_name("PID_GRANDO_DATA")
    1134                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    1135                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1136              
    1137              
    1138              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1139                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x3c)
    1140              $C$DW$97        .dwtag  DW_TAG_member
    1141                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$27)
    1142                      .dwattr $C$DW$97, DW_AT_name("term")
    1143                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_term")
    1144                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1145                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1146              
    1147              $C$DW$98        .dwtag  DW_TAG_member
    1148                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$28)
    1149                      .dwattr $C$DW$98, DW_AT_name("param")
    1150                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_param")
    1151                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1152                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1153              
    1154              $C$DW$99        .dwtag  DW_TAG_member
    1155                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$29)
    1156                      .dwattr $C$DW$99, DW_AT_name("data")
    1157                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_data")
    1158                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1159                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1160              
    1161                      .dwendtag $C$DW$T$30
    1162              
    1163              $C$DW$T$69      .dwtag  DW_TAG_typedef
    1164                      .dwattr $C$DW$T$69, DW_AT_name("PID_GRANDO_CONTROLLER")
    1165                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$30)
    1166                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1167              
    1168              
    1169              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1170                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x12)
    1171              $C$DW$100       .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1173                      .dwattr $C$DW$100, DW_AT_name("Ualpha")
    1174                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_Ualpha")
    1175                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1176                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1177              
    1178              $C$DW$101       .dwtag  DW_TAG_member
    1179                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1180                      .dwattr $C$DW$101, DW_AT_name("Ubeta")
    1181                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_Ubeta")
    1182                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   24

    1183                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1184              
    1185              $C$DW$102       .dwtag  DW_TAG_member
    1186                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1187                      .dwattr $C$DW$102, DW_AT_name("Ta")
    1188                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_Ta")
    1189                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1190                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1191              
    1192              $C$DW$103       .dwtag  DW_TAG_member
    1193                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1194                      .dwattr $C$DW$103, DW_AT_name("Tb")
    1195                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_Tb")
    1196                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1197                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1198              
    1199              $C$DW$104       .dwtag  DW_TAG_member
    1200                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1201                      .dwattr $C$DW$104, DW_AT_name("Tc")
    1202                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_Tc")
    1203                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1204                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1205              
    1206              $C$DW$105       .dwtag  DW_TAG_member
    1207                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1208                      .dwattr $C$DW$105, DW_AT_name("tmp1")
    1209                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_tmp1")
    1210                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1211                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1212              
    1213              $C$DW$106       .dwtag  DW_TAG_member
    1214                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1215                      .dwattr $C$DW$106, DW_AT_name("tmp2")
    1216                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_tmp2")
    1217                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1218                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1219              
    1220              $C$DW$107       .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1222                      .dwattr $C$DW$107, DW_AT_name("tmp3")
    1223                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_tmp3")
    1224                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1225                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1226              
    1227              $C$DW$108       .dwtag  DW_TAG_member
    1228                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$31)
    1229                      .dwattr $C$DW$108, DW_AT_name("VecSector")
    1230                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_VecSector")
    1231                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1232                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1233              
    1234                      .dwendtag $C$DW$T$32
    1235              
    1236              $C$DW$T$70      .dwtag  DW_TAG_typedef
    1237                      .dwattr $C$DW$T$70, DW_AT_name("SVGEN")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   25

    1238                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$32)
    1239                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1240              
    1241              
    1242              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1243                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x14)
    1244              $C$DW$109       .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1246                      .dwattr $C$DW$109, DW_AT_name("TargetValue")
    1247                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_TargetValue")
    1248                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1250              
    1251              $C$DW$110       .dwtag  DW_TAG_member
    1252                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$33)
    1253                      .dwattr $C$DW$110, DW_AT_name("RampDelayCount")
    1254                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_RampDelayCount")
    1255                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1256                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1257              
    1258              $C$DW$111       .dwtag  DW_TAG_member
    1259                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1260                      .dwattr $C$DW$111, DW_AT_name("Acceleration")
    1261                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_Acceleration")
    1262                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1263                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1264              
    1265              $C$DW$112       .dwtag  DW_TAG_member
    1266                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1267                      .dwattr $C$DW$112, DW_AT_name("T")
    1268                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_T")
    1269                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1270                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1271              
    1272              $C$DW$113       .dwtag  DW_TAG_member
    1273                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1274                      .dwattr $C$DW$113, DW_AT_name("Max_RPM")
    1275                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_Max_RPM")
    1276                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1277                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1278              
    1279              $C$DW$114       .dwtag  DW_TAG_member
    1280                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1281                      .dwattr $C$DW$114, DW_AT_name("SetpointRpm")
    1282                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_SetpointRpm")
    1283                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1284                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1285              
    1286              $C$DW$115       .dwtag  DW_TAG_member
    1287                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1288                      .dwattr $C$DW$115, DW_AT_name("SetpointValue")
    1289                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_SetpointValue")
    1290                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1291                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1292              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   26

    1293              $C$DW$116       .dwtag  DW_TAG_member
    1294                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$33)
    1295                      .dwattr $C$DW$116, DW_AT_name("EqualFlag")
    1296                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_EqualFlag")
    1297                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1298                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1299              
    1300              $C$DW$117       .dwtag  DW_TAG_member
    1301                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1302                      .dwattr $C$DW$117, DW_AT_name("rmp_tmp")
    1303                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rmp_tmp")
    1304                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1305                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1306              
    1307              $C$DW$118       .dwtag  DW_TAG_member
    1308                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1309                      .dwattr $C$DW$118, DW_AT_name("rc_err")
    1310                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rc_err")
    1311                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1312                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1313              
    1314                      .dwendtag $C$DW$T$34
    1315              
    1316              $C$DW$T$71      .dwtag  DW_TAG_typedef
    1317                      .dwattr $C$DW$T$71, DW_AT_name("RMPCELE")
    1318                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    1319                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1320              
    1321              
    1322              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1323                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    1324              $C$DW$119       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1326                      .dwattr $C$DW$119, DW_AT_name("Freq")
    1327                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_Freq")
    1328                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1329                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1330              
    1331              $C$DW$120       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1333                      .dwattr $C$DW$120, DW_AT_name("StepAngleMax")
    1334                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_StepAngleMax")
    1335                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1336                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1337              
    1338              $C$DW$121       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1340                      .dwattr $C$DW$121, DW_AT_name("Angle")
    1341                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_Angle")
    1342                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1343                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1344              
    1345              $C$DW$122       .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1347                      .dwattr $C$DW$122, DW_AT_name("Gain")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   27

    1348                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_Gain")
    1349                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1350                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1351              
    1352              $C$DW$123       .dwtag  DW_TAG_member
    1353                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1354                      .dwattr $C$DW$123, DW_AT_name("Out")
    1355                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_Out")
    1356                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1357                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1358              
    1359              $C$DW$124       .dwtag  DW_TAG_member
    1360                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1361                      .dwattr $C$DW$124, DW_AT_name("Offset")
    1362                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_Offset")
    1363                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1364                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1365              
    1366                      .dwendtag $C$DW$T$35
    1367              
    1368              $C$DW$T$72      .dwtag  DW_TAG_typedef
    1369                      .dwattr $C$DW$T$72, DW_AT_name("RAMPGEN")
    1370                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
    1371                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1372              
    1373              
    1374              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1375                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x16)
    1376              $C$DW$125       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1378                      .dwattr $C$DW$125, DW_AT_name("DcBusVolt")
    1379                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_DcBusVolt")
    1380                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1381                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1382              
    1383              $C$DW$126       .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1385                      .dwattr $C$DW$126, DW_AT_name("MfuncV1")
    1386                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_MfuncV1")
    1387                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1388                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1389              
    1390              $C$DW$127       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1392                      .dwattr $C$DW$127, DW_AT_name("MfuncV2")
    1393                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_MfuncV2")
    1394                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1395                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1396              
    1397              $C$DW$128       .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1399                      .dwattr $C$DW$128, DW_AT_name("MfuncV3")
    1400                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_MfuncV3")
    1401                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1402                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   28

    1403              
    1404              $C$DW$129       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$31)
    1406                      .dwattr $C$DW$129, DW_AT_name("OutOfPhase")
    1407                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_OutOfPhase")
    1408                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1409                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1410              
    1411              $C$DW$130       .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1413                      .dwattr $C$DW$130, DW_AT_name("VphaseA")
    1414                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_VphaseA")
    1415                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1416                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1417              
    1418              $C$DW$131       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1420                      .dwattr $C$DW$131, DW_AT_name("VphaseB")
    1421                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_VphaseB")
    1422                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1423                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1424              
    1425              $C$DW$132       .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1427                      .dwattr $C$DW$132, DW_AT_name("VphaseC")
    1428                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_VphaseC")
    1429                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1430                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1431              
    1432              $C$DW$133       .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1434                      .dwattr $C$DW$133, DW_AT_name("Valpha")
    1435                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_Valpha")
    1436                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1437                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1438              
    1439              $C$DW$134       .dwtag  DW_TAG_member
    1440                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1441                      .dwattr $C$DW$134, DW_AT_name("Vbeta")
    1442                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_Vbeta")
    1443                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1444                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1445              
    1446              $C$DW$135       .dwtag  DW_TAG_member
    1447                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1448                      .dwattr $C$DW$135, DW_AT_name("temp")
    1449                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_temp")
    1450                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1451                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1452              
    1453                      .dwendtag $C$DW$T$36
    1454              
    1455              $C$DW$T$73      .dwtag  DW_TAG_typedef
    1456                      .dwattr $C$DW$T$73, DW_AT_name("PHASEVOLTAGE")
    1457                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$36)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   29

    1458                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1459              
    1460              
    1461              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1462                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    1463              $C$DW$136       .dwtag  DW_TAG_member
    1464                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1465                      .dwattr $C$DW$136, DW_AT_name("ElecTheta")
    1466                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ElecTheta")
    1467                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1468                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1469              
    1470              $C$DW$137       .dwtag  DW_TAG_member
    1471                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$33)
    1472                      .dwattr $C$DW$137, DW_AT_name("DirectionQep")
    1473                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_DirectionQep")
    1474                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1475                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1476              
    1477              $C$DW$138       .dwtag  DW_TAG_member
    1478                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1479                      .dwattr $C$DW$138, DW_AT_name("OldElecTheta")
    1480                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_OldElecTheta")
    1481                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1482                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1483              
    1484              $C$DW$139       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$139, DW_AT_name("Speed")
    1487                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_Speed")
    1488                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1489                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1490              
    1491              $C$DW$140       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$33)
    1493                      .dwattr $C$DW$140, DW_AT_name("BaseRpm")
    1494                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_BaseRpm")
    1495                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1496                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1497              
    1498              $C$DW$141       .dwtag  DW_TAG_member
    1499                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$37)
    1500                      .dwattr $C$DW$141, DW_AT_name("K1")
    1501                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_K1")
    1502                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1503                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1504              
    1505              $C$DW$142       .dwtag  DW_TAG_member
    1506                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1507                      .dwattr $C$DW$142, DW_AT_name("K2")
    1508                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_K2")
    1509                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1510                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1511              
    1512              $C$DW$143       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   30

    1513                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1514                      .dwattr $C$DW$143, DW_AT_name("K3")
    1515                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_K3")
    1516                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1517                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1518              
    1519              $C$DW$144       .dwtag  DW_TAG_member
    1520                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$38)
    1521                      .dwattr $C$DW$144, DW_AT_name("SpeedRpm")
    1522                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_SpeedRpm")
    1523                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1524                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1525              
    1526              $C$DW$145       .dwtag  DW_TAG_member
    1527                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1528                      .dwattr $C$DW$145, DW_AT_name("Tmp")
    1529                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_Tmp")
    1530                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1531                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1532              
    1533                      .dwendtag $C$DW$T$39
    1534              
    1535              $C$DW$T$74      .dwtag  DW_TAG_typedef
    1536                      .dwattr $C$DW$T$74, DW_AT_name("SPEED_MEAS_QEP")
    1537                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$39)
    1538                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1539              
    1540              
    1541              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1542                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    1543              $C$DW$146       .dwtag  DW_TAG_member
    1544                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$40)
    1545                      .dwattr $C$DW$146, DW_AT_name("ElecTheta")
    1546                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_ElecTheta")
    1547                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1548                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1549              
    1550              $C$DW$147       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$40)
    1552                      .dwattr $C$DW$147, DW_AT_name("MechTheta")
    1553                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_MechTheta")
    1554                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1555                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1556              
    1557              $C$DW$148       .dwtag  DW_TAG_member
    1558                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$31)
    1559                      .dwattr $C$DW$148, DW_AT_name("DirectionQep")
    1560                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_DirectionQep")
    1561                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1562                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1563              
    1564              $C$DW$149       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$31)
    1566                      .dwattr $C$DW$149, DW_AT_name("QepPeriod")
    1567                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_QepPeriod")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   31

    1568                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1569                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1570              
    1571              $C$DW$150       .dwtag  DW_TAG_member
    1572                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$33)
    1573                      .dwattr $C$DW$150, DW_AT_name("QepCountIndex")
    1574                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_QepCountIndex")
    1575                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1576                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1577              
    1578              $C$DW$151       .dwtag  DW_TAG_member
    1579                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$38)
    1580                      .dwattr $C$DW$151, DW_AT_name("RawTheta")
    1581                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_RawTheta")
    1582                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1583                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1584              
    1585              $C$DW$152       .dwtag  DW_TAG_member
    1586                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$40)
    1587                      .dwattr $C$DW$152, DW_AT_name("MechScaler")
    1588                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_MechScaler")
    1589                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1590                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1591              
    1592              $C$DW$153       .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$31)
    1594                      .dwattr $C$DW$153, DW_AT_name("LineEncoder")
    1595                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_LineEncoder")
    1596                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1597                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1598              
    1599              $C$DW$154       .dwtag  DW_TAG_member
    1600                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$31)
    1601                      .dwattr $C$DW$154, DW_AT_name("PolePairs")
    1602                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_PolePairs")
    1603                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1604                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1605              
    1606              $C$DW$155       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$38)
    1608                      .dwattr $C$DW$155, DW_AT_name("CalibratedAngle")
    1609                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_CalibratedAngle")
    1610                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1611                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1612              
    1613              $C$DW$156       .dwtag  DW_TAG_member
    1614                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$31)
    1615                      .dwattr $C$DW$156, DW_AT_name("IndexSyncFlag")
    1616                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_IndexSyncFlag")
    1617                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1618                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1619              
    1620                      .dwendtag $C$DW$T$41
    1621              
    1622              $C$DW$T$75      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   32

    1623                      .dwattr $C$DW$T$75, DW_AT_name("QEP")
    1624                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    1625                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1626              
    1627              
    1628              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1629                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x07)
    1630              $C$DW$157       .dwtag  DW_TAG_member
    1631                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$42)
    1632                      .dwattr $C$DW$157, DW_AT_name("stat_reg1")
    1633                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_stat_reg1")
    1634                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1635                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1636              
    1637              $C$DW$158       .dwtag  DW_TAG_member
    1638                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$43)
    1639                      .dwattr $C$DW$158, DW_AT_name("stat_reg2")
    1640                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_stat_reg2")
    1641                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1642                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1643              
    1644              $C$DW$159       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$44)
    1646                      .dwattr $C$DW$159, DW_AT_name("cntrl_reg1")
    1647                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_cntrl_reg1")
    1648                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1649                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1650              
    1651              $C$DW$160       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$45)
    1653                      .dwattr $C$DW$160, DW_AT_name("cntrl_reg2")
    1654                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_cntrl_reg2")
    1655                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1656                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1657              
    1658              $C$DW$161       .dwtag  DW_TAG_member
    1659                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$31)
    1660                      .dwattr $C$DW$161, DW_AT_name("readCntrl1")
    1661                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_readCntrl1")
    1662                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1663                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1664              
    1665              $C$DW$162       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$31)
    1667                      .dwattr $C$DW$162, DW_AT_name("readCntrl2")
    1668                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_readCntrl2")
    1669                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1670                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1671              
    1672              $C$DW$163       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$31)
    1674                      .dwattr $C$DW$163, DW_AT_name("DRV_fault")
    1675                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_DRV_fault")
    1676                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1677                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   33

    1678              
    1679                      .dwendtag $C$DW$T$46
    1680              
    1681              $C$DW$T$76      .dwtag  DW_TAG_typedef
    1682                      .dwattr $C$DW$T$76, DW_AT_name("DRV8301_Vars")
    1683                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$46)
    1684                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1685              
    1686              
    1687              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    1688                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x15)
    1689              $C$DW$164       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$31)
    1691                      .dwattr $C$DW$164, DW_AT_name("Rsvd0")
    1692                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_Rsvd0")
    1693                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1694                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1695              
    1696              $C$DW$165       .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$47)
    1698                      .dwattr $C$DW$165, DW_AT_name("status1_wwd")
    1699                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_status1_wwd")
    1700                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1701                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1702              
    1703              $C$DW$166       .dwtag  DW_TAG_member
    1704                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$48)
    1705                      .dwattr $C$DW$166, DW_AT_name("status2_ov_vds")
    1706                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_status2_ov_vds")
    1707                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1708                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1709              
    1710              $C$DW$167       .dwtag  DW_TAG_member
    1711                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$49)
    1712                      .dwattr $C$DW$167, DW_AT_name("status3_IC")
    1713                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_status3_IC")
    1714                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1715                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1716              
    1717              $C$DW$168       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$50)
    1719                      .dwattr $C$DW$168, DW_AT_name("status4_gd_Vgs")
    1720                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    1721                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1722                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1723              
    1724              $C$DW$169       .dwtag  DW_TAG_member
    1725                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$51)
    1726                      .dwattr $C$DW$169, DW_AT_name("cntrl5_hs_gd")
    1727                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    1728                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1729                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1730              
    1731              $C$DW$170       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$52)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   34

    1733                      .dwattr $C$DW$170, DW_AT_name("cntrl6_ls_gd")
    1734                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    1735                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1736                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1737              
    1738              $C$DW$171       .dwtag  DW_TAG_member
    1739                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$53)
    1740                      .dwattr $C$DW$171, DW_AT_name("cntrl7_gd")
    1741                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_cntrl7_gd")
    1742                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1743                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1744              
    1745              $C$DW$172       .dwtag  DW_TAG_member
    1746                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$31)
    1747                      .dwattr $C$DW$172, DW_AT_name("Rsvd8")
    1748                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_Rsvd8")
    1749                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1750                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1751              
    1752              $C$DW$173       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$54)
    1754                      .dwattr $C$DW$173, DW_AT_name("cntrl9_IC_ops")
    1755                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    1756                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1757                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1758              
    1759              $C$DW$174       .dwtag  DW_TAG_member
    1760                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$55)
    1761                      .dwattr $C$DW$174, DW_AT_name("cntrlA_shunt_amp")
    1762                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    1763                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1764                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1765              
    1766              $C$DW$175       .dwtag  DW_TAG_member
    1767                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$56)
    1768                      .dwattr $C$DW$175, DW_AT_name("cntrlB_Vreg")
    1769                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    1770                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1771                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1772              
    1773              $C$DW$176       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$57)
    1775                      .dwattr $C$DW$176, DW_AT_name("cntrlC_Vds_SNS")
    1776                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
    1777                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1778                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1779              
    1780              $C$DW$177       .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$31)
    1782                      .dwattr $C$DW$177, DW_AT_name("readCntrl5")
    1783                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_readCntrl5")
    1784                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1785                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1786              
    1787              $C$DW$178       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   35

    1788                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$31)
    1789                      .dwattr $C$DW$178, DW_AT_name("readCntrl6")
    1790                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_readCntrl6")
    1791                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1792                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1793              
    1794              $C$DW$179       .dwtag  DW_TAG_member
    1795                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$31)
    1796                      .dwattr $C$DW$179, DW_AT_name("readCntrl7")
    1797                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_readCntrl7")
    1798                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1799                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1800              
    1801              $C$DW$180       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$31)
    1803                      .dwattr $C$DW$180, DW_AT_name("readCntrl9")
    1804                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_readCntrl9")
    1805                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1806                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1807              
    1808              $C$DW$181       .dwtag  DW_TAG_member
    1809                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$31)
    1810                      .dwattr $C$DW$181, DW_AT_name("readCntrlA")
    1811                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_readCntrlA")
    1812                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1813                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1814              
    1815              $C$DW$182       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$31)
    1817                      .dwattr $C$DW$182, DW_AT_name("readCntrlB")
    1818                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_readCntrlB")
    1819                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1820                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1821              
    1822              $C$DW$183       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$31)
    1824                      .dwattr $C$DW$183, DW_AT_name("readCntrlC")
    1825                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_readCntrlC")
    1826                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1827                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1828              
    1829              $C$DW$184       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$31)
    1831                      .dwattr $C$DW$184, DW_AT_name("DRV_fault")
    1832                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_DRV_fault")
    1833                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1834                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1835              
    1836                      .dwendtag $C$DW$T$58
    1837              
    1838              $C$DW$T$77      .dwtag  DW_TAG_typedef
    1839                      .dwattr $C$DW$T$77, DW_AT_name("DRV8305_Vars")
    1840                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$58)
    1841                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1842              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   36

    1843              
    1844              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    1845                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x1f6)
    1846              $C$DW$185       .dwtag  DW_TAG_member
    1847                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$60)
    1848                      .dwattr $C$DW$185, DW_AT_name("PwmARegs")
    1849                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_PwmARegs")
    1850                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1851                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1852              
    1853              $C$DW$186       .dwtag  DW_TAG_member
    1854                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$60)
    1855                      .dwattr $C$DW$186, DW_AT_name("PwmBRegs")
    1856                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_PwmBRegs")
    1857                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1858                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1859              
    1860              $C$DW$187       .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$60)
    1862                      .dwattr $C$DW$187, DW_AT_name("PwmCRegs")
    1863                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_PwmCRegs")
    1864                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1865                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1866              
    1867              $C$DW$188       .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$62)
    1869                      .dwattr $C$DW$188, DW_AT_name("QepRegs")
    1870                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_QepRegs")
    1871                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1872                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1873              
    1874              $C$DW$189       .dwtag  DW_TAG_member
    1875                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$64)
    1876                      .dwattr $C$DW$189, DW_AT_name("SpiRegs")
    1877                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_SpiRegs")
    1878                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1879                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1880              
    1881              $C$DW$190       .dwtag  DW_TAG_member
    1882                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$31)
    1883                      .dwattr $C$DW$190, DW_AT_name("drvScsPin")
    1884                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_drvScsPin")
    1885                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1886                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1887              
    1888              $C$DW$191       .dwtag  DW_TAG_member
    1889                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1890                      .dwattr $C$DW$191, DW_AT_name("offset_shntA")
    1891                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_offset_shntA")
    1892                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1893                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1894              
    1895              $C$DW$192       .dwtag  DW_TAG_member
    1896                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    1897                      .dwattr $C$DW$192, DW_AT_name("offset_shntB")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   37

    1898                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_offset_shntB")
    1899                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1900                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1901              
    1902              $C$DW$193       .dwtag  DW_TAG_member
    1903                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    1904                      .dwattr $C$DW$193, DW_AT_name("offset_As")
    1905                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_offset_As")
    1906                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1907                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1908              
    1909              $C$DW$194       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    1911                      .dwattr $C$DW$194, DW_AT_name("offset_Bs")
    1912                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_offset_Bs")
    1913                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1914                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1915              
    1916              $C$DW$195       .dwtag  DW_TAG_member
    1917                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    1918                      .dwattr $C$DW$195, DW_AT_name("offset_ABV")
    1919                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_offset_ABV")
    1920                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1921                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1922              
    1923              $C$DW$196       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    1925                      .dwattr $C$DW$196, DW_AT_name("offset_BCV")
    1926                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_offset_BCV")
    1927                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1928                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1929              
    1930              $C$DW$197       .dwtag  DW_TAG_member
    1931                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    1932                      .dwattr $C$DW$197, DW_AT_name("offset_IcA")
    1933                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_offset_IcA")
    1934                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1935                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1936              
    1937              $C$DW$198       .dwtag  DW_TAG_member
    1938                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    1939                      .dwattr $C$DW$198, DW_AT_name("offset_IcB")
    1940                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_offset_IcB")
    1941                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1942                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1943              
    1944              $C$DW$199       .dwtag  DW_TAG_member
    1945                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    1946                      .dwattr $C$DW$199, DW_AT_name("cal_offset_A")
    1947                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_cal_offset_A")
    1948                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1949                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1950              
    1951              $C$DW$200       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   38

    1953                      .dwattr $C$DW$200, DW_AT_name("cal_offset_B")
    1954                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_cal_offset_B")
    1955                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1956                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1957              
    1958              $C$DW$201       .dwtag  DW_TAG_member
    1959                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    1960                      .dwattr $C$DW$201, DW_AT_name("VdTesting")
    1961                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_VdTesting")
    1962                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1963                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1964              
    1965              $C$DW$202       .dwtag  DW_TAG_member
    1966                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    1967                      .dwattr $C$DW$202, DW_AT_name("VqTesting")
    1968                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_VqTesting")
