TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Fri Jul 31 12:09:42 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drv8301.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Chiaming\CCSworkspace_V10\MonoMtrServo_377s\F2837x_FLASH")
      13              ;       C:\ti\ccs1010\ccs\tools\compiler\ti-cgt-c2000_20.2.1.LTS\bin\opt2000.exe C:\\Users\\Chiaming\\AppData

     170                      .dwpsn  file "../drv8301.c",line 105,column 2,is_stmt,isa 0
     171 0000001a FF11          ADD       ACC,#237 << 1         ; [CPU_ALU] |105| 
         0000001b 00ED 
     172 0000001c 83A9          MOVL      XAR5,ACC              ; [CPU_ALU] |105| 
     173                      .dwpsn  file "../drv8301.c",line 106,column 2,is_stmt,isa 0
     174 0000001d A8A9          MOVL      ACC,XAR4              ; [CPU_ALU] |106| 
     175 0000001e FF11          ADD       ACC,#239 << 1         ; [CPU_ALU] |106| 
         0000001f 00EF 
     176 00000020 1EA6          MOVL      XAR6,ACC              ; [CPU_ALU] |106| 
     177 00000021       $C$L1:    
     178                      .dwpsn  file "../drv8301.c",line 112,column 3,is_stmt,isa 0
     179 00000021 9285          MOV       AL,*XAR5++            ; [CPU_ALU] |112| 
     180 00000022 6108          B         $C$L2,EQ              ; [CPU_ALU] |112| 
     181                      ; branchcc occurs ; [] |112| 
     182                      .dwpsn  file "../drv8301.c",line 113,column 4,is_stmt,isa 0
     183 00000023 A8A9          MOVL      ACC,XAR4              ; [CPU_ALU] |113| 
     184 00000024 FF15          ADD       ACC,#15 << 5          ; [CPU_ALU] |113| 
         00000025 000F 
     185 00000026 1EA7          MOVL      XAR7,ACC              ; [CPU_ALU] |113| 
     186 00000027 9A01          MOVB      AL,#1                 ; [CPU_ALU] |113| 
     187 00000028 FF66          LSL       AL,T                  ; [CPU_ALU] |113| 
     188 00000029 98C7          OR        *+XAR7[0],AL          ; [CPU_ALU] |113| 
     189 0000002a       $C$L2:    
     190 0000002a 92AC          MOV       AL,T                  ; [CPU_ALU] 
     191                      .dwpsn  file "../drv8301.c",line 110,column 27,is_stmt,isa 0
     192 0000002b 9C01          ADDB      AL,#1                 ; [CPU_ALU] |110| 
     193 0000002c 5201          CMPB      AL,#1                 ; [CPU_ALU] |110| 
     194 0000002d 2DA9          MOV       T,AL                  ; [CPU_FPU] |110| 
     195 0000002e 69F3          B         $C$L1,LOS             ; [CPU_ALU] |110| 
     196                      ; branchcc occurs ; [] |110| 
     197                      .dwpsn  file "../drv8301.c",line 117,column 9,is_stmt,isa 0
     198 0000002f 5203          CMPB      AL,#3                 ; [CPU_ALU] |117| 
     199 00000030 6612          B         $C$L5,HI              ; [CPU_ALU] |117| 
     200                      ; branchcc occurs ; [] |117| 
     201 00000031       $C$L3:    
     202                      .dwpsn  file "../drv8301.c",line 119,column 3,is_stmt,isa 0
     203 00000031 8085          MOVZ      AR7,*XAR5++           ; [CPU_ALU] |119| 
     204 00000032 9286          MOV       AL,*XAR6++            ; [CPU_ALU] |119| 
     205 00000033 0EA9          MOVU      ACC,AL                ; [CPU_ALU] |119| 
     206 00000034 0FA7          CMPL      ACC,XAR7              ; [CPU_ALU] |119| 
     207 00000035 6108          B         $C$L4,EQ              ; [CPU_ALU] |119| 
     208                      ; branchcc occurs ; [] |119| 
     209                      .dwpsn  file "../drv8301.c",line 120,column 4,is_stmt,isa 0
     210 00000036 A8A9          MOVL      ACC,XAR4              ; [CPU_ALU] |120| 
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE    5

     211 00000037 FF15          ADD       ACC,#15 << 5          ; [CPU_ALU] |120| 
         00000038 000F 
     212 00000039 1EA7          MOVL      XAR7,ACC              ; [CPU_ALU] |120| 
     213 0000003a 9A01          MOVB      AL,#1                 ; [CPU_ALU] |120| 
     214 0000003b FF66          LSL       AL,T                  ; [CPU_ALU] |120| 
     215 0000003c 98C7          OR        *+XAR7[0],AL          ; [CPU_ALU] |120| 
     216 0000003d       $C$L4:    
     217 0000003d 92AC          MOV       AL,T                  ; [CPU_ALU] 
     218                      .dwpsn  file "../drv8301.c",line 117,column 19,is_stmt,isa 0
     219 0000003e 9C01          ADDB      AL,#1                 ; [CPU_ALU] |117| 
     220 0000003f 5203          CMPB      AL,#3                 ; [CPU_ALU] |117| 
     221 00000040 2DA9          MOV       T,AL                  ; [CPU_FPU] |117| 
     222 00000041 69F0          B         $C$L3,LOS             ; [CPU_ALU] |117| 
     223                      ; branchcc occurs ; [] |117| 
     224              $C$L5:    
     225              $C$DW$11        .dwtag  DW_TAG_TI_branch
     226                      .dwattr $C$DW$11, DW_AT_low_pc(0x00)
     227                      .dwattr $C$DW$11, DW_AT_TI_return
     228              
     229 00000042 0006          LRETR     ; [CPU_ALU] 
     230                      ; return occurs ; [] 
     231                      .dwattr $C$DW$5, DW_AT_TI_end_file("../drv8301.c")
     232                      .dwattr $C$DW$5, DW_AT_TI_end_line(0x7c)
     233                      .dwattr $C$DW$5, DW_AT_TI_end_column(0x01)
     234                      .dwendentry
     235                      .dwendtag $C$DW$5
     236              
     237              
     238              ;***************************************************************
     239              ;* TYPE INFORMATION                                            *
     240              ;***************************************************************
     241              
     242              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     243                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
     244              $C$DW$12        .dwtag  DW_TAG_member
     245                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     246                      .dwattr $C$DW$12, DW_AT_name("As")
     247                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_As")
     248                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     249                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     250              
     251              $C$DW$13        .dwtag  DW_TAG_member
     252                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     253                      .dwattr $C$DW$13, DW_AT_name("Bs")
     254                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_Bs")
     255                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     256                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     257              
     258              $C$DW$14        .dwtag  DW_TAG_member
     259                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     260                      .dwattr $C$DW$14, DW_AT_name("Cs")
     261                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_Cs")
     262                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     263                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     264              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE    6

     265              $C$DW$15        .dwtag  DW_TAG_member
     266                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     267                      .dwattr $C$DW$15, DW_AT_name("Alpha")
     268                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_Alpha")
     269                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     270                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     271              
     272              $C$DW$16        .dwtag  DW_TAG_member
     273                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     274                      .dwattr $C$DW$16, DW_AT_name("Beta")
     275                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_Beta")
     276                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     277                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     278              
     279                      .dwendtag $C$DW$T$20
     280              
     281              $C$DW$T$65      .dwtag  DW_TAG_typedef
     282                      .dwattr $C$DW$T$65, DW_AT_name("CLARKE")
     283                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$20)
     284                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     285              
     286              
     287              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     288                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
     289              $C$DW$17        .dwtag  DW_TAG_member
     290                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     291                      .dwattr $C$DW$17, DW_AT_name("Alpha")
     292                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_Alpha")
     293                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     294                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     295              
     296              $C$DW$18        .dwtag  DW_TAG_member
     297                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     298                      .dwattr $C$DW$18, DW_AT_name("Beta")
     299                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_Beta")
     300                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     301                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     302              
     303              $C$DW$19        .dwtag  DW_TAG_member
     304                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     305                      .dwattr $C$DW$19, DW_AT_name("Angle")
     306                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_Angle")
     307                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     308                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     309              
     310              $C$DW$20        .dwtag  DW_TAG_member
     311                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     312                      .dwattr $C$DW$20, DW_AT_name("Ds")
     313                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_Ds")
     314                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     315                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     316              
     317              $C$DW$21        .dwtag  DW_TAG_member
     318                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     319                      .dwattr $C$DW$21, DW_AT_name("Qs")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE    7

     320                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_Qs")
     321                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     322                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     323              
     324              $C$DW$22        .dwtag  DW_TAG_member
     325                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     326                      .dwattr $C$DW$22, DW_AT_name("Sine")
     327                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_Sine")
     328                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     329                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     330              
     331              $C$DW$23        .dwtag  DW_TAG_member
     332                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     333                      .dwattr $C$DW$23, DW_AT_name("Cosine")
     334                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_Cosine")
     335                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     336                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     337              
     338                      .dwendtag $C$DW$T$21
     339              
     340              $C$DW$T$66      .dwtag  DW_TAG_typedef
     341                      .dwattr $C$DW$T$66, DW_AT_name("PARK")
     342                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$21)
     343                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
     344              
     345              
     346              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     347                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
     348              $C$DW$24        .dwtag  DW_TAG_member
     349                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     350                      .dwattr $C$DW$24, DW_AT_name("Alpha")
     351                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_Alpha")
     352                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     353                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     354              
     355              $C$DW$25        .dwtag  DW_TAG_member
     356                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     357                      .dwattr $C$DW$25, DW_AT_name("Beta")
     358                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_Beta")
     359                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     360                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     361              
     362              $C$DW$26        .dwtag  DW_TAG_member
     363                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     364                      .dwattr $C$DW$26, DW_AT_name("Angle")
     365                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_Angle")
     366                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     367                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     368              
     369              $C$DW$27        .dwtag  DW_TAG_member
     370                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     371                      .dwattr $C$DW$27, DW_AT_name("Ds")
     372                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_Ds")
     373                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     374                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE    8

     375              
     376              $C$DW$28        .dwtag  DW_TAG_member
     377                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     378                      .dwattr $C$DW$28, DW_AT_name("Qs")
     379                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_Qs")
     380                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     381                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     382              
     383              $C$DW$29        .dwtag  DW_TAG_member
     384                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     385                      .dwattr $C$DW$29, DW_AT_name("Sine")
     386                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_Sine")
     387                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     388                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     389              
     390              $C$DW$30        .dwtag  DW_TAG_member
     391                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     392                      .dwattr $C$DW$30, DW_AT_name("Cosine")
     393                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_Cosine")
     394                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     395                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     396              
     397                      .dwendtag $C$DW$T$22
     398              
     399              $C$DW$T$67      .dwtag  DW_TAG_typedef
     400                      .dwattr $C$DW$T$67, DW_AT_name("IPARK")
     401                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
     402                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     403              
     404              
     405              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     406                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
     407              $C$DW$31        .dwtag  DW_TAG_member
     408                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     409                      .dwattr $C$DW$31, DW_AT_name("Vc_AB")
     410                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_Vc_AB")
     411                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     412                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     413              
     414              $C$DW$32        .dwtag  DW_TAG_member
     415                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     416                      .dwattr $C$DW$32, DW_AT_name("Vc_BC")
     417                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_Vc_BC")
     418                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     419                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     420              
     421              $C$DW$33        .dwtag  DW_TAG_member
     422                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     423                      .dwattr $C$DW$33, DW_AT_name("Vc_A")
     424                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_Vc_A")
     425                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     426                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     427              
     428              $C$DW$34        .dwtag  DW_TAG_member
     429                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE    9

     430                      .dwattr $C$DW$34, DW_AT_name("Vc_B")
     431                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_Vc_B")
     432                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     433                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     434              
     435                      .dwendtag $C$DW$T$23
     436              
     437              $C$DW$T$68      .dwtag  DW_TAG_typedef
     438                      .dwattr $C$DW$T$68, DW_AT_name("VCMEAS")
     439                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$23)
     440                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
     441              
     442              
     443              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     444                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
     445              $C$DW$35        .dwtag  DW_TAG_member
     446                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     447                      .dwattr $C$DW$35, DW_AT_name("Ref")
     448                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_Ref")
     449                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     450                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     451              
     452              $C$DW$36        .dwtag  DW_TAG_member
     453                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     454                      .dwattr $C$DW$36, DW_AT_name("Fbk")
     455                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_Fbk")
     456                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     457                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     458              
     459              $C$DW$37        .dwtag  DW_TAG_member
     460                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     461                      .dwattr $C$DW$37, DW_AT_name("Out")
     462                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_Out")
     463                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     464                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     465              
     466              $C$DW$38        .dwtag  DW_TAG_member
     467                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     468                      .dwattr $C$DW$38, DW_AT_name("c1")
     469                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_c1")
     470                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     471                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     472              
     473              $C$DW$39        .dwtag  DW_TAG_member
     474                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     475                      .dwattr $C$DW$39, DW_AT_name("c2")
     476                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_c2")
     477                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     478                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     479              
     480              $C$DW$40        .dwtag  DW_TAG_member
     481                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     482                      .dwattr $C$DW$40, DW_AT_name("Ref1")
     483                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_Ref1")
     484                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   10

     485                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     486              
     487              $C$DW$41        .dwtag  DW_TAG_member
     488                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     489                      .dwattr $C$DW$41, DW_AT_name("Fbk1")
     490                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_Fbk1")
     491                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     492                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     493              
     494              $C$DW$42        .dwtag  DW_TAG_member
     495                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     496                      .dwattr $C$DW$42, DW_AT_name("We")
     497                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_We")
     498                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     499                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     500              
     501                      .dwendtag $C$DW$T$24
     502              
     503              $C$DW$T$27      .dwtag  DW_TAG_typedef
     504                      .dwattr $C$DW$T$27, DW_AT_name("PID_GRANDO_TERMINALS")
     505                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
     506                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     507              
     508              
     509              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     510                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x14)
     511              $C$DW$43        .dwtag  DW_TAG_member
     512                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     513                      .dwattr $C$DW$43, DW_AT_name("Kr")
     514                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_Kr")
     515                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     516                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     517              
     518              $C$DW$44        .dwtag  DW_TAG_member
     519                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     520                      .dwattr $C$DW$44, DW_AT_name("Bw")
     521                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_Bw")
     522                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     523                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     524              
     525              $C$DW$45        .dwtag  DW_TAG_member
     526                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     527                      .dwattr $C$DW$45, DW_AT_name("Kp")
     528                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_Kp")
     529                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     530                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     531              
     532              $C$DW$46        .dwtag  DW_TAG_member
     533                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     534                      .dwattr $C$DW$46, DW_AT_name("Ki")
     535                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_Ki")
     536                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     537                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     538              
     539              $C$DW$47        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   11

     540                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     541                      .dwattr $C$DW$47, DW_AT_name("Kd")
     542                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_Kd")
     543                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     544                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     545              
     546              $C$DW$48        .dwtag  DW_TAG_member
     547                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     548                      .dwattr $C$DW$48, DW_AT_name("Km")
     549                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_Km")
     550                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     551                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     552              
     553              $C$DW$49        .dwtag  DW_TAG_member
     554                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     555                      .dwattr $C$DW$49, DW_AT_name("Umax")
     556                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_Umax")
     557                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     558                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     559              
     560              $C$DW$50        .dwtag  DW_TAG_member
     561                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     562                      .dwattr $C$DW$50, DW_AT_name("Umin")
     563                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_Umin")
     564                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     565                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     566              
     567              $C$DW$51        .dwtag  DW_TAG_member
     568                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     569                      .dwattr $C$DW$51, DW_AT_name("sig")
     570                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_sig")
     571                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     572                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     573              
     574              $C$DW$52        .dwtag  DW_TAG_member
     575                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     576                      .dwattr $C$DW$52, DW_AT_name("La")
     577                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_La")
     578                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     579                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     580              
     581                      .dwendtag $C$DW$T$25
     582              
     583              $C$DW$T$28      .dwtag  DW_TAG_typedef
     584                      .dwattr $C$DW$T$28, DW_AT_name("PID_GRANDO_PARAMETERS")
     585                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
     586                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     587              
     588              
     589              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     590                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x18)
     591              $C$DW$53        .dwtag  DW_TAG_member
     592                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     593                      .dwattr $C$DW$53, DW_AT_name("up")
     594                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_up")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   12

     595                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     596                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     597              
     598              $C$DW$54        .dwtag  DW_TAG_member
     599                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     600                      .dwattr $C$DW$54, DW_AT_name("ui")
     601                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_ui")
     602                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     603                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     604              
     605              $C$DW$55        .dwtag  DW_TAG_member
     606                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     607                      .dwattr $C$DW$55, DW_AT_name("ud")
     608                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_ud")
     609                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     610                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     611              
     612              $C$DW$56        .dwtag  DW_TAG_member
     613                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     614                      .dwattr $C$DW$56, DW_AT_name("p1")
     615                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_p1")
     616                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     617                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     618              
     619              $C$DW$57        .dwtag  DW_TAG_member
     620                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     621                      .dwattr $C$DW$57, DW_AT_name("v1")
     622                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_v1")
     623                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     624                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     625              
     626              $C$DW$58        .dwtag  DW_TAG_member
     627                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     628                      .dwattr $C$DW$58, DW_AT_name("i1")
     629                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_i1")
     630                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     631                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     632              
     633              $C$DW$59        .dwtag  DW_TAG_member
     634                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     635                      .dwattr $C$DW$59, DW_AT_name("d1")
     636                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_d1")
     637                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     638                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     639              
     640              $C$DW$60        .dwtag  DW_TAG_member
     641                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     642                      .dwattr $C$DW$60, DW_AT_name("d2")
     643                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_d2")
     644                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     645                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     646              
     647              $C$DW$61        .dwtag  DW_TAG_member
     648                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     649                      .dwattr $C$DW$61, DW_AT_name("w1")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   13

     650                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_w1")
     651                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     652                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     653              
     654              $C$DW$62        .dwtag  DW_TAG_member
     655                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     656                      .dwattr $C$DW$62, DW_AT_name("uc")
     657                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_uc")
     658                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     659                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     660              
     661              $C$DW$63        .dwtag  DW_TAG_member
     662                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     663                      .dwattr $C$DW$63, DW_AT_name("p2")
     664                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_p2")
     665                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     666                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     667              
     668              $C$DW$64        .dwtag  DW_TAG_member
     669                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     670                      .dwattr $C$DW$64, DW_AT_name("i2")
     671                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_i2")
     672                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     673                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     674              
     675                      .dwendtag $C$DW$T$26
     676              
     677              $C$DW$T$29      .dwtag  DW_TAG_typedef
     678                      .dwattr $C$DW$T$29, DW_AT_name("PID_GRANDO_DATA")
     679                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
     680                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
     681              
     682              
     683              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     684                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x3c)
     685              $C$DW$65        .dwtag  DW_TAG_member
     686                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$27)
     687                      .dwattr $C$DW$65, DW_AT_name("term")
     688                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_term")
     689                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     690                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     691              
     692              $C$DW$66        .dwtag  DW_TAG_member
     693                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$28)
     694                      .dwattr $C$DW$66, DW_AT_name("param")
     695                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_param")
     696                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     697                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     698              
     699              $C$DW$67        .dwtag  DW_TAG_member
     700                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$29)
     701                      .dwattr $C$DW$67, DW_AT_name("data")
     702                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_data")
     703                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     704                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   14

     705              
     706                      .dwendtag $C$DW$T$30
     707              
     708              $C$DW$T$69      .dwtag  DW_TAG_typedef
     709                      .dwattr $C$DW$T$69, DW_AT_name("PID_GRANDO_CONTROLLER")
     710                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$30)
     711                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
     712              
     713              
     714              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     715                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x12)
     716              $C$DW$68        .dwtag  DW_TAG_member
     717                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     718                      .dwattr $C$DW$68, DW_AT_name("Ualpha")
     719                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_Ualpha")
     720                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     721                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     722              
     723              $C$DW$69        .dwtag  DW_TAG_member
     724                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     725                      .dwattr $C$DW$69, DW_AT_name("Ubeta")
     726                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_Ubeta")
     727                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     728                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     729              
     730              $C$DW$70        .dwtag  DW_TAG_member
     731                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     732                      .dwattr $C$DW$70, DW_AT_name("Ta")
     733                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_Ta")
     734                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     735                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     736              
     737              $C$DW$71        .dwtag  DW_TAG_member
     738                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     739                      .dwattr $C$DW$71, DW_AT_name("Tb")
     740                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_Tb")
     741                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     742                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     743              
     744              $C$DW$72        .dwtag  DW_TAG_member
     745                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     746                      .dwattr $C$DW$72, DW_AT_name("Tc")
     747                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_Tc")
     748                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     749                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     750              
     751              $C$DW$73        .dwtag  DW_TAG_member
     752                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     753                      .dwattr $C$DW$73, DW_AT_name("tmp1")
     754                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_tmp1")
     755                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     756                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     757              
     758              $C$DW$74        .dwtag  DW_TAG_member
     759                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   15

     760                      .dwattr $C$DW$74, DW_AT_name("tmp2")
     761                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_tmp2")
     762                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     763                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     764              
     765              $C$DW$75        .dwtag  DW_TAG_member
     766                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     767                      .dwattr $C$DW$75, DW_AT_name("tmp3")
     768                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_tmp3")
     769                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     770                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     771              
     772              $C$DW$76        .dwtag  DW_TAG_member
     773                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$31)
     774                      .dwattr $C$DW$76, DW_AT_name("VecSector")
     775                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_VecSector")
     776                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     777                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     778              
     779                      .dwendtag $C$DW$T$32
     780              
     781              $C$DW$T$70      .dwtag  DW_TAG_typedef
     782                      .dwattr $C$DW$T$70, DW_AT_name("SVGEN")
     783                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$32)
     784                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
     785              
     786              
     787              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     788                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x14)
     789              $C$DW$77        .dwtag  DW_TAG_member
     790                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     791                      .dwattr $C$DW$77, DW_AT_name("TargetValue")
     792                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_TargetValue")
     793                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     794                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     795              
     796              $C$DW$78        .dwtag  DW_TAG_member
     797                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$33)
     798                      .dwattr $C$DW$78, DW_AT_name("RampDelayCount")
     799                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_RampDelayCount")
     800                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     801                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     802              
     803              $C$DW$79        .dwtag  DW_TAG_member
     804                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     805                      .dwattr $C$DW$79, DW_AT_name("Acceleration")
     806                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_Acceleration")
     807                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     808                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     809              
     810              $C$DW$80        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     812                      .dwattr $C$DW$80, DW_AT_name("T")
     813                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_T")
     814                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   16

     815                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     816              
     817              $C$DW$81        .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     819                      .dwattr $C$DW$81, DW_AT_name("Max_RPM")
     820                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_Max_RPM")
     821                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     822                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     823              
     824              $C$DW$82        .dwtag  DW_TAG_member
     825                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     826                      .dwattr $C$DW$82, DW_AT_name("SetpointRpm")
     827                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_SetpointRpm")
     828                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     829                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     830              
     831              $C$DW$83        .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     833                      .dwattr $C$DW$83, DW_AT_name("SetpointValue")
     834                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_SetpointValue")
     835                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     836                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     837              
     838              $C$DW$84        .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$33)
     840                      .dwattr $C$DW$84, DW_AT_name("EqualFlag")
     841                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_EqualFlag")
     842                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     843                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     844              
     845              $C$DW$85        .dwtag  DW_TAG_member
     846                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     847                      .dwattr $C$DW$85, DW_AT_name("rmp_tmp")
     848                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rmp_tmp")
     849                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     850                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     851              
     852              $C$DW$86        .dwtag  DW_TAG_member
     853                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     854                      .dwattr $C$DW$86, DW_AT_name("rc_err")
     855                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_rc_err")
     856                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     857                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     858              
     859                      .dwendtag $C$DW$T$34
     860              
     861              $C$DW$T$71      .dwtag  DW_TAG_typedef
     862                      .dwattr $C$DW$T$71, DW_AT_name("RMPCELE")
     863                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
     864                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
     865              
     866              
     867              $C$DW$T$35      .dwtag  DW_TAG_structure_type
     868                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
     869              $C$DW$87        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   17

     870                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     871                      .dwattr $C$DW$87, DW_AT_name("Freq")
     872                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_Freq")
     873                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     874                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     875              
     876              $C$DW$88        .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     878                      .dwattr $C$DW$88, DW_AT_name("StepAngleMax")
     879                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_StepAngleMax")
     880                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     881                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     882              
     883              $C$DW$89        .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     885                      .dwattr $C$DW$89, DW_AT_name("Angle")
     886                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_Angle")
     887                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     888                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     889              
     890              $C$DW$90        .dwtag  DW_TAG_member
     891                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     892                      .dwattr $C$DW$90, DW_AT_name("Gain")
     893                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_Gain")
     894                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     895                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     896              
     897              $C$DW$91        .dwtag  DW_TAG_member
     898                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     899                      .dwattr $C$DW$91, DW_AT_name("Out")
     900                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_Out")
     901                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     902                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     903              
     904              $C$DW$92        .dwtag  DW_TAG_member
     905                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     906                      .dwattr $C$DW$92, DW_AT_name("Offset")
     907                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_Offset")
     908                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     909                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     910              
     911                      .dwendtag $C$DW$T$35
     912              
     913              $C$DW$T$72      .dwtag  DW_TAG_typedef
     914                      .dwattr $C$DW$T$72, DW_AT_name("RAMPGEN")
     915                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
     916                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
     917              
     918              
     919              $C$DW$T$36      .dwtag  DW_TAG_structure_type
     920                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x16)
     921              $C$DW$93        .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     923                      .dwattr $C$DW$93, DW_AT_name("DcBusVolt")
     924                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_DcBusVolt")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   18

     925                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     926                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     927              
     928              $C$DW$94        .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     930                      .dwattr $C$DW$94, DW_AT_name("MfuncV1")
     931                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_MfuncV1")
     932                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     933                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     934              
     935              $C$DW$95        .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     937                      .dwattr $C$DW$95, DW_AT_name("MfuncV2")
     938                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_MfuncV2")
     939                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     940                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     941              
     942              $C$DW$96        .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     944                      .dwattr $C$DW$96, DW_AT_name("MfuncV3")
     945                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_MfuncV3")
     946                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     947                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     948              
     949              $C$DW$97        .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$31)
     951                      .dwattr $C$DW$97, DW_AT_name("OutOfPhase")
     952                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_OutOfPhase")
     953                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     954                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     955              
     956              $C$DW$98        .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     958                      .dwattr $C$DW$98, DW_AT_name("VphaseA")
     959                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_VphaseA")
     960                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     961                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     962              
     963              $C$DW$99        .dwtag  DW_TAG_member
     964                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     965                      .dwattr $C$DW$99, DW_AT_name("VphaseB")
     966                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_VphaseB")
     967                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     968                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     969              
     970              $C$DW$100       .dwtag  DW_TAG_member
     971                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     972                      .dwattr $C$DW$100, DW_AT_name("VphaseC")
     973                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_VphaseC")
     974                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     975                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     976              
     977              $C$DW$101       .dwtag  DW_TAG_member
     978                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     979                      .dwattr $C$DW$101, DW_AT_name("Valpha")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   19

     980                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_Valpha")
     981                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     982                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     983              
     984              $C$DW$102       .dwtag  DW_TAG_member
     985                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     986                      .dwattr $C$DW$102, DW_AT_name("Vbeta")
     987                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_Vbeta")
     988                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     989                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     990              
     991              $C$DW$103       .dwtag  DW_TAG_member
     992                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     993                      .dwattr $C$DW$103, DW_AT_name("temp")
     994                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_temp")
     995                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     996                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     997              
     998                      .dwendtag $C$DW$T$36
     999              
    1000              $C$DW$T$73      .dwtag  DW_TAG_typedef
    1001                      .dwattr $C$DW$T$73, DW_AT_name("PHASEVOLTAGE")
    1002                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$36)
    1003                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1004              
    1005              
    1006              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1007                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    1008              $C$DW$104       .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1010                      .dwattr $C$DW$104, DW_AT_name("ElecTheta")
    1011                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_ElecTheta")
    1012                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1013                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1014              
    1015              $C$DW$105       .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$33)
    1017                      .dwattr $C$DW$105, DW_AT_name("DirectionQep")
    1018                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_DirectionQep")
    1019                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1020                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1021              
    1022              $C$DW$106       .dwtag  DW_TAG_member
    1023                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1024                      .dwattr $C$DW$106, DW_AT_name("OldElecTheta")
    1025                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_OldElecTheta")
    1026                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1027                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1028              
    1029              $C$DW$107       .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1031                      .dwattr $C$DW$107, DW_AT_name("Speed")
    1032                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_Speed")
    1033                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1034                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   20

    1035              
    1036              $C$DW$108       .dwtag  DW_TAG_member
    1037                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$33)
    1038                      .dwattr $C$DW$108, DW_AT_name("BaseRpm")
    1039                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_BaseRpm")
    1040                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1041                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1042              
    1043              $C$DW$109       .dwtag  DW_TAG_member
    1044                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$37)
    1045                      .dwattr $C$DW$109, DW_AT_name("K1")
    1046                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_K1")
    1047                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1048                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1049              
    1050              $C$DW$110       .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1052                      .dwattr $C$DW$110, DW_AT_name("K2")
    1053                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_K2")
    1054                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1055                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1056              
    1057              $C$DW$111       .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1059                      .dwattr $C$DW$111, DW_AT_name("K3")
    1060                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_K3")
    1061                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1062                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1063              
    1064              $C$DW$112       .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$38)
    1066                      .dwattr $C$DW$112, DW_AT_name("SpeedRpm")
    1067                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_SpeedRpm")
    1068                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1069                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1070              
    1071              $C$DW$113       .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1073                      .dwattr $C$DW$113, DW_AT_name("Tmp")
    1074                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_Tmp")
    1075                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1076                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1077              
    1078                      .dwendtag $C$DW$T$39
    1079              
    1080              $C$DW$T$74      .dwtag  DW_TAG_typedef
    1081                      .dwattr $C$DW$T$74, DW_AT_name("SPEED_MEAS_QEP")
    1082                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$39)
    1083                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1084              
    1085              
    1086              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1087                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    1088              $C$DW$114       .dwtag  DW_TAG_member
    1089                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   21

    1090                      .dwattr $C$DW$114, DW_AT_name("ElecTheta")
    1091                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_ElecTheta")
    1092                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1093                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1094              
    1095              $C$DW$115       .dwtag  DW_TAG_member
    1096                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$40)
    1097                      .dwattr $C$DW$115, DW_AT_name("MechTheta")
    1098                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_MechTheta")
    1099                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1100                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1101              
    1102              $C$DW$116       .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$31)
    1104                      .dwattr $C$DW$116, DW_AT_name("DirectionQep")
    1105                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_DirectionQep")
    1106                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1107                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1108              
    1109              $C$DW$117       .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$31)
    1111                      .dwattr $C$DW$117, DW_AT_name("QepPeriod")
    1112                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_QepPeriod")
    1113                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1114                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1115              
    1116              $C$DW$118       .dwtag  DW_TAG_member
    1117                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$33)
    1118                      .dwattr $C$DW$118, DW_AT_name("QepCountIndex")
    1119                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_QepCountIndex")
    1120                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1121                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1122              
    1123              $C$DW$119       .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$38)
    1125                      .dwattr $C$DW$119, DW_AT_name("RawTheta")
    1126                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_RawTheta")
    1127                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1128                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1129              
    1130              $C$DW$120       .dwtag  DW_TAG_member
    1131                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$40)
    1132                      .dwattr $C$DW$120, DW_AT_name("MechScaler")
    1133                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_MechScaler")
    1134                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1135                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1136              
    1137              $C$DW$121       .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$31)
    1139                      .dwattr $C$DW$121, DW_AT_name("LineEncoder")
    1140                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_LineEncoder")
    1141                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1142                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1143              
    1144              $C$DW$122       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   22

    1145                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$31)
    1146                      .dwattr $C$DW$122, DW_AT_name("PolePairs")
    1147                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_PolePairs")
    1148                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1149                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1150              
    1151              $C$DW$123       .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$38)
    1153                      .dwattr $C$DW$123, DW_AT_name("CalibratedAngle")
    1154                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_CalibratedAngle")
    1155                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1156                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1157              
    1158              $C$DW$124       .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$31)
    1160                      .dwattr $C$DW$124, DW_AT_name("IndexSyncFlag")
    1161                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_IndexSyncFlag")
    1162                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1163                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1164              
    1165                      .dwendtag $C$DW$T$41
    1166              
    1167              $C$DW$T$75      .dwtag  DW_TAG_typedef
    1168                      .dwattr $C$DW$T$75, DW_AT_name("QEP")
    1169                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    1170                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1171              
    1172              
    1173              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1174                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x07)
    1175              $C$DW$125       .dwtag  DW_TAG_member
    1176                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$42)
    1177                      .dwattr $C$DW$125, DW_AT_name("stat_reg1")
    1178                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_stat_reg1")
    1179                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1180                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1181              
    1182              $C$DW$126       .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$43)
    1184                      .dwattr $C$DW$126, DW_AT_name("stat_reg2")
    1185                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_stat_reg2")
    1186                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1187                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1188              
    1189              $C$DW$127       .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$44)
    1191                      .dwattr $C$DW$127, DW_AT_name("cntrl_reg1")
    1192                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_cntrl_reg1")
    1193                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1194                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1195              
    1196              $C$DW$128       .dwtag  DW_TAG_member
    1197                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$45)
    1198                      .dwattr $C$DW$128, DW_AT_name("cntrl_reg2")
    1199                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_cntrl_reg2")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   23

    1200                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1201                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1202              
    1203              $C$DW$129       .dwtag  DW_TAG_member
    1204                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$31)
    1205                      .dwattr $C$DW$129, DW_AT_name("readCntrl1")
    1206                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_readCntrl1")
    1207                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1208                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1209              
    1210              $C$DW$130       .dwtag  DW_TAG_member
    1211                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$31)
    1212                      .dwattr $C$DW$130, DW_AT_name("readCntrl2")
    1213                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_readCntrl2")
    1214                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1215                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1216              
    1217              $C$DW$131       .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$31)
    1219                      .dwattr $C$DW$131, DW_AT_name("DRV_fault")
    1220                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_DRV_fault")
    1221                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1222                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1223              
    1224                      .dwendtag $C$DW$T$46
    1225              
    1226              $C$DW$T$76      .dwtag  DW_TAG_typedef
    1227                      .dwattr $C$DW$T$76, DW_AT_name("DRV8301_Vars")
    1228                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$46)
    1229                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1230              
    1231              
    1232              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    1233                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x15)
    1234              $C$DW$132       .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$31)
    1236                      .dwattr $C$DW$132, DW_AT_name("Rsvd0")
    1237                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_Rsvd0")
    1238                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1239                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1240              
    1241              $C$DW$133       .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$47)
    1243                      .dwattr $C$DW$133, DW_AT_name("status1_wwd")
    1244                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_status1_wwd")
    1245                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1246                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1247              
    1248              $C$DW$134       .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$48)
    1250                      .dwattr $C$DW$134, DW_AT_name("status2_ov_vds")
    1251                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_status2_ov_vds")
    1252                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1253                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1254              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   24

    1255              $C$DW$135       .dwtag  DW_TAG_member
    1256                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$49)
    1257                      .dwattr $C$DW$135, DW_AT_name("status3_IC")
    1258                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_status3_IC")
    1259                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1260                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1261              
    1262              $C$DW$136       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$50)
    1264                      .dwattr $C$DW$136, DW_AT_name("status4_gd_Vgs")
    1265                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    1266                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1267                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1268              
    1269              $C$DW$137       .dwtag  DW_TAG_member
    1270                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$51)
    1271                      .dwattr $C$DW$137, DW_AT_name("cntrl5_hs_gd")
    1272                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    1273                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1274                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1275              
    1276              $C$DW$138       .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$52)
    1278                      .dwattr $C$DW$138, DW_AT_name("cntrl6_ls_gd")
    1279                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    1280                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1281                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1282              
    1283              $C$DW$139       .dwtag  DW_TAG_member
    1284                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$53)
    1285                      .dwattr $C$DW$139, DW_AT_name("cntrl7_gd")
    1286                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_cntrl7_gd")
    1287                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1288                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1289              
    1290              $C$DW$140       .dwtag  DW_TAG_member
    1291                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$31)
    1292                      .dwattr $C$DW$140, DW_AT_name("Rsvd8")
    1293                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_Rsvd8")
    1294                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1295                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1296              
    1297              $C$DW$141       .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$54)
    1299                      .dwattr $C$DW$141, DW_AT_name("cntrl9_IC_ops")
    1300                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    1301                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1302                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1303              
    1304              $C$DW$142       .dwtag  DW_TAG_member
    1305                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$55)
    1306                      .dwattr $C$DW$142, DW_AT_name("cntrlA_shunt_amp")
    1307                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    1308                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1309                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   25

    1310              
    1311              $C$DW$143       .dwtag  DW_TAG_member
    1312                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$56)
    1313                      .dwattr $C$DW$143, DW_AT_name("cntrlB_Vreg")
    1314                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    1315                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1316                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1317              
    1318              $C$DW$144       .dwtag  DW_TAG_member
    1319                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$57)
    1320                      .dwattr $C$DW$144, DW_AT_name("cntrlC_Vds_SNS")
    1321                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
    1322                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1323                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1324              
    1325              $C$DW$145       .dwtag  DW_TAG_member
    1326                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$31)
    1327                      .dwattr $C$DW$145, DW_AT_name("readCntrl5")
    1328                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_readCntrl5")
    1329                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1330                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1331              
    1332              $C$DW$146       .dwtag  DW_TAG_member
    1333                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$31)
    1334                      .dwattr $C$DW$146, DW_AT_name("readCntrl6")
    1335                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_readCntrl6")
    1336                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1337                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1338              
    1339              $C$DW$147       .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$31)
    1341                      .dwattr $C$DW$147, DW_AT_name("readCntrl7")
    1342                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_readCntrl7")
    1343                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1344                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1345              
    1346              $C$DW$148       .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$31)
    1348                      .dwattr $C$DW$148, DW_AT_name("readCntrl9")
    1349                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_readCntrl9")
    1350                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1351                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1352              
    1353              $C$DW$149       .dwtag  DW_TAG_member
    1354                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$31)
    1355                      .dwattr $C$DW$149, DW_AT_name("readCntrlA")
    1356                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_readCntrlA")
    1357                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1358                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1359              
    1360              $C$DW$150       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$31)
    1362                      .dwattr $C$DW$150, DW_AT_name("readCntrlB")
    1363                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_readCntrlB")
    1364                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   26

    1365                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1366              
    1367              $C$DW$151       .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$31)
    1369                      .dwattr $C$DW$151, DW_AT_name("readCntrlC")
    1370                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_readCntrlC")
    1371                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1372                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1373              
    1374              $C$DW$152       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$31)
    1376                      .dwattr $C$DW$152, DW_AT_name("DRV_fault")
    1377                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_DRV_fault")
    1378                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1379                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1380              
    1381                      .dwendtag $C$DW$T$58
    1382              
    1383              $C$DW$T$77      .dwtag  DW_TAG_typedef
    1384                      .dwattr $C$DW$T$77, DW_AT_name("DRV8305_Vars")
    1385                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$58)
    1386                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1387              
    1388              
    1389              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    1390                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x1f6)
    1391              $C$DW$153       .dwtag  DW_TAG_member
    1392                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$60)
    1393                      .dwattr $C$DW$153, DW_AT_name("PwmARegs")
    1394                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_PwmARegs")
    1395                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1396                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1397              
    1398              $C$DW$154       .dwtag  DW_TAG_member
    1399                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$60)
    1400                      .dwattr $C$DW$154, DW_AT_name("PwmBRegs")
    1401                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_PwmBRegs")
    1402                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1403                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1404              
    1405              $C$DW$155       .dwtag  DW_TAG_member
    1406                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$60)
    1407                      .dwattr $C$DW$155, DW_AT_name("PwmCRegs")
    1408                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_PwmCRegs")
    1409                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1410                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1411              
    1412              $C$DW$156       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$62)
    1414                      .dwattr $C$DW$156, DW_AT_name("QepRegs")
    1415                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_QepRegs")
    1416                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1417                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1418              
    1419              $C$DW$157       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   27

    1420                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$64)
    1421                      .dwattr $C$DW$157, DW_AT_name("SpiRegs")
    1422                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_SpiRegs")
    1423                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1424                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1425              
    1426              $C$DW$158       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$31)
    1428                      .dwattr $C$DW$158, DW_AT_name("drvScsPin")
    1429                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_drvScsPin")
    1430                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1431                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1432              
    1433              $C$DW$159       .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1435                      .dwattr $C$DW$159, DW_AT_name("offset_shntA")
    1436                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_offset_shntA")
    1437                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1438                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1439              
    1440              $C$DW$160       .dwtag  DW_TAG_member
    1441                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1442                      .dwattr $C$DW$160, DW_AT_name("offset_shntB")
    1443                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_offset_shntB")
    1444                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1445                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1446              
    1447              $C$DW$161       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1449                      .dwattr $C$DW$161, DW_AT_name("offset_As")
    1450                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_offset_As")
    1451                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1452                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1453              
    1454              $C$DW$162       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1456                      .dwattr $C$DW$162, DW_AT_name("offset_Bs")
    1457                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_offset_Bs")
    1458                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1459                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1460              
    1461              $C$DW$163       .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1463                      .dwattr $C$DW$163, DW_AT_name("offset_ABV")
    1464                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_offset_ABV")
    1465                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1466                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1467              
    1468              $C$DW$164       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1470                      .dwattr $C$DW$164, DW_AT_name("offset_BCV")
    1471                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_offset_BCV")
    1472                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1473                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1474              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:43 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   28

    1475              $C$DW$165       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1477                      .dwattr $C$DW$165, DW_AT_name("offset_IcA")
    1478                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_offset_IcA")
    1479                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1480                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1481              
    1482              $C$DW$166       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1484                      .dwattr $C$DW$166, DW_AT_name("offset_IcB")
    1485                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_offset_IcB")
    1486                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1487                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1488              
    1489              $C$DW$167       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1491                      .dwattr $C$DW$167, DW_AT_name("cal_offset_A")
    1492                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_cal_offset_A")
    1493                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1494                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1495              
    1496              $C$DW$168       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1498                      .dwattr $C$DW$168, DW_AT_name("cal_offset_B")
    1499                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_cal_offset_B")
    1500                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1501                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1502              
    1503              $C$DW$169       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1505                      .dwattr $C$DW$169, DW_AT_name("VdTesting")
    1506                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_VdTesting")
    1507                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1508                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1509              
    1510              $C$DW$170       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1512                      .dwattr $C$DW$170, DW_AT_name("VqTesting")
    1513                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_VqTesting")
    1514                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1515                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1516              
    1517              $C$DW$171       .dwtag  DW_TAG_member
