TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Fri Jul 31 12:09:40 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Chiaming\CCSworkspace_V10\MonoMtrServo_377s\F2837x_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_EnableUnbondedIOPullups")

    2058                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2059 000002c5 0200          MOVB      ACC,#0                ; [CPU_ALU] |564| 
    2060 000002c6 1901          SUBB      ACC,#1                ; [CPU_ALU] |564| 
    2061 000002c7 1E12!         MOVL      @$BLOCKED(_DcsmZ1Regs)+18,ACC ; [CPU_ALU] |564| 
    2062                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2063 000002c8 0200          MOVB      ACC,#0                ; [CPU_ALU] |565| 
    2064 000002c9 1901          SUBB      ACC,#1                ; [CPU_ALU] |565| 
    2065 000002ca 1E14!         MOVL      @$BLOCKED(_DcsmZ1Regs)+20,ACC ; [CPU_ALU] |565| 
    2066                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2067 000002cb 0200          MOVB      ACC,#0                ; [CPU_ALU] |566| 
    2068 000002cc 1901          SUBB      ACC,#1                ; [CPU_ALU] |566| 
    2069 000002cd 1E16!         MOVL      @$BLOCKED(_DcsmZ1Regs)+22,ACC ; [CPU_ALU] |566| 
    2070                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2071 000002ce 0200          MOVB      ACC,#0                ; [CPU_ALU] |568| 
    2072 000002cf 761F!         MOVW      DP,#_DcsmZ2Regs+16    ; [CPU_ARAU] 
         000002d0 0000 
    2073 000002d1 1901          SUBB      ACC,#1                ; [CPU_ALU] |568| 
    2074 000002d2 1E10!         MOVL      @$BLOCKED(_DcsmZ2Regs)+16,ACC ; [CPU_ALU] |568| 
    2075                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2076 000002d3 0200          MOVB      ACC,#0                ; [CPU_ALU] |569| 
    2077 000002d4 1901          SUBB      ACC,#1                ; [CPU_ALU] |569| 
    2078 000002d5 1E12!         MOVL      @$BLOCKED(_DcsmZ2Regs)+18,ACC ; [CPU_ALU] |569| 
    2079                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2080 000002d6 0200          MOVB      ACC,#0                ; [CPU_ALU] |570| 
    2081 000002d7 1901          SUBB      ACC,#1                ; [CPU_ALU] |570| 
    2082 000002d8 1E14!         MOVL      @$BLOCKED(_DcsmZ2Regs)+20,ACC ; [CPU_ALU] |570| 
    2083                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2084 000002d9 0200          MOVB      ACC,#0                ; [CPU_ALU] |571| 
    2085 000002da 1901          SUBB      ACC,#1                ; [CPU_ALU] |571| 
    2086 000002db 1E16!         MOVL      @$BLOCKED(_DcsmZ2Regs)+22,ACC ; [CPU_ALU] |571| 
    2087 000002dc 761A   EDIS
    2088 000002dd FF69          SPM       #0                    ; [CPU_ALU] 
    2089                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2090 000002de 9A00          MOVB      AL,#0                 ; [CPU_ALU] |591| 
    2091              $C$DW$87        .dwtag  DW_TAG_TI_branch
    2092                      .dwattr $C$DW$87, DW_AT_low_pc(0x00)
    2093                      .dwattr $C$DW$87, DW_AT_TI_return
    2094              
    2095 000002df 0006          LRETR     ; [CPU_ALU] 
    2096                      ; return occurs ; [] 
    2097                      .dwattr $C$DW$86, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/so
    2098                      .dwattr $C$DW$86, DW_AT_TI_end_line(0x251)
    2099                      .dwattr $C$DW$86, DW_AT_TI_end_column(0x01)
    2100                      .dwendentry
    2101                      .dwendtag $C$DW$86
    2102              
    2103              ;**************************************************************
    2104              ;* UNDEFINED EXTERNAL REFERENCES                              *
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   43

    2105              ;**************************************************************
    2106                      .global _GPIO_EnableUnbondedIOPullups
    2107                      .global _F28x_usDelay
    2108                      .global _RamfuncsLoadStart
    2109                      .global _RamfuncsLoadSize
    2110                      .global _RamfuncsRunStart
    2111                      .global _DcsmZ1Regs
    2112                      .global _DcsmZ2Regs
    2113                      .global _Flash0EccRegs
    2114                      .global _Flash1EccRegs
    2115                      .global _WdRegs
    2116                      .global _ClkCfgRegs
    2117                      .global _AnalogSubsysRegs
    2118                      .global _CpuSysRegs
    2119                      .global _Flash0CtrlRegs
    2120                      .global _Flash1CtrlRegs
    2121                      .global _memcpy
    2122              
    2123              ;***************************************************************
    2124              ;* TYPE INFORMATION                                            *
    2125              ;***************************************************************
    2126              
    2127              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2128                      .dwattr $C$DW$T$25, DW_AT_name("ANALOG_SUBSYS_REGS")
    2129                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
    2130              $C$DW$88        .dwtag  DW_TAG_member
    2131                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
    2132                      .dwattr $C$DW$88, DW_AT_name("rsvd1")
    2133                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd1")
    2134                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2135                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    2136              
    2137              $C$DW$89        .dwtag  DW_TAG_member
    2138                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$112)
    2139                      .dwattr $C$DW$89, DW_AT_name("INTOSC1TRIM")
    2140                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_INTOSC1TRIM")
    2141                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2142                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    2143              
    2144              $C$DW$90        .dwtag  DW_TAG_member
    2145                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$114)
    2146                      .dwattr $C$DW$90, DW_AT_name("INTOSC2TRIM")
    2147                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_INTOSC2TRIM")
    2148                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2149                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    2150              
    2151              $C$DW$91        .dwtag  DW_TAG_member
    2152                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$21)
    2153                      .dwattr $C$DW$91, DW_AT_name("rsvd2")
    2154                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd2")
    2155                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2156                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2157              
    2158              $C$DW$92        .dwtag  DW_TAG_member
    2159                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$176)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   44

    2160                      .dwattr $C$DW$92, DW_AT_name("TSNSCTL")
    2161                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_TSNSCTL")
    2162                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2163                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2164              
    2165              $C$DW$93        .dwtag  DW_TAG_member
    2166                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$22)
    2167                      .dwattr $C$DW$93, DW_AT_name("rsvd3")
    2168                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd3")
    2169                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2170                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2171              
    2172              $C$DW$94        .dwtag  DW_TAG_member
    2173                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$118)
    2174                      .dwattr $C$DW$94, DW_AT_name("LOCK")
    2175                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_LOCK")
    2176                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2177                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2178              
    2179              $C$DW$95        .dwtag  DW_TAG_member
    2180                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$23)
    2181                      .dwattr $C$DW$95, DW_AT_name("rsvd4")
    2182                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd4")
    2183                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2184                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2185              
    2186              $C$DW$96        .dwtag  DW_TAG_member
    2187                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$28)
    2188                      .dwattr $C$DW$96, DW_AT_name("ANAREFTRIMA")
    2189                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_ANAREFTRIMA")
    2190                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2191                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2192              
    2193              $C$DW$97        .dwtag  DW_TAG_member
    2194                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$30)
    2195                      .dwattr $C$DW$97, DW_AT_name("ANAREFTRIMB")
    2196                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_ANAREFTRIMB")
    2197                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2198                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2199              
    2200              $C$DW$98        .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$32)
    2202                      .dwattr $C$DW$98, DW_AT_name("ANAREFTRIMC")
    2203                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_ANAREFTRIMC")
    2204                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2205                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2206              
    2207              $C$DW$99        .dwtag  DW_TAG_member
    2208                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$34)
    2209                      .dwattr $C$DW$99, DW_AT_name("ANAREFTRIMD")
    2210                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_ANAREFTRIMD")
    2211                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2212                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2213              
    2214              $C$DW$100       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   45

    2215                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$24)
    2216                      .dwattr $C$DW$100, DW_AT_name("rsvd5")
    2217                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd5")
    2218                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2219                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2220              
    2221                      .dwendtag $C$DW$T$25
    2222              
    2223              $C$DW$101       .dwtag  DW_TAG_TI_far_type
    2224                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$25)
    2225              
    2226              $C$DW$T$224     .dwtag  DW_TAG_volatile_type
    2227                      .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$101)
    2228              
    2229              
    2230              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2231                      .dwattr $C$DW$T$26, DW_AT_name("ANAREFTRIMA_BITS")
    2232                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2233              $C$DW$102       .dwtag  DW_TAG_member
    2234                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    2235                      .dwattr $C$DW$102, DW_AT_name("BGVALTRIM")
    2236                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_BGVALTRIM")
    2237                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0a)
    2238                      .dwattr $C$DW$102, DW_AT_bit_size(0x06)
    2239                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2240                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2241              
    2242              $C$DW$103       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    2244                      .dwattr $C$DW$103, DW_AT_name("BGSLOPETRIM")
    2245                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2246                      .dwattr $C$DW$103, DW_AT_bit_offset(0x05)
    2247                      .dwattr $C$DW$103, DW_AT_bit_size(0x05)
    2248                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2249                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2250              
    2251              $C$DW$104       .dwtag  DW_TAG_member
    2252                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    2253                      .dwattr $C$DW$104, DW_AT_name("IREFTRIM")
    2254                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_IREFTRIM")
    2255                      .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    2256                      .dwattr $C$DW$104, DW_AT_bit_size(0x05)
    2257                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2258                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2259              
    2260              $C$DW$105       .dwtag  DW_TAG_member
    2261                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2262                      .dwattr $C$DW$105, DW_AT_name("rsvd1")
    2263                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd1")
    2264                      .dwattr $C$DW$105, DW_AT_bit_offset(0x08)
    2265                      .dwattr $C$DW$105, DW_AT_bit_size(0x08)
    2266                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2267                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2268              
    2269              $C$DW$106       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   46

    2270                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    2271                      .dwattr $C$DW$106, DW_AT_name("rsvd2")
    2272                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd2")
    2273                      .dwattr $C$DW$106, DW_AT_bit_offset(0x00)
    2274                      .dwattr $C$DW$106, DW_AT_bit_size(0x08)
    2275                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2276                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2277              
    2278                      .dwendtag $C$DW$T$26
    2279              
    2280              
    2281              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2282                      .dwattr $C$DW$T$28, DW_AT_name("ANAREFTRIMA_REG")
    2283                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2284              $C$DW$107       .dwtag  DW_TAG_member
    2285                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$27)
    2286                      .dwattr $C$DW$107, DW_AT_name("all")
    2287                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_all")
    2288                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2289                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2290              
    2291              $C$DW$108       .dwtag  DW_TAG_member
    2292                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$26)
    2293                      .dwattr $C$DW$108, DW_AT_name("bit")
    2294                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_bit")
    2295                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2296                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2297              
    2298                      .dwendtag $C$DW$T$28
    2299              
    2300              
    2301              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2302                      .dwattr $C$DW$T$29, DW_AT_name("ANAREFTRIMB_BITS")
    2303                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2304              $C$DW$109       .dwtag  DW_TAG_member
    2305                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2306                      .dwattr $C$DW$109, DW_AT_name("BGVALTRIM")
    2307                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_BGVALTRIM")
    2308                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0a)
    2309                      .dwattr $C$DW$109, DW_AT_bit_size(0x06)
    2310                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2311                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2312              
    2313              $C$DW$110       .dwtag  DW_TAG_member
    2314                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2315                      .dwattr $C$DW$110, DW_AT_name("BGSLOPETRIM")
    2316                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2317                      .dwattr $C$DW$110, DW_AT_bit_offset(0x05)
    2318                      .dwattr $C$DW$110, DW_AT_bit_size(0x05)
    2319                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2320                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2321              
    2322              $C$DW$111       .dwtag  DW_TAG_member
    2323                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2324                      .dwattr $C$DW$111, DW_AT_name("IREFTRIM")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   47

    2325                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_IREFTRIM")
    2326                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    2327                      .dwattr $C$DW$111, DW_AT_bit_size(0x05)
    2328                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2329                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2330              
    2331              $C$DW$112       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2333                      .dwattr $C$DW$112, DW_AT_name("rsvd1")
    2334                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd1")
    2335                      .dwattr $C$DW$112, DW_AT_bit_offset(0x08)
    2336                      .dwattr $C$DW$112, DW_AT_bit_size(0x08)
    2337                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2338                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2339              
    2340              $C$DW$113       .dwtag  DW_TAG_member
    2341                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2342                      .dwattr $C$DW$113, DW_AT_name("rsvd2")
    2343                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd2")
    2344                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00)
    2345                      .dwattr $C$DW$113, DW_AT_bit_size(0x08)
    2346                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2347                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2348              
    2349                      .dwendtag $C$DW$T$29
    2350              
    2351              
    2352              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2353                      .dwattr $C$DW$T$30, DW_AT_name("ANAREFTRIMB_REG")
    2354                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2355              $C$DW$114       .dwtag  DW_TAG_member
    2356                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$27)
    2357                      .dwattr $C$DW$114, DW_AT_name("all")
    2358                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_all")
    2359                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2360                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2361              
    2362              $C$DW$115       .dwtag  DW_TAG_member
    2363                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$29)
    2364                      .dwattr $C$DW$115, DW_AT_name("bit")
    2365                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_bit")
    2366                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2367                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2368              
    2369                      .dwendtag $C$DW$T$30
    2370              
    2371              
    2372              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2373                      .dwattr $C$DW$T$31, DW_AT_name("ANAREFTRIMC_BITS")
    2374                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2375              $C$DW$116       .dwtag  DW_TAG_member
    2376                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2377                      .dwattr $C$DW$116, DW_AT_name("BGVALTRIM")
    2378                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_BGVALTRIM")
    2379                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0a)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   48

    2380                      .dwattr $C$DW$116, DW_AT_bit_size(0x06)
    2381                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2382                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2383              
    2384              $C$DW$117       .dwtag  DW_TAG_member
    2385                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2386                      .dwattr $C$DW$117, DW_AT_name("BGSLOPETRIM")
    2387                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2388                      .dwattr $C$DW$117, DW_AT_bit_offset(0x05)
    2389                      .dwattr $C$DW$117, DW_AT_bit_size(0x05)
    2390                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2391                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2392              
    2393              $C$DW$118       .dwtag  DW_TAG_member
    2394                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2395                      .dwattr $C$DW$118, DW_AT_name("IREFTRIM")
    2396                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_IREFTRIM")
    2397                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    2398                      .dwattr $C$DW$118, DW_AT_bit_size(0x05)
    2399                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2400                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2401              
    2402              $C$DW$119       .dwtag  DW_TAG_member
    2403                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2404                      .dwattr $C$DW$119, DW_AT_name("rsvd1")
    2405                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd1")
    2406                      .dwattr $C$DW$119, DW_AT_bit_offset(0x08)
    2407                      .dwattr $C$DW$119, DW_AT_bit_size(0x08)
    2408                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2409                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2410              
    2411              $C$DW$120       .dwtag  DW_TAG_member
    2412                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2413                      .dwattr $C$DW$120, DW_AT_name("rsvd2")
    2414                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd2")
    2415                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00)
    2416                      .dwattr $C$DW$120, DW_AT_bit_size(0x08)
    2417                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2418                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2419              
    2420                      .dwendtag $C$DW$T$31
    2421              
    2422              
    2423              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2424                      .dwattr $C$DW$T$32, DW_AT_name("ANAREFTRIMC_REG")
    2425                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2426              $C$DW$121       .dwtag  DW_TAG_member
    2427                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$27)
    2428                      .dwattr $C$DW$121, DW_AT_name("all")
    2429                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_all")
    2430                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2431                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2432              
    2433              $C$DW$122       .dwtag  DW_TAG_member
    2434                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   49

    2435                      .dwattr $C$DW$122, DW_AT_name("bit")
    2436                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_bit")
    2437                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2438                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2439              
    2440                      .dwendtag $C$DW$T$32
    2441              
    2442              
    2443              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2444                      .dwattr $C$DW$T$33, DW_AT_name("ANAREFTRIMD_BITS")
    2445                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2446              $C$DW$123       .dwtag  DW_TAG_member
    2447                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2448                      .dwattr $C$DW$123, DW_AT_name("BGVALTRIM")
    2449                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_BGVALTRIM")
    2450                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0a)
    2451                      .dwattr $C$DW$123, DW_AT_bit_size(0x06)
    2452                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2453                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2454              
    2455              $C$DW$124       .dwtag  DW_TAG_member
    2456                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2457                      .dwattr $C$DW$124, DW_AT_name("BGSLOPETRIM")
    2458                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2459                      .dwattr $C$DW$124, DW_AT_bit_offset(0x05)
    2460                      .dwattr $C$DW$124, DW_AT_bit_size(0x05)
    2461                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2462                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2463              
    2464              $C$DW$125       .dwtag  DW_TAG_member
    2465                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2466                      .dwattr $C$DW$125, DW_AT_name("IREFTRIM")
    2467                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_IREFTRIM")
    2468                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00)
    2469                      .dwattr $C$DW$125, DW_AT_bit_size(0x05)
    2470                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2471                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2472              
    2473              $C$DW$126       .dwtag  DW_TAG_member
    2474                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2475                      .dwattr $C$DW$126, DW_AT_name("rsvd1")
    2476                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd1")
    2477                      .dwattr $C$DW$126, DW_AT_bit_offset(0x08)
    2478                      .dwattr $C$DW$126, DW_AT_bit_size(0x08)
    2479                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2480                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2481              
    2482              $C$DW$127       .dwtag  DW_TAG_member
    2483                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2484                      .dwattr $C$DW$127, DW_AT_name("rsvd2")
    2485                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd2")
    2486                      .dwattr $C$DW$127, DW_AT_bit_offset(0x00)
    2487                      .dwattr $C$DW$127, DW_AT_bit_size(0x08)
    2488                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2489                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   50

    2490              
    2491                      .dwendtag $C$DW$T$33
    2492              
    2493              
    2494              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2495                      .dwattr $C$DW$T$34, DW_AT_name("ANAREFTRIMD_REG")
    2496                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2497              $C$DW$128       .dwtag  DW_TAG_member
    2498                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$27)
    2499                      .dwattr $C$DW$128, DW_AT_name("all")
    2500                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_all")
    2501                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2502                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2503              
    2504              $C$DW$129       .dwtag  DW_TAG_member
    2505                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$33)
    2506                      .dwattr $C$DW$129, DW_AT_name("bit")
    2507                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_bit")
    2508                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2509                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2510              
    2511                      .dwendtag $C$DW$T$34
    2512              
    2513              
    2514              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2515                      .dwattr $C$DW$T$35, DW_AT_name("AUXCLKDIVSEL_BITS")
    2516                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2517              $C$DW$130       .dwtag  DW_TAG_member
    2518                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2519                      .dwattr $C$DW$130, DW_AT_name("AUXPLLDIV")
    2520                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_AUXPLLDIV")
    2521                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0e)
    2522                      .dwattr $C$DW$130, DW_AT_bit_size(0x02)
    2523                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2524                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2525              
    2526              $C$DW$131       .dwtag  DW_TAG_member
    2527                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2528                      .dwattr $C$DW$131, DW_AT_name("rsvd1")
    2529                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd1")
    2530                      .dwattr $C$DW$131, DW_AT_bit_offset(0x00)
    2531                      .dwattr $C$DW$131, DW_AT_bit_size(0x0e)
    2532                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2533                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2534              
    2535              $C$DW$132       .dwtag  DW_TAG_member
    2536                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2537                      .dwattr $C$DW$132, DW_AT_name("rsvd2")
    2538                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd2")
    2539                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
    2540                      .dwattr $C$DW$132, DW_AT_bit_size(0x10)
    2541                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2542                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2543              
    2544                      .dwendtag $C$DW$T$35
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   51

    2545              
    2546              
    2547              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2548                      .dwattr $C$DW$T$36, DW_AT_name("AUXCLKDIVSEL_REG")
    2549                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2550              $C$DW$133       .dwtag  DW_TAG_member
    2551                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$27)
    2552                      .dwattr $C$DW$133, DW_AT_name("all")
    2553                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_all")
    2554                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2555                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2556              
    2557              $C$DW$134       .dwtag  DW_TAG_member
    2558                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$35)
    2559                      .dwattr $C$DW$134, DW_AT_name("bit")
    2560                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_bit")
    2561                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2562                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2563              
    2564                      .dwendtag $C$DW$T$36
    2565              
    2566              
    2567              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2568                      .dwattr $C$DW$T$37, DW_AT_name("AUXPLLCTL1_BITS")
    2569                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2570              $C$DW$135       .dwtag  DW_TAG_member
    2571                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2572                      .dwattr $C$DW$135, DW_AT_name("PLLEN")
    2573                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_PLLEN")
    2574                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0f)
    2575                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    2576                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2577                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2578              
    2579              $C$DW$136       .dwtag  DW_TAG_member
    2580                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2581                      .dwattr $C$DW$136, DW_AT_name("PLLCLKEN")
    2582                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_PLLCLKEN")
    2583                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0e)
    2584                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    2585                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2586                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2587              
    2588              $C$DW$137       .dwtag  DW_TAG_member
    2589                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2590                      .dwattr $C$DW$137, DW_AT_name("rsvd1")
    2591                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd1")
    2592                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    2593                      .dwattr $C$DW$137, DW_AT_bit_size(0x0e)
    2594                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2595                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2596              
    2597              $C$DW$138       .dwtag  DW_TAG_member
    2598                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2599                      .dwattr $C$DW$138, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   52

    2600                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd2")
    2601                      .dwattr $C$DW$138, DW_AT_bit_offset(0x00)
    2602                      .dwattr $C$DW$138, DW_AT_bit_size(0x10)
    2603                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2604                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2605              
    2606                      .dwendtag $C$DW$T$37
    2607              
    2608              
    2609              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2610                      .dwattr $C$DW$T$38, DW_AT_name("AUXPLLCTL1_REG")
    2611                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2612              $C$DW$139       .dwtag  DW_TAG_member
    2613                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$27)
    2614                      .dwattr $C$DW$139, DW_AT_name("all")
    2615                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_all")
    2616                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2617                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2618              
    2619              $C$DW$140       .dwtag  DW_TAG_member
    2620                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$37)
    2621                      .dwattr $C$DW$140, DW_AT_name("bit")
    2622                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_bit")
    2623                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2624                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2625              
    2626                      .dwendtag $C$DW$T$38
    2627              
    2628              
    2629              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2630                      .dwattr $C$DW$T$39, DW_AT_name("AUXPLLMULT_BITS")
    2631                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2632              $C$DW$141       .dwtag  DW_TAG_member
    2633                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2634                      .dwattr $C$DW$141, DW_AT_name("IMULT")
    2635                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_IMULT")
    2636                      .dwattr $C$DW$141, DW_AT_bit_offset(0x09)
    2637                      .dwattr $C$DW$141, DW_AT_bit_size(0x07)
    2638                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2639                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2640              
    2641              $C$DW$142       .dwtag  DW_TAG_member
    2642                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2643                      .dwattr $C$DW$142, DW_AT_name("rsvd1")
    2644                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd1")
    2645                      .dwattr $C$DW$142, DW_AT_bit_offset(0x08)
    2646                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2647                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2648                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2649              
    2650              $C$DW$143       .dwtag  DW_TAG_member
    2651                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2652                      .dwattr $C$DW$143, DW_AT_name("FMULT")
    2653                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_FMULT")
    2654                      .dwattr $C$DW$143, DW_AT_bit_offset(0x06)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   53

    2655                      .dwattr $C$DW$143, DW_AT_bit_size(0x02)
    2656                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2657                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2658              
    2659              $C$DW$144       .dwtag  DW_TAG_member
    2660                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2661                      .dwattr $C$DW$144, DW_AT_name("rsvd2")
    2662                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd2")
    2663                      .dwattr $C$DW$144, DW_AT_bit_offset(0x00)
    2664                      .dwattr $C$DW$144, DW_AT_bit_size(0x06)
    2665                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2666                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2667              
    2668              $C$DW$145       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2670                      .dwattr $C$DW$145, DW_AT_name("rsvd3")
    2671                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd3")
    2672                      .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    2673                      .dwattr $C$DW$145, DW_AT_bit_size(0x10)
    2674                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2675                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2676              
    2677                      .dwendtag $C$DW$T$39
    2678              
    2679              
    2680              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2681                      .dwattr $C$DW$T$40, DW_AT_name("AUXPLLMULT_REG")
    2682                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2683              $C$DW$146       .dwtag  DW_TAG_member
    2684                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$27)
    2685                      .dwattr $C$DW$146, DW_AT_name("all")
    2686                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_all")
    2687                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2688                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2689              
    2690              $C$DW$147       .dwtag  DW_TAG_member
    2691                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$39)
    2692                      .dwattr $C$DW$147, DW_AT_name("bit")
    2693                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_bit")
    2694                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2695                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2696              
    2697                      .dwendtag $C$DW$T$40
    2698              
    2699              
    2700              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2701                      .dwattr $C$DW$T$41, DW_AT_name("AUXPLLSTS_BITS")
    2702                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2703              $C$DW$148       .dwtag  DW_TAG_member
    2704                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2705                      .dwattr $C$DW$148, DW_AT_name("LOCKS")
    2706                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_LOCKS")
    2707                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0f)
    2708                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2709                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   54

    2710                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2711              
    2712              $C$DW$149       .dwtag  DW_TAG_member
    2713                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2714                      .dwattr $C$DW$149, DW_AT_name("SLIPS")
    2715                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_SLIPS")
    2716                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0e)
    2717                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2718                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2719                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2720              
    2721              $C$DW$150       .dwtag  DW_TAG_member
    2722                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2723                      .dwattr $C$DW$150, DW_AT_name("rsvd1")
    2724                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd1")
    2725                      .dwattr $C$DW$150, DW_AT_bit_offset(0x00)
    2726                      .dwattr $C$DW$150, DW_AT_bit_size(0x0e)
    2727                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2728                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2729              
    2730              $C$DW$151       .dwtag  DW_TAG_member
    2731                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2732                      .dwattr $C$DW$151, DW_AT_name("rsvd2")
    2733                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd2")
    2734                      .dwattr $C$DW$151, DW_AT_bit_offset(0x00)
    2735                      .dwattr $C$DW$151, DW_AT_bit_size(0x10)
    2736                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2737                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2738              
    2739                      .dwendtag $C$DW$T$41
    2740              
    2741              
    2742              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2743                      .dwattr $C$DW$T$42, DW_AT_name("AUXPLLSTS_REG")
    2744                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2745              $C$DW$152       .dwtag  DW_TAG_member
    2746                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$27)
    2747                      .dwattr $C$DW$152, DW_AT_name("all")
    2748                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_all")
    2749                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2750                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2751              
    2752              $C$DW$153       .dwtag  DW_TAG_member
    2753                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$41)
    2754                      .dwattr $C$DW$153, DW_AT_name("bit")
    2755                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_bit")
    2756                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2757                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2758              
    2759                      .dwendtag $C$DW$T$42
    2760              
    2761              
    2762              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2763                      .dwattr $C$DW$T$43, DW_AT_name("CLKCFGLOCK1_BITS")
    2764                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   55

    2765              $C$DW$154       .dwtag  DW_TAG_member
    2766                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2767                      .dwattr $C$DW$154, DW_AT_name("CLKSRCCTL1")
    2768                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    2769                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0f)
    2770                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    2771                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2772                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2773              
    2774              $C$DW$155       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2776                      .dwattr $C$DW$155, DW_AT_name("CLKSRCCTL2")
    2777                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    2778                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0e)
    2779                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2780                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2781                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2782              
    2783              $C$DW$156       .dwtag  DW_TAG_member
    2784                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2785                      .dwattr $C$DW$156, DW_AT_name("CLKSRCCTL3")
    2786                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    2787                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0d)
    2788                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2789                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2790                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2791              
    2792              $C$DW$157       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2794                      .dwattr $C$DW$157, DW_AT_name("SYSPLLCTL1")
    2795                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    2796                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0c)
    2797                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2798                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2799                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2800              
    2801              $C$DW$158       .dwtag  DW_TAG_member
    2802                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2803                      .dwattr $C$DW$158, DW_AT_name("SYSPLLCTL2")
    2804                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    2805                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0b)
    2806                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2807                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2808                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2809              
    2810              $C$DW$159       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2812                      .dwattr $C$DW$159, DW_AT_name("SYSPLLCTL3")
    2813                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    2814                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0a)
    2815                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2816                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2817                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2818              
    2819              $C$DW$160       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   56

    2820                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2821                      .dwattr $C$DW$160, DW_AT_name("SYSPLLMULT")
    2822                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_SYSPLLMULT")
    2823                      .dwattr $C$DW$160, DW_AT_bit_offset(0x09)
    2824                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2825                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2826                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2827              
    2828              $C$DW$161       .dwtag  DW_TAG_member
    2829                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2830                      .dwattr $C$DW$161, DW_AT_name("AUXPLLCTL1")
    2831                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    2832                      .dwattr $C$DW$161, DW_AT_bit_offset(0x08)
    2833                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2834                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2835                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2836              
    2837              $C$DW$162       .dwtag  DW_TAG_member
    2838                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2839                      .dwattr $C$DW$162, DW_AT_name("rsvd1")
    2840                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd1")
    2841                      .dwattr $C$DW$162, DW_AT_bit_offset(0x07)
    2842                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2843                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2844                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2845              
    2846              $C$DW$163       .dwtag  DW_TAG_member
    2847                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2848                      .dwattr $C$DW$163, DW_AT_name("rsvd2")
    2849                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd2")
    2850                      .dwattr $C$DW$163, DW_AT_bit_offset(0x06)
    2851                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2852                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2853                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2854              
    2855              $C$DW$164       .dwtag  DW_TAG_member
    2856                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2857                      .dwattr $C$DW$164, DW_AT_name("AUXPLLMULT")
    2858                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_AUXPLLMULT")
    2859                      .dwattr $C$DW$164, DW_AT_bit_offset(0x05)
    2860                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2861                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2862                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2863              
    2864              $C$DW$165       .dwtag  DW_TAG_member
    2865                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2866                      .dwattr $C$DW$165, DW_AT_name("SYSCLKDIVSEL")
    2867                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    2868                      .dwattr $C$DW$165, DW_AT_bit_offset(0x04)
    2869                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2870                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2871                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2872              
    2873              $C$DW$166       .dwtag  DW_TAG_member
    2874                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   57

    2875                      .dwattr $C$DW$166, DW_AT_name("AUXCLKDIVSEL")
    2876                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    2877                      .dwattr $C$DW$166, DW_AT_bit_offset(0x03)
    2878                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2879                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2880                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2881              
    2882              $C$DW$167       .dwtag  DW_TAG_member
    2883                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2884                      .dwattr $C$DW$167, DW_AT_name("PERCLKDIVSEL")
    2885                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    2886                      .dwattr $C$DW$167, DW_AT_bit_offset(0x02)
    2887                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2888                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2889                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2890              
    2891              $C$DW$168       .dwtag  DW_TAG_member
    2892                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2893                      .dwattr $C$DW$168, DW_AT_name("rsvd3")
    2894                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd3")
    2895                      .dwattr $C$DW$168, DW_AT_bit_offset(0x01)
    2896                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2897                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2898                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2899              
    2900              $C$DW$169       .dwtag  DW_TAG_member
    2901                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2902                      .dwattr $C$DW$169, DW_AT_name("LOSPCP")
    2903                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_LOSPCP")
    2904                      .dwattr $C$DW$169, DW_AT_bit_offset(0x00)
    2905                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2906                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2907                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2908              
    2909              $C$DW$170       .dwtag  DW_TAG_member
    2910                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2911                      .dwattr $C$DW$170, DW_AT_name("rsvd4")
    2912                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd4")
    2913                      .dwattr $C$DW$170, DW_AT_bit_offset(0x00)
    2914                      .dwattr $C$DW$170, DW_AT_bit_size(0x10)
    2915                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2916                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2917              
    2918                      .dwendtag $C$DW$T$43
    2919              
    2920              
    2921              $C$DW$T$44      .dwtag  DW_TAG_union_type
    2922                      .dwattr $C$DW$T$44, DW_AT_name("CLKCFGLOCK1_REG")
    2923                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2924              $C$DW$171       .dwtag  DW_TAG_member
    2925                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$27)
    2926                      .dwattr $C$DW$171, DW_AT_name("all")
    2927                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_all")
    2928                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2929                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   58

    2930              
    2931              $C$DW$172       .dwtag  DW_TAG_member
    2932                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$43)
    2933                      .dwattr $C$DW$172, DW_AT_name("bit")
    2934                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_bit")
    2935                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2936                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2937              
    2938                      .dwendtag $C$DW$T$44
    2939              
    2940              
    2941              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2942                      .dwattr $C$DW$T$45, DW_AT_name("CLKSRCCTL1_BITS")
    2943                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2944              $C$DW$173       .dwtag  DW_TAG_member
    2945                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2946                      .dwattr $C$DW$173, DW_AT_name("OSCCLKSRCSEL")
    2947                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    2948                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0e)
    2949                      .dwattr $C$DW$173, DW_AT_bit_size(0x02)
    2950                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2951                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2952              
    2953              $C$DW$174       .dwtag  DW_TAG_member
    2954                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2955                      .dwattr $C$DW$174, DW_AT_name("rsvd1")
    2956                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd1")
    2957                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0d)
    2958                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2959                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2960                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2961              
    2962              $C$DW$175       .dwtag  DW_TAG_member
    2963                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2964                      .dwattr $C$DW$175, DW_AT_name("INTOSC2OFF")
    2965                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_INTOSC2OFF")
    2966                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0c)
    2967                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2968                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2969                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2970              
    2971              $C$DW$176       .dwtag  DW_TAG_member
    2972                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2973                      .dwattr $C$DW$176, DW_AT_name("XTALOFF")
    2974                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_XTALOFF")
    2975                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0b)
    2976                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2977                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2978                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2979              
    2980              $C$DW$177       .dwtag  DW_TAG_member
    2981                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2982                      .dwattr $C$DW$177, DW_AT_name("WDHALTI")
    2983                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_WDHALTI")
    2984                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0a)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   59

    2985                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2986                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2987                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2988              
    2989              $C$DW$178       .dwtag  DW_TAG_member
    2990                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2991                      .dwattr $C$DW$178, DW_AT_name("rsvd2")
    2992                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd2")
    2993                      .dwattr $C$DW$178, DW_AT_bit_offset(0x00)
    2994                      .dwattr $C$DW$178, DW_AT_bit_size(0x0a)
    2995                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2996                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2997              
    2998              $C$DW$179       .dwtag  DW_TAG_member
    2999                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    3000                      .dwattr $C$DW$179, DW_AT_name("rsvd3")
    3001                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd3")
    3002                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00)
    3003                      .dwattr $C$DW$179, DW_AT_bit_size(0x10)
    3004                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3005                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3006              
    3007                      .dwendtag $C$DW$T$45
    3008              
    3009              
    3010              $C$DW$T$46      .dwtag  DW_TAG_union_type
    3011                      .dwattr $C$DW$T$46, DW_AT_name("CLKSRCCTL1_REG")
    3012                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    3013              $C$DW$180       .dwtag  DW_TAG_member
    3014                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$27)
    3015                      .dwattr $C$DW$180, DW_AT_name("all")
    3016                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_all")
    3017                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3018                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3019              
    3020              $C$DW$181       .dwtag  DW_TAG_member
    3021                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$45)
    3022                      .dwattr $C$DW$181, DW_AT_name("bit")
    3023                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_bit")
    3024                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3025                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3026              
    3027                      .dwendtag $C$DW$T$46
    3028              
    3029              
    3030              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3031                      .dwattr $C$DW$T$47, DW_AT_name("CLKSRCCTL2_BITS")
    3032                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    3033              $C$DW$182       .dwtag  DW_TAG_member
    3034                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    3035                      .dwattr $C$DW$182, DW_AT_name("AUXOSCCLKSRCSEL")
    3036                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    3037                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0e)
    3038                      .dwattr $C$DW$182, DW_AT_bit_size(0x02)
    3039                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   60

    3040                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3041              
    3042              $C$DW$183       .dwtag  DW_TAG_member
    3043                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    3044                      .dwattr $C$DW$183, DW_AT_name("CANABCLKSEL")
    3045                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_CANABCLKSEL")
    3046                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0c)
    3047                      .dwattr $C$DW$183, DW_AT_bit_size(0x02)
    3048                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3049                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3050              
    3051              $C$DW$184       .dwtag  DW_TAG_member
    3052                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    3053                      .dwattr $C$DW$184, DW_AT_name("CANBBCLKSEL")
    3054                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    3055                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0a)
    3056                      .dwattr $C$DW$184, DW_AT_bit_size(0x02)
    3057                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3058                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3059              
    3060              $C$DW$185       .dwtag  DW_TAG_member
    3061                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    3062                      .dwattr $C$DW$185, DW_AT_name("rsvd1")
    3063                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd1")
    3064                      .dwattr $C$DW$185, DW_AT_bit_offset(0x08)
    3065                      .dwattr $C$DW$185, DW_AT_bit_size(0x02)
    3066                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3067                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3068              
    3069              $C$DW$186       .dwtag  DW_TAG_member
    3070                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    3071                      .dwattr $C$DW$186, DW_AT_name("rsvd2")
    3072                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd2")
    3073                      .dwattr $C$DW$186, DW_AT_bit_offset(0x06)
    3074                      .dwattr $C$DW$186, DW_AT_bit_size(0x02)
    3075                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3076                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3077              
    3078              $C$DW$187       .dwtag  DW_TAG_member
    3079                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    3080                      .dwattr $C$DW$187, DW_AT_name("rsvd3")
    3081                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_rsvd3")
    3082                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00)
    3083                      .dwattr $C$DW$187, DW_AT_bit_size(0x06)
    3084                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3085                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3086              
    3087              $C$DW$188       .dwtag  DW_TAG_member
    3088                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    3089                      .dwattr $C$DW$188, DW_AT_name("rsvd4")
    3090                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd4")
    3091                      .dwattr $C$DW$188, DW_AT_bit_offset(0x00)
    3092                      .dwattr $C$DW$188, DW_AT_bit_size(0x10)
    3093                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3094                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   61

    3095              
    3096                      .dwendtag $C$DW$T$47
    3097              
    3098              
    3099              $C$DW$T$48      .dwtag  DW_TAG_union_type
    3100                      .dwattr $C$DW$T$48, DW_AT_name("CLKSRCCTL2_REG")
    3101                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    3102              $C$DW$189       .dwtag  DW_TAG_member
    3103                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$27)
    3104                      .dwattr $C$DW$189, DW_AT_name("all")
    3105                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_all")
    3106                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3107                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3108              
    3109              $C$DW$190       .dwtag  DW_TAG_member
    3110                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$47)
    3111                      .dwattr $C$DW$190, DW_AT_name("bit")
    3112                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_bit")
    3113                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3114                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3115              
    3116                      .dwendtag $C$DW$T$48
    3117              
    3118              
    3119              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3120                      .dwattr $C$DW$T$49, DW_AT_name("CLKSRCCTL3_BITS")
    3121                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    3122              $C$DW$191       .dwtag  DW_TAG_member
    3123                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    3124                      .dwattr $C$DW$191, DW_AT_name("XCLKOUTSEL")
    3125                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    3126                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0d)
    3127                      .dwattr $C$DW$191, DW_AT_bit_size(0x03)
    3128                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3129                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3130              
    3131              $C$DW$192       .dwtag  DW_TAG_member
    3132                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    3133                      .dwattr $C$DW$192, DW_AT_name("rsvd1")
    3134                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd1")
    3135                      .dwattr $C$DW$192, DW_AT_bit_offset(0x00)
    3136                      .dwattr $C$DW$192, DW_AT_bit_size(0x0d)
    3137                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3138                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3139              
    3140              $C$DW$193       .dwtag  DW_TAG_member
    3141                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    3142                      .dwattr $C$DW$193, DW_AT_name("rsvd2")
    3143                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd2")
    3144                      .dwattr $C$DW$193, DW_AT_bit_offset(0x00)
    3145                      .dwattr $C$DW$193, DW_AT_bit_size(0x10)
    3146                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3147                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3148              
    3149                      .dwendtag $C$DW$T$49
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   62

    3150              
    3151              
    3152              $C$DW$T$50      .dwtag  DW_TAG_union_type
    3153                      .dwattr $C$DW$T$50, DW_AT_name("CLKSRCCTL3_REG")
    3154                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    3155              $C$DW$194       .dwtag  DW_TAG_member
    3156                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$27)
    3157                      .dwattr $C$DW$194, DW_AT_name("all")
    3158                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_all")
    3159                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3160                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3161              
    3162              $C$DW$195       .dwtag  DW_TAG_member
    3163                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$49)
    3164                      .dwattr $C$DW$195, DW_AT_name("bit")
    3165                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_bit")
    3166                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3167                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3168              
    3169                      .dwendtag $C$DW$T$50
    3170              
    3171              
    3172              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3173                      .dwattr $C$DW$T$52, DW_AT_name("CLK_CFG_REGS")
    3174                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x32)
    3175              $C$DW$196       .dwtag  DW_TAG_member
    3176                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$21)
    3177                      .dwattr $C$DW$196, DW_AT_name("rsvd1")
    3178                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rsvd1")
    3179                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3180                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3181              
    3182              $C$DW$197       .dwtag  DW_TAG_member
    3183                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$44)
    3184                      .dwattr $C$DW$197, DW_AT_name("CLKCFGLOCK1")
    3185                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    3186                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3187                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3188              
    3189              $C$DW$198       .dwtag  DW_TAG_member
    3190                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$51)
    3191                      .dwattr $C$DW$198, DW_AT_name("rsvd2")
    3192                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_rsvd2")
    3193                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3194                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3195              
    3196              $C$DW$199       .dwtag  DW_TAG_member
    3197                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$46)
    3198                      .dwattr $C$DW$199, DW_AT_name("CLKSRCCTL1")
    3199                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    3200                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3201                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3202              
    3203              $C$DW$200       .dwtag  DW_TAG_member
    3204                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$48)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   63

    3205                      .dwattr $C$DW$200, DW_AT_name("CLKSRCCTL2")
    3206                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3207                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3208                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3209              
    3210              $C$DW$201       .dwtag  DW_TAG_member
    3211                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$50)
    3212                      .dwattr $C$DW$201, DW_AT_name("CLKSRCCTL3")
    3213                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3214                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3215                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3216              
    3217              $C$DW$202       .dwtag  DW_TAG_member
    3218                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$168)
    3219                      .dwattr $C$DW$202, DW_AT_name("SYSPLLCTL1")
    3220                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    3221                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3222                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3223              
    3224              $C$DW$203       .dwtag  DW_TAG_member
    3225                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$51)
    3226                      .dwattr $C$DW$203, DW_AT_name("rsvd3")
    3227                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd3")
    3228                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3229                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3230              
    3231              $C$DW$204       .dwtag  DW_TAG_member
    3232                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$170)
    3233                      .dwattr $C$DW$204, DW_AT_name("SYSPLLMULT")
    3234                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3235                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3236                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3237              
    3238              $C$DW$205       .dwtag  DW_TAG_member
    3239                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$172)
    3240                      .dwattr $C$DW$205, DW_AT_name("SYSPLLSTS")
    3241                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_SYSPLLSTS")
    3242                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3243                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3244              
    3245              $C$DW$206       .dwtag  DW_TAG_member
    3246                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$38)
    3247                      .dwattr $C$DW$206, DW_AT_name("AUXPLLCTL1")
    3248                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    3249                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3250                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3251              
    3252              $C$DW$207       .dwtag  DW_TAG_member
    3253                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$51)
    3254                      .dwattr $C$DW$207, DW_AT_name("rsvd4")
    3255                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_rsvd4")
    3256                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3257                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3258              
    3259              $C$DW$208       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   64

    3260                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$40)
    3261                      .dwattr $C$DW$208, DW_AT_name("AUXPLLMULT")
    3262                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_AUXPLLMULT")
    3263                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3264                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3265              
    3266              $C$DW$209       .dwtag  DW_TAG_member
    3267                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$42)
    3268                      .dwattr $C$DW$209, DW_AT_name("AUXPLLSTS")
    3269                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_AUXPLLSTS")
    3270                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3271                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3272              
    3273              $C$DW$210       .dwtag  DW_TAG_member
    3274                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$166)
    3275                      .dwattr $C$DW$210, DW_AT_name("SYSCLKDIVSEL")
    3276                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    3277                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3278                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3279              
    3280              $C$DW$211       .dwtag  DW_TAG_member
    3281                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$36)
    3282                      .dwattr $C$DW$211, DW_AT_name("AUXCLKDIVSEL")
    3283                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    3284                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3285                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3286              
    3287              $C$DW$212       .dwtag  DW_TAG_member
    3288                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$156)
    3289                      .dwattr $C$DW$212, DW_AT_name("PERCLKDIVSEL")
    3290                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    3291                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3292                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3293              
    3294              $C$DW$213       .dwtag  DW_TAG_member
    3295                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$191)
    3296                      .dwattr $C$DW$213, DW_AT_name("XCLKOUTDIVSEL")
    3297                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    3298                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3299                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3300              
    3301              $C$DW$214       .dwtag  DW_TAG_member
    3302                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$21)
    3303                      .dwattr $C$DW$214, DW_AT_name("rsvd5")
    3304                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_rsvd5")
    3305                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3306                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3307              
    3308              $C$DW$215       .dwtag  DW_TAG_member
    3309                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$120)
    3310                      .dwattr $C$DW$215, DW_AT_name("LOSPCP")
    3311                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_LOSPCP")
    3312                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3313                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3314              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   65

    3315              $C$DW$216       .dwtag  DW_TAG_member
    3316                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$124)
    3317                      .dwattr $C$DW$216, DW_AT_name("MCDCR")
    3318                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_MCDCR")
    3319                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3320                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3321              
    3322              $C$DW$217       .dwtag  DW_TAG_member
    3323                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$189)
    3324                      .dwattr $C$DW$217, DW_AT_name("X1CNT")
    3325                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_X1CNT")
    3326                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3327                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3328              
    3329                      .dwendtag $C$DW$T$52
    3330              
    3331              $C$DW$218       .dwtag  DW_TAG_TI_far_type
    3332                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$52)
    3333              
    3334              $C$DW$T$230     .dwtag  DW_TAG_volatile_type
    3335                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$218)
    3336              
    3337              
    3338              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    3339                      .dwattr $C$DW$T$53, DW_AT_name("CPUSYSLOCK1_BITS")
    3340                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
    3341              $C$DW$219       .dwtag  DW_TAG_member
    3342                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    3343                      .dwattr $C$DW$219, DW_AT_name("HIBBOOTMODE")
    3344                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    3345                      .dwattr $C$DW$219, DW_AT_bit_offset(0x0f)
    3346                      .dwattr $C$DW$219, DW_AT_bit_size(0x01)
    3347                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3348                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3349              
    3350              $C$DW$220       .dwtag  DW_TAG_member
    3351                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    3352                      .dwattr $C$DW$220, DW_AT_name("IORESTOREADDR")
    3353                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_IORESTOREADDR")
    3354                      .dwattr $C$DW$220, DW_AT_bit_offset(0x0e)
    3355                      .dwattr $C$DW$220, DW_AT_bit_size(0x01)
    3356                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3357                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3358              
    3359              $C$DW$221       .dwtag  DW_TAG_member
    3360                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    3361                      .dwattr $C$DW$221, DW_AT_name("PIEVERRADDR")
    3362                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_PIEVERRADDR")
    3363                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0d)
    3364                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    3365                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3366                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3367              
    3368              $C$DW$222       .dwtag  DW_TAG_member
    3369                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:09:41 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   66

    3370                      .dwattr $C$DW$222, DW_AT_name("PCLKCR0")
    3371                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_PCLKCR0")
    3372                      .dwattr $C$DW$222, DW_AT_bit_offset(0x0c)
    3373                      .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    3374                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3375                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3376              
    3377              $C$DW$223       .dwtag  DW_TAG_member
    3378                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    3379                      .dwattr $C$DW$223, DW_AT_name("PCLKCR1")
    3380                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_PCLKCR1")
    3381                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0b)
    3382                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    3383                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3384                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3385              
    3386              $C$DW$224       .dwtag  DW_TAG_member
    3387                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    3388                      .dwattr $C$DW$224, DW_AT_name("PCLKCR2")
    3389                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_PCLKCR2")
    3390                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0a)
    3391                      .dwattr $C$DW$224, DW_AT_bit_size(0x01)
    3392                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3393                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3394              
    3395              $C$DW$225       .dwtag  DW_TAG_member
    3396                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    3397                      .dwattr $C$DW$225, DW_AT_name("PCLKCR3")
    3398                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_PCLKCR3")
    3399                      .dwattr $C$DW$225, DW_AT_bit_offset(0x09)
    3400                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
