TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Tue May 11 14:30:52 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../config.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Chiaming\CCSworkspace_V10\MonoMtrServo_377s\F2837x_RAM")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_SetupPinOptions")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GPIO_SetupPinOptions")

    1302                      .dwpsn  file "../config.c",line 359,column 2,is_stmt,isa 0
    1303 000001ed 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |359| 
    1304 000001ee 18CC          AND       *+XAR4[1],#0xfffe     ; [CPU_ALU] |359| 
         000001ef FFFE 
    1305                      .dwpsn  file "../config.c",line 360,column 2,is_stmt,isa 0
    1306 000001f0 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |360| 
    1307 000001f1 1ACC          OR        *+XAR4[1],#0x0002     ; [CPU_ALU] |360| 
         000001f2 0002 
    1308                      .dwpsn  file "../config.c",line 361,column 2,is_stmt,isa 0
    1309 000001f3 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |361| 
    1310 000001f4 1ACC          OR        *+XAR4[1],#0x0004     ; [CPU_ALU] |361| 
         000001f5 0004 
    1311                      .dwpsn  file "../config.c",line 362,column 2,is_stmt,isa 0
    1312 000001f6 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |362| 
    1313 000001f7 1ACC          OR        *+XAR4[1],#0x0008     ; [CPU_ALU] |362| 
         000001f8 0008 
    1314                      .dwpsn  file "../config.c",line 363,column 2,is_stmt,isa 0
    1315 000001f9 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |363| 
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   27

    1316 000001fa 18CC          AND       *+XAR4[1],#0xffef     ; [CPU_ALU] |363| 
         000001fb FFEF 
    1317                      .dwpsn  file "../config.c",line 365,column 2,is_stmt,isa 0
    1318 000001fc 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |365| 
    1319 000001fd CCE4          AND       AL,*+XAR4[4],#0xff80  ; [CPU_ALU] |365| 
         000001fe FF80 
    1320 000001ff 5003          ORB       AL,#0x03              ; [CPU_ALU] |365| 
    1321 00000200 96E4          MOV       *+XAR4[4],AL          ; [CPU_ALU] |365| 
    1322                      .dwpsn  file "../config.c",line 367,column 2,is_stmt,isa 0
    1323 00000201 020C          MOVB      ACC,#12               ; [CPU_ALU] |367| 
    1324 00000202 0742          ADDL      ACC,*-SP[2]           ; [CPU_ALU] |367| 
    1325 00000203 8AA9          MOVL      XAR4,ACC              ; [CPU_ALU] |367| 
    1326 00000204 18C4          AND       *+XAR4[0],#0xff00     ; [CPU_ALU] |367| 
         00000205 FF00 
    1327                      .dwpsn  file "../config.c",line 369,column 2,is_stmt,isa 0
    1328 00000206 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |369| 
    1329 00000207 1AC4          OR        *+XAR4[0],#0x0080     ; [CPU_ALU] |369| 
         00000208 0080 
    1330                      .dwpsn  file "../config.c",line 370,column 1,is_stmt,isa 0
    1331 00000209 FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
    1332                      .dwcfi  cfa_offset, -2
    1333              $C$DW$91        .dwtag  DW_TAG_TI_branch
    1334                      .dwattr $C$DW$91, DW_AT_low_pc(0x00)
    1335                      .dwattr $C$DW$91, DW_AT_TI_return
    1336              
    1337 0000020a 0006          LRETR     ; [CPU_ALU] 
    1338                      ; return occurs ; [] 
    1339                      .dwattr $C$DW$88, DW_AT_TI_end_file("../config.c")
    1340                      .dwattr $C$DW$88, DW_AT_TI_end_line(0x172)
    1341                      .dwattr $C$DW$88, DW_AT_TI_end_column(0x01)
    1342                      .dwendentry
    1343                      .dwendtag $C$DW$88
    1344              
    1345              ;**************************************************************
    1346              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1347              ;**************************************************************
    1348                      .global _GPIO_SetupPinOptions
    1349                      .global _GPIO_SetupPinMux
    1350                      .global _GPIO_WritePin
    1351                      .global _DisableDog
    1352                      .global _GPIO_EnableUnbondedIOPullups
    1353                      .global _InitSysPll
    1354                      .global _InitPeripheralClocks
    1355                      .global _AdcSetMode
    1356                      .global _F28x_usDelay
    1357                      .global _AnalogSubsysRegs
    1358                      .global _AdcaRegs
    1359                      .global _AdcbRegs
    1360                      .global _AdccRegs
    1361                      .global _AdcdRegs
    1362                      .global _CpuSysRegs
    1363                      .global _GpioCtrlRegs
    1364              
    1365              ;***************************************************************
    1366              ;* TYPE INFORMATION                                            *
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   28

    1367              ;***************************************************************
    1368              
    1369              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1370                      .dwattr $C$DW$T$20, DW_AT_name("ADCBURSTCTL_BITS")
    1371                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1372              $C$DW$92        .dwtag  DW_TAG_member
    1373                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1374                      .dwattr $C$DW$92, DW_AT_name("BURSTTRIGSEL")
    1375                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
    1376                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0a)
    1377                      .dwattr $C$DW$92, DW_AT_bit_size(0x06)
    1378                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1379                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1380              
    1381              $C$DW$93        .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1383                      .dwattr $C$DW$93, DW_AT_name("rsvd1")
    1384                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd1")
    1385                      .dwattr $C$DW$93, DW_AT_bit_offset(0x08)
    1386                      .dwattr $C$DW$93, DW_AT_bit_size(0x02)
    1387                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1388                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1389              
    1390              $C$DW$94        .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1392                      .dwattr $C$DW$94, DW_AT_name("BURSTSIZE")
    1393                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_BURSTSIZE")
    1394                      .dwattr $C$DW$94, DW_AT_bit_offset(0x04)
    1395                      .dwattr $C$DW$94, DW_AT_bit_size(0x04)
    1396                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1397                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1398              
    1399              $C$DW$95        .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1401                      .dwattr $C$DW$95, DW_AT_name("rsvd2")
    1402                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd2")
    1403                      .dwattr $C$DW$95, DW_AT_bit_offset(0x01)
    1404                      .dwattr $C$DW$95, DW_AT_bit_size(0x03)
    1405                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1406                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1407              
    1408              $C$DW$96        .dwtag  DW_TAG_member
    1409                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1410                      .dwattr $C$DW$96, DW_AT_name("BURSTEN")
    1411                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_BURSTEN")
    1412                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00)
    1413                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1414                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1415                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1416              
    1417                      .dwendtag $C$DW$T$20
    1418              
    1419              
    1420              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1421                      .dwattr $C$DW$T$21, DW_AT_name("ADCBURSTCTL_REG")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   29

    1422                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1423              $C$DW$97        .dwtag  DW_TAG_member
    1424                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1425                      .dwattr $C$DW$97, DW_AT_name("all")
    1426                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_all")
    1427                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1428                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1429              
    1430              $C$DW$98        .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    1432                      .dwattr $C$DW$98, DW_AT_name("bit")
    1433                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_bit")
    1434                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1435                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1436              
    1437                      .dwendtag $C$DW$T$21
    1438              
    1439              
    1440              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1441                      .dwattr $C$DW$T$22, DW_AT_name("ADCCOUNTER_BITS")
    1442                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1443              $C$DW$99        .dwtag  DW_TAG_member
    1444                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1445                      .dwattr $C$DW$99, DW_AT_name("FREECOUNT")
    1446                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_FREECOUNT")
    1447                      .dwattr $C$DW$99, DW_AT_bit_offset(0x04)
    1448                      .dwattr $C$DW$99, DW_AT_bit_size(0x0c)
    1449                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1450                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1451              
    1452              $C$DW$100       .dwtag  DW_TAG_member
    1453                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1454                      .dwattr $C$DW$100, DW_AT_name("rsvd1")
    1455                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd1")
    1456                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00)
    1457                      .dwattr $C$DW$100, DW_AT_bit_size(0x04)
    1458                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1459                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1460              
    1461                      .dwendtag $C$DW$T$22
    1462              
    1463              
    1464              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1465                      .dwattr $C$DW$T$23, DW_AT_name("ADCCOUNTER_REG")
    1466                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1467              $C$DW$101       .dwtag  DW_TAG_member
    1468                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1469                      .dwattr $C$DW$101, DW_AT_name("all")
    1470                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
    1471                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1472                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1473              
    1474              $C$DW$102       .dwtag  DW_TAG_member
    1475                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$22)
    1476                      .dwattr $C$DW$102, DW_AT_name("bit")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   30

    1477                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
    1478                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1479                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1480              
    1481                      .dwendtag $C$DW$T$23
    1482              
    1483              
    1484              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1485                      .dwattr $C$DW$T$24, DW_AT_name("ADCCTL1_BITS")
    1486                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1487              $C$DW$103       .dwtag  DW_TAG_member
    1488                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1489                      .dwattr $C$DW$103, DW_AT_name("rsvd1")
    1490                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd1")
    1491                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0e)
    1492                      .dwattr $C$DW$103, DW_AT_bit_size(0x02)
    1493                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1494                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1495              
    1496              $C$DW$104       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1498                      .dwattr $C$DW$104, DW_AT_name("INTPULSEPOS")
    1499                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_INTPULSEPOS")
    1500                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0d)
    1501                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1502                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1503                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1504              
    1505              $C$DW$105       .dwtag  DW_TAG_member
    1506                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1507                      .dwattr $C$DW$105, DW_AT_name("rsvd2")
    1508                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd2")
    1509                      .dwattr $C$DW$105, DW_AT_bit_offset(0x09)
    1510                      .dwattr $C$DW$105, DW_AT_bit_size(0x04)
    1511                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1512                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1513              
    1514              $C$DW$106       .dwtag  DW_TAG_member
    1515                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1516                      .dwattr $C$DW$106, DW_AT_name("ADCPWDNZ")
    1517                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_ADCPWDNZ")
    1518                      .dwattr $C$DW$106, DW_AT_bit_offset(0x08)
    1519                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1520                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1521                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1522              
    1523              $C$DW$107       .dwtag  DW_TAG_member
    1524                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1525                      .dwattr $C$DW$107, DW_AT_name("ADCBSYCHN")
    1526                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_ADCBSYCHN")
    1527                      .dwattr $C$DW$107, DW_AT_bit_offset(0x04)
    1528                      .dwattr $C$DW$107, DW_AT_bit_size(0x04)
    1529                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1530                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1531              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   31

    1532              $C$DW$108       .dwtag  DW_TAG_member
    1533                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1534                      .dwattr $C$DW$108, DW_AT_name("rsvd3")
    1535                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_rsvd3")
    1536                      .dwattr $C$DW$108, DW_AT_bit_offset(0x03)
    1537                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1538                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1539                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1540              
    1541              $C$DW$109       .dwtag  DW_TAG_member
    1542                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1543                      .dwattr $C$DW$109, DW_AT_name("ADCBSY")
    1544                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_ADCBSY")
    1545                      .dwattr $C$DW$109, DW_AT_bit_offset(0x02)
    1546                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1547                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1548                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1549              
    1550              $C$DW$110       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1552                      .dwattr $C$DW$110, DW_AT_name("rsvd4")
    1553                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd4")
    1554                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    1555                      .dwattr $C$DW$110, DW_AT_bit_size(0x02)
    1556                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1557                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1558              
    1559                      .dwendtag $C$DW$T$24
    1560              
    1561              
    1562              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1563                      .dwattr $C$DW$T$25, DW_AT_name("ADCCTL1_REG")
    1564                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1565              $C$DW$111       .dwtag  DW_TAG_member
    1566                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1567                      .dwattr $C$DW$111, DW_AT_name("all")
    1568                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    1569                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1570                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1571              
    1572              $C$DW$112       .dwtag  DW_TAG_member
    1573                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$24)
    1574                      .dwattr $C$DW$112, DW_AT_name("bit")
    1575                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
    1576                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1577                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1578              
    1579                      .dwendtag $C$DW$T$25
    1580              
    1581              
    1582              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1583                      .dwattr $C$DW$T$26, DW_AT_name("ADCCTL2_BITS")
    1584                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1585              $C$DW$113       .dwtag  DW_TAG_member
    1586                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   32

    1587                      .dwattr $C$DW$113, DW_AT_name("PRESCALE")
    1588                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_PRESCALE")
    1589                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0c)
    1590                      .dwattr $C$DW$113, DW_AT_bit_size(0x04)
    1591                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1592                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1593              
    1594              $C$DW$114       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1596                      .dwattr $C$DW$114, DW_AT_name("rsvd1")
    1597                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd1")
    1598                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0a)
    1599                      .dwattr $C$DW$114, DW_AT_bit_size(0x02)
    1600                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1601                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1602              
    1603              $C$DW$115       .dwtag  DW_TAG_member
    1604                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1605                      .dwattr $C$DW$115, DW_AT_name("RESOLUTION")
    1606                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_RESOLUTION")
    1607                      .dwattr $C$DW$115, DW_AT_bit_offset(0x09)
    1608                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1609                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1610                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1611              
    1612              $C$DW$116       .dwtag  DW_TAG_member
    1613                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1614                      .dwattr $C$DW$116, DW_AT_name("SIGNALMODE")
    1615                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_SIGNALMODE")
    1616                      .dwattr $C$DW$116, DW_AT_bit_offset(0x08)
    1617                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1618                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1619                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1620              
    1621              $C$DW$117       .dwtag  DW_TAG_member
    1622                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1623                      .dwattr $C$DW$117, DW_AT_name("rsvd2")
    1624                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd2")
    1625                      .dwattr $C$DW$117, DW_AT_bit_offset(0x03)
    1626                      .dwattr $C$DW$117, DW_AT_bit_size(0x05)
    1627                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1628                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1629              
    1630              $C$DW$118       .dwtag  DW_TAG_member
    1631                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1632                      .dwattr $C$DW$118, DW_AT_name("rsvd3")
    1633                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd3")
    1634                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    1635                      .dwattr $C$DW$118, DW_AT_bit_size(0x03)
    1636                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1637                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1638              
    1639                      .dwendtag $C$DW$T$26
    1640              
    1641              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   33

    1642              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1643                      .dwattr $C$DW$T$27, DW_AT_name("ADCCTL2_REG")
    1644                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1645              $C$DW$119       .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1647                      .dwattr $C$DW$119, DW_AT_name("all")
    1648                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_all")
    1649                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1650                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1651              
    1652              $C$DW$120       .dwtag  DW_TAG_member
    1653                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$26)
    1654                      .dwattr $C$DW$120, DW_AT_name("bit")
    1655                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_bit")
    1656                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1657                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1658              
    1659                      .dwendtag $C$DW$T$27
    1660              
    1661              
    1662              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1663                      .dwattr $C$DW$T$28, DW_AT_name("ADCEVTCLR_BITS")
    1664                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1665              $C$DW$121       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1667                      .dwattr $C$DW$121, DW_AT_name("PPB1TRIPHI")
    1668                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1669                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0f)
    1670                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1671                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1673              
    1674              $C$DW$122       .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1676                      .dwattr $C$DW$122, DW_AT_name("PPB1TRIPLO")
    1677                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1678                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0e)
    1679                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1680                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1681                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1682              
    1683              $C$DW$123       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1685                      .dwattr $C$DW$123, DW_AT_name("PPB1ZERO")
    1686                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_PPB1ZERO")
    1687                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0d)
    1688                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1689                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1690                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1691              
    1692              $C$DW$124       .dwtag  DW_TAG_member
    1693                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1694                      .dwattr $C$DW$124, DW_AT_name("rsvd1")
    1695                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd1")
    1696                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   34

    1697                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1698                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1699                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1700              
    1701              $C$DW$125       .dwtag  DW_TAG_member
    1702                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1703                      .dwattr $C$DW$125, DW_AT_name("PPB2TRIPHI")
    1704                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1705                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0b)
    1706                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1707                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1708                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1709              
    1710              $C$DW$126       .dwtag  DW_TAG_member
    1711                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1712                      .dwattr $C$DW$126, DW_AT_name("PPB2TRIPLO")
    1713                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1714                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0a)
    1715                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1716                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1717                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1718              
    1719              $C$DW$127       .dwtag  DW_TAG_member
    1720                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1721                      .dwattr $C$DW$127, DW_AT_name("PPB2ZERO")
    1722                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_PPB2ZERO")
    1723                      .dwattr $C$DW$127, DW_AT_bit_offset(0x09)
    1724                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1725                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1726                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1727              
    1728              $C$DW$128       .dwtag  DW_TAG_member
    1729                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1730                      .dwattr $C$DW$128, DW_AT_name("rsvd2")
    1731                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd2")
    1732                      .dwattr $C$DW$128, DW_AT_bit_offset(0x08)
    1733                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1734                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1735                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1736              
    1737              $C$DW$129       .dwtag  DW_TAG_member
    1738                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1739                      .dwattr $C$DW$129, DW_AT_name("PPB3TRIPHI")
    1740                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1741                      .dwattr $C$DW$129, DW_AT_bit_offset(0x07)
    1742                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1743                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1744                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1745              
    1746              $C$DW$130       .dwtag  DW_TAG_member
    1747                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1748                      .dwattr $C$DW$130, DW_AT_name("PPB3TRIPLO")
    1749                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1750                      .dwattr $C$DW$130, DW_AT_bit_offset(0x06)
    1751                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   35

    1752                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1753                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1754              
    1755              $C$DW$131       .dwtag  DW_TAG_member
    1756                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1757                      .dwattr $C$DW$131, DW_AT_name("PPB3ZERO")
    1758                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_PPB3ZERO")
    1759                      .dwattr $C$DW$131, DW_AT_bit_offset(0x05)
    1760                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1761                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1762                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1763              
    1764              $C$DW$132       .dwtag  DW_TAG_member
    1765                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1766                      .dwattr $C$DW$132, DW_AT_name("rsvd3")
    1767                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd3")
    1768                      .dwattr $C$DW$132, DW_AT_bit_offset(0x04)
    1769                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1770                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1771                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1772              
    1773              $C$DW$133       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1775                      .dwattr $C$DW$133, DW_AT_name("PPB4TRIPHI")
    1776                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1777                      .dwattr $C$DW$133, DW_AT_bit_offset(0x03)
    1778                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1779                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1780                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1781              
    1782              $C$DW$134       .dwtag  DW_TAG_member
    1783                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1784                      .dwattr $C$DW$134, DW_AT_name("PPB4TRIPLO")
    1785                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1786                      .dwattr $C$DW$134, DW_AT_bit_offset(0x02)
    1787                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1788                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1789                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1790              
    1791              $C$DW$135       .dwtag  DW_TAG_member
    1792                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1793                      .dwattr $C$DW$135, DW_AT_name("PPB4ZERO")
    1794                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_PPB4ZERO")
    1795                      .dwattr $C$DW$135, DW_AT_bit_offset(0x01)
    1796                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1797                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1798                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1799              
    1800              $C$DW$136       .dwtag  DW_TAG_member
    1801                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1802                      .dwattr $C$DW$136, DW_AT_name("rsvd4")
    1803                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd4")
    1804                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00)
    1805                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1806                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   36

    1807                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1808              
    1809                      .dwendtag $C$DW$T$28
    1810              
    1811              
    1812              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1813                      .dwattr $C$DW$T$29, DW_AT_name("ADCEVTCLR_REG")
    1814                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1815              $C$DW$137       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1817                      .dwattr $C$DW$137, DW_AT_name("all")
    1818                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_all")
    1819                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1820                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1821              
    1822              $C$DW$138       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$28)
    1824                      .dwattr $C$DW$138, DW_AT_name("bit")
    1825                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_bit")
    1826                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1827                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1828              
    1829                      .dwendtag $C$DW$T$29
    1830              
    1831              
    1832              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1833                      .dwattr $C$DW$T$30, DW_AT_name("ADCEVTINTSEL_BITS")
    1834                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1835              $C$DW$139       .dwtag  DW_TAG_member
    1836                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1837                      .dwattr $C$DW$139, DW_AT_name("PPB1TRIPHI")
    1838                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1839                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0f)
    1840                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1841                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1842                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1843              
    1844              $C$DW$140       .dwtag  DW_TAG_member
    1845                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1846                      .dwattr $C$DW$140, DW_AT_name("PPB1TRIPLO")
    1847                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1848                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0e)
    1849                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1850                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1851                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1852              
    1853              $C$DW$141       .dwtag  DW_TAG_member
    1854                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1855                      .dwattr $C$DW$141, DW_AT_name("PPB1ZERO")
    1856                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_PPB1ZERO")
    1857                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0d)
    1858                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1859                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1860                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1861              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   37

    1862              $C$DW$142       .dwtag  DW_TAG_member
    1863                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1864                      .dwattr $C$DW$142, DW_AT_name("rsvd1")
    1865                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd1")
    1866                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0c)
    1867                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1868                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1869                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1870              
    1871              $C$DW$143       .dwtag  DW_TAG_member
    1872                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1873                      .dwattr $C$DW$143, DW_AT_name("PPB2TRIPHI")
    1874                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1875                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0b)
    1876                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1877                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1878                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1879              
    1880              $C$DW$144       .dwtag  DW_TAG_member
    1881                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1882                      .dwattr $C$DW$144, DW_AT_name("PPB2TRIPLO")
    1883                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1884                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0a)
    1885                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1886                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1887                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1888              
    1889              $C$DW$145       .dwtag  DW_TAG_member
    1890                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1891                      .dwattr $C$DW$145, DW_AT_name("PPB2ZERO")
    1892                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PPB2ZERO")
    1893                      .dwattr $C$DW$145, DW_AT_bit_offset(0x09)
    1894                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1895                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1896                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1897              
    1898              $C$DW$146       .dwtag  DW_TAG_member
    1899                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1900                      .dwattr $C$DW$146, DW_AT_name("rsvd2")
    1901                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd2")
    1902                      .dwattr $C$DW$146, DW_AT_bit_offset(0x08)
    1903                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1904                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1905                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1906              
    1907              $C$DW$147       .dwtag  DW_TAG_member
    1908                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1909                      .dwattr $C$DW$147, DW_AT_name("PPB3TRIPHI")
    1910                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1911                      .dwattr $C$DW$147, DW_AT_bit_offset(0x07)
    1912                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1913                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1914                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1915              
    1916              $C$DW$148       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   38

    1917                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1918                      .dwattr $C$DW$148, DW_AT_name("PPB3TRIPLO")
    1919                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1920                      .dwattr $C$DW$148, DW_AT_bit_offset(0x06)
    1921                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1922                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1923                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1924              
    1925              $C$DW$149       .dwtag  DW_TAG_member
    1926                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1927                      .dwattr $C$DW$149, DW_AT_name("PPB3ZERO")
    1928                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_PPB3ZERO")
    1929                      .dwattr $C$DW$149, DW_AT_bit_offset(0x05)
    1930                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1931                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1932                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1933              
    1934              $C$DW$150       .dwtag  DW_TAG_member
    1935                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1936                      .dwattr $C$DW$150, DW_AT_name("rsvd3")
    1937                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd3")
    1938                      .dwattr $C$DW$150, DW_AT_bit_offset(0x04)
    1939                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1940                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1941                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1942              
    1943              $C$DW$151       .dwtag  DW_TAG_member
    1944                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1945                      .dwattr $C$DW$151, DW_AT_name("PPB4TRIPHI")
    1946                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1947                      .dwattr $C$DW$151, DW_AT_bit_offset(0x03)
    1948                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1949                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1950                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1951              
    1952              $C$DW$152       .dwtag  DW_TAG_member
    1953                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1954                      .dwattr $C$DW$152, DW_AT_name("PPB4TRIPLO")
    1955                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1956                      .dwattr $C$DW$152, DW_AT_bit_offset(0x02)
    1957                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1958                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1959                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1960              
    1961              $C$DW$153       .dwtag  DW_TAG_member
    1962                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1963                      .dwattr $C$DW$153, DW_AT_name("PPB4ZERO")
    1964                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_PPB4ZERO")
    1965                      .dwattr $C$DW$153, DW_AT_bit_offset(0x01)
    1966                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1967                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1968                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1969              
    1970              $C$DW$154       .dwtag  DW_TAG_member
    1971                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   39

    1972                      .dwattr $C$DW$154, DW_AT_name("rsvd4")
    1973                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd4")
    1974                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00)
    1975                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1976                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1977                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1978              
    1979                      .dwendtag $C$DW$T$30
    1980              
    1981              
    1982              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1983                      .dwattr $C$DW$T$31, DW_AT_name("ADCEVTINTSEL_REG")
    1984                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1985              $C$DW$155       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1987                      .dwattr $C$DW$155, DW_AT_name("all")
    1988                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_all")
    1989                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1990                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1991              
    1992              $C$DW$156       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$30)
    1994                      .dwattr $C$DW$156, DW_AT_name("bit")
    1995                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_bit")
    1996                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1997                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1998              
    1999                      .dwendtag $C$DW$T$31
    2000              
    2001              
    2002              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2003                      .dwattr $C$DW$T$32, DW_AT_name("ADCEVTSEL_BITS")
    2004                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2005              $C$DW$157       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2007                      .dwattr $C$DW$157, DW_AT_name("PPB1TRIPHI")
    2008                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2009                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0f)
    2010                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2011                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2012                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2013              
    2014              $C$DW$158       .dwtag  DW_TAG_member
    2015                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2016                      .dwattr $C$DW$158, DW_AT_name("PPB1TRIPLO")
    2017                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    2018                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0e)
    2019                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2020                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2021                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2022              
    2023              $C$DW$159       .dwtag  DW_TAG_member
    2024                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2025                      .dwattr $C$DW$159, DW_AT_name("PPB1ZERO")
    2026                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PPB1ZERO")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   40

    2027                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0d)
    2028                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2029                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2030                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2031              
    2032              $C$DW$160       .dwtag  DW_TAG_member
    2033                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2034                      .dwattr $C$DW$160, DW_AT_name("rsvd1")
    2035                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd1")
    2036                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0c)
    2037                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2038                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2039                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2040              
    2041              $C$DW$161       .dwtag  DW_TAG_member
    2042                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2043                      .dwattr $C$DW$161, DW_AT_name("PPB2TRIPHI")
    2044                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    2045                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0b)
    2046                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2047                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2048                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2049              
    2050              $C$DW$162       .dwtag  DW_TAG_member
    2051                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2052                      .dwattr $C$DW$162, DW_AT_name("PPB2TRIPLO")
    2053                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2054                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0a)
    2055                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2056                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2057                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2058              
    2059              $C$DW$163       .dwtag  DW_TAG_member
    2060                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2061                      .dwattr $C$DW$163, DW_AT_name("PPB2ZERO")
    2062                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_PPB2ZERO")
    2063                      .dwattr $C$DW$163, DW_AT_bit_offset(0x09)
    2064                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2065                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2066                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2067              
    2068              $C$DW$164       .dwtag  DW_TAG_member
    2069                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2070                      .dwattr $C$DW$164, DW_AT_name("rsvd2")
    2071                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd2")
    2072                      .dwattr $C$DW$164, DW_AT_bit_offset(0x08)
    2073                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2074                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2075                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2076              
    2077              $C$DW$165       .dwtag  DW_TAG_member
    2078                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2079                      .dwattr $C$DW$165, DW_AT_name("PPB3TRIPHI")
    2080                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2081                      .dwattr $C$DW$165, DW_AT_bit_offset(0x07)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   41

    2082                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2083                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2084                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2085              
    2086              $C$DW$166       .dwtag  DW_TAG_member
    2087                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2088                      .dwattr $C$DW$166, DW_AT_name("PPB3TRIPLO")
    2089                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2090                      .dwattr $C$DW$166, DW_AT_bit_offset(0x06)
    2091                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2092                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2093                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2094              
    2095              $C$DW$167       .dwtag  DW_TAG_member
    2096                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2097                      .dwattr $C$DW$167, DW_AT_name("PPB3ZERO")
    2098                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PPB3ZERO")
    2099                      .dwattr $C$DW$167, DW_AT_bit_offset(0x05)
    2100                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2101                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2102                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2103              
    2104              $C$DW$168       .dwtag  DW_TAG_member
    2105                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2106                      .dwattr $C$DW$168, DW_AT_name("rsvd3")
    2107                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd3")
    2108                      .dwattr $C$DW$168, DW_AT_bit_offset(0x04)
    2109                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2110                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2111                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2112              
    2113              $C$DW$169       .dwtag  DW_TAG_member
    2114                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2115                      .dwattr $C$DW$169, DW_AT_name("PPB4TRIPHI")
    2116                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2117                      .dwattr $C$DW$169, DW_AT_bit_offset(0x03)
    2118                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2119                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2120                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2121              
    2122              $C$DW$170       .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2124                      .dwattr $C$DW$170, DW_AT_name("PPB4TRIPLO")
    2125                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2126                      .dwattr $C$DW$170, DW_AT_bit_offset(0x02)
    2127                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2128                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2129                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2130              
    2131              $C$DW$171       .dwtag  DW_TAG_member
    2132                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2133                      .dwattr $C$DW$171, DW_AT_name("PPB4ZERO")
    2134                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PPB4ZERO")
    2135                      .dwattr $C$DW$171, DW_AT_bit_offset(0x01)
    2136                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   42

    2137                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2138                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2139              
    2140              $C$DW$172       .dwtag  DW_TAG_member
    2141                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2142                      .dwattr $C$DW$172, DW_AT_name("rsvd4")
    2143                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd4")
    2144                      .dwattr $C$DW$172, DW_AT_bit_offset(0x00)
    2145                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2146                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2147                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2148              
    2149                      .dwendtag $C$DW$T$32
    2150              
    2151              
    2152              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2153                      .dwattr $C$DW$T$33, DW_AT_name("ADCEVTSEL_REG")
    2154                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2155              $C$DW$173       .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2157                      .dwattr $C$DW$173, DW_AT_name("all")
    2158                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_all")
    2159                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2160                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2161              
    2162              $C$DW$174       .dwtag  DW_TAG_member
    2163                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$32)
    2164                      .dwattr $C$DW$174, DW_AT_name("bit")
    2165                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_bit")
    2166                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2167                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2168              
    2169                      .dwendtag $C$DW$T$33
    2170              
    2171              
    2172              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2173                      .dwattr $C$DW$T$34, DW_AT_name("ADCEVTSTAT_BITS")
    2174                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2175              $C$DW$175       .dwtag  DW_TAG_member
    2176                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2177                      .dwattr $C$DW$175, DW_AT_name("PPB1TRIPHI")
    2178                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2179                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0f)
    2180                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2181                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2182                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2183              
    2184              $C$DW$176       .dwtag  DW_TAG_member
    2185                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2186                      .dwattr $C$DW$176, DW_AT_name("PPB1TRIPLO")
    2187                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    2188                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0e)
    2189                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2190                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2191                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   43

    2192              
    2193              $C$DW$177       .dwtag  DW_TAG_member
    2194                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2195                      .dwattr $C$DW$177, DW_AT_name("PPB1ZERO")
    2196                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_PPB1ZERO")
    2197                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0d)
    2198                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2199                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2200                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2201              
    2202              $C$DW$178       .dwtag  DW_TAG_member
    2203                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2204                      .dwattr $C$DW$178, DW_AT_name("rsvd1")
    2205                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd1")
    2206                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0c)
    2207                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    2208                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2209                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2210              
    2211              $C$DW$179       .dwtag  DW_TAG_member
    2212                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2213                      .dwattr $C$DW$179, DW_AT_name("PPB2TRIPHI")
    2214                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    2215                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0b)
    2216                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2217                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2218                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2219              
    2220              $C$DW$180       .dwtag  DW_TAG_member
    2221                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2222                      .dwattr $C$DW$180, DW_AT_name("PPB2TRIPLO")
    2223                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2224                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0a)
    2225                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2226                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2227                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2228              
    2229              $C$DW$181       .dwtag  DW_TAG_member
    2230                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2231                      .dwattr $C$DW$181, DW_AT_name("PPB2ZERO")
    2232                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_PPB2ZERO")
    2233                      .dwattr $C$DW$181, DW_AT_bit_offset(0x09)
    2234                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    2235                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2236                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2237              
    2238              $C$DW$182       .dwtag  DW_TAG_member
    2239                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2240                      .dwattr $C$DW$182, DW_AT_name("rsvd2")
    2241                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd2")
    2242                      .dwattr $C$DW$182, DW_AT_bit_offset(0x08)
    2243                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    2244                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2245                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2246              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   44

    2247              $C$DW$183       .dwtag  DW_TAG_member
    2248                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2249                      .dwattr $C$DW$183, DW_AT_name("PPB3TRIPHI")
    2250                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2251                      .dwattr $C$DW$183, DW_AT_bit_offset(0x07)
    2252                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    2253                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2254                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2255              
    2256              $C$DW$184       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2258                      .dwattr $C$DW$184, DW_AT_name("PPB3TRIPLO")
    2259                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2260                      .dwattr $C$DW$184, DW_AT_bit_offset(0x06)
    2261                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    2262                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2263                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2264              
    2265              $C$DW$185       .dwtag  DW_TAG_member
    2266                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2267                      .dwattr $C$DW$185, DW_AT_name("PPB3ZERO")
    2268                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_PPB3ZERO")
    2269                      .dwattr $C$DW$185, DW_AT_bit_offset(0x05)
    2270                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2271                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2272                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2273              
    2274              $C$DW$186       .dwtag  DW_TAG_member
    2275                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2276                      .dwattr $C$DW$186, DW_AT_name("rsvd3")
    2277                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd3")
    2278                      .dwattr $C$DW$186, DW_AT_bit_offset(0x04)
    2279                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2280                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2281                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2282              
    2283              $C$DW$187       .dwtag  DW_TAG_member
    2284                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2285                      .dwattr $C$DW$187, DW_AT_name("PPB4TRIPHI")
    2286                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2287                      .dwattr $C$DW$187, DW_AT_bit_offset(0x03)
    2288                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    2289                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2290                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2291              
    2292              $C$DW$188       .dwtag  DW_TAG_member
    2293                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2294                      .dwattr $C$DW$188, DW_AT_name("PPB4TRIPLO")
    2295                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2296                      .dwattr $C$DW$188, DW_AT_bit_offset(0x02)
    2297                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2298                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2299                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2300              
    2301              $C$DW$189       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   45

    2302                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2303                      .dwattr $C$DW$189, DW_AT_name("PPB4ZERO")
    2304                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_PPB4ZERO")
    2305                      .dwattr $C$DW$189, DW_AT_bit_offset(0x01)
    2306                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2307                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2308                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2309              
    2310              $C$DW$190       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2312                      .dwattr $C$DW$190, DW_AT_name("rsvd4")
    2313                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_rsvd4")
    2314                      .dwattr $C$DW$190, DW_AT_bit_offset(0x00)
    2315                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2316                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2317                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2318              
    2319                      .dwendtag $C$DW$T$34
    2320              
    2321              
    2322              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2323                      .dwattr $C$DW$T$35, DW_AT_name("ADCEVTSTAT_REG")
    2324                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2325              $C$DW$191       .dwtag  DW_TAG_member
    2326                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2327                      .dwattr $C$DW$191, DW_AT_name("all")
    2328                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_all")
    2329                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2330                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2331              
    2332              $C$DW$192       .dwtag  DW_TAG_member
    2333                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$34)
    2334                      .dwattr $C$DW$192, DW_AT_name("bit")
    2335                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_bit")
    2336                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2337                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2338              
    2339                      .dwendtag $C$DW$T$35
    2340              
    2341              
    2342              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2343                      .dwattr $C$DW$T$36, DW_AT_name("ADCINTFLGCLR_BITS")
    2344                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2345              $C$DW$193       .dwtag  DW_TAG_member
    2346                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2347                      .dwattr $C$DW$193, DW_AT_name("ADCINT1")
    2348                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_ADCINT1")
    2349                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0f)
    2350                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2351                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2352                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2353              
    2354              $C$DW$194       .dwtag  DW_TAG_member
    2355                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2356                      .dwattr $C$DW$194, DW_AT_name("ADCINT2")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   46

    2357                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_ADCINT2")
    2358                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0e)
    2359                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2360                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2361                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2362              
    2363              $C$DW$195       .dwtag  DW_TAG_member
    2364                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2365                      .dwattr $C$DW$195, DW_AT_name("ADCINT3")
    2366                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_ADCINT3")
    2367                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0d)
    2368                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2369                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2370                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2371              
    2372              $C$DW$196       .dwtag  DW_TAG_member
    2373                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2374                      .dwattr $C$DW$196, DW_AT_name("ADCINT4")
    2375                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_ADCINT4")
    2376                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0c)
    2377                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    2378                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2379                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2380              
    2381              $C$DW$197       .dwtag  DW_TAG_member
    2382                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2383                      .dwattr $C$DW$197, DW_AT_name("rsvd1")
    2384                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_rsvd1")
    2385                      .dwattr $C$DW$197, DW_AT_bit_offset(0x00)
    2386                      .dwattr $C$DW$197, DW_AT_bit_size(0x0c)
    2387                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2388                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2389              
    2390                      .dwendtag $C$DW$T$36
    2391              
    2392              
    2393              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2394                      .dwattr $C$DW$T$37, DW_AT_name("ADCINTFLGCLR_REG")
    2395                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2396              $C$DW$198       .dwtag  DW_TAG_member
    2397                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2398                      .dwattr $C$DW$198, DW_AT_name("all")
    2399                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_all")
    2400                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2401                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2402              
    2403              $C$DW$199       .dwtag  DW_TAG_member
    2404                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$36)
    2405                      .dwattr $C$DW$199, DW_AT_name("bit")
    2406                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_bit")
    2407                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2408                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2409              
    2410                      .dwendtag $C$DW$T$37
    2411              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   47

    2412              
    2413              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2414                      .dwattr $C$DW$T$38, DW_AT_name("ADCINTFLG_BITS")
    2415                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2416              $C$DW$200       .dwtag  DW_TAG_member
    2417                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2418                      .dwattr $C$DW$200, DW_AT_name("ADCINT1")
    2419                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_ADCINT1")
    2420                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0f)
    2421                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2422                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2423                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2424              
    2425              $C$DW$201       .dwtag  DW_TAG_member
    2426                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2427                      .dwattr $C$DW$201, DW_AT_name("ADCINT2")
    2428                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_ADCINT2")
    2429                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0e)
    2430                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    2431                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2432                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2433              
    2434              $C$DW$202       .dwtag  DW_TAG_member
    2435                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2436                      .dwattr $C$DW$202, DW_AT_name("ADCINT3")
    2437                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_ADCINT3")
    2438                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0d)
    2439                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2440                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2441                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2442              
    2443              $C$DW$203       .dwtag  DW_TAG_member
    2444                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2445                      .dwattr $C$DW$203, DW_AT_name("ADCINT4")
    2446                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_ADCINT4")
    2447                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0c)
    2448                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2449                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2450                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2451              
    2452              $C$DW$204       .dwtag  DW_TAG_member
    2453                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2454                      .dwattr $C$DW$204, DW_AT_name("rsvd1")
    2455                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd1")
    2456                      .dwattr $C$DW$204, DW_AT_bit_offset(0x00)
    2457                      .dwattr $C$DW$204, DW_AT_bit_size(0x0c)
    2458                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2459                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2460              
    2461                      .dwendtag $C$DW$T$38
    2462              
    2463              
    2464              $C$DW$T$39      .dwtag  DW_TAG_union_type
    2465                      .dwattr $C$DW$T$39, DW_AT_name("ADCINTFLG_REG")
    2466                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   48

    2467              $C$DW$205       .dwtag  DW_TAG_member
    2468                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2469                      .dwattr $C$DW$205, DW_AT_name("all")
    2470                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_all")
    2471                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2472                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2473              
    2474              $C$DW$206       .dwtag  DW_TAG_member
    2475                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$38)
    2476                      .dwattr $C$DW$206, DW_AT_name("bit")
    2477                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_bit")
    2478                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2479                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2480              
    2481                      .dwendtag $C$DW$T$39
    2482              
    2483              
    2484              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2485                      .dwattr $C$DW$T$40, DW_AT_name("ADCINTOVFCLR_BITS")
    2486                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2487              $C$DW$207       .dwtag  DW_TAG_member
    2488                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2489                      .dwattr $C$DW$207, DW_AT_name("ADCINT1")
    2490                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_ADCINT1")
    2491                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0f)
    2492                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2493                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2494                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2495              
    2496              $C$DW$208       .dwtag  DW_TAG_member
    2497                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2498                      .dwattr $C$DW$208, DW_AT_name("ADCINT2")
    2499                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_ADCINT2")
    2500                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0e)
    2501                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    2502                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2503                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2504              
    2505              $C$DW$209       .dwtag  DW_TAG_member
    2506                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2507                      .dwattr $C$DW$209, DW_AT_name("ADCINT3")
    2508                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_ADCINT3")
    2509                      .dwattr $C$DW$209, DW_AT_bit_offset(0x0d)
    2510                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    2511                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2512                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2513              
    2514              $C$DW$210       .dwtag  DW_TAG_member
    2515                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2516                      .dwattr $C$DW$210, DW_AT_name("ADCINT4")
    2517                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_ADCINT4")
    2518                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0c)
    2519                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2520                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2521                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   49

    2522              
    2523              $C$DW$211       .dwtag  DW_TAG_member
    2524                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2525                      .dwattr $C$DW$211, DW_AT_name("rsvd1")
    2526                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd1")
    2527                      .dwattr $C$DW$211, DW_AT_bit_offset(0x00)
    2528                      .dwattr $C$DW$211, DW_AT_bit_size(0x0c)
    2529                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2530                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2531              
    2532                      .dwendtag $C$DW$T$40
    2533              
    2534              
    2535              $C$DW$T$41      .dwtag  DW_TAG_union_type
    2536                      .dwattr $C$DW$T$41, DW_AT_name("ADCINTOVFCLR_REG")
    2537                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2538              $C$DW$212       .dwtag  DW_TAG_member
    2539                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2540                      .dwattr $C$DW$212, DW_AT_name("all")
    2541                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_all")
    2542                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2543                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2544              
    2545              $C$DW$213       .dwtag  DW_TAG_member
    2546                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$40)
    2547                      .dwattr $C$DW$213, DW_AT_name("bit")
    2548                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_bit")
    2549                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2550                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2551              
    2552                      .dwendtag $C$DW$T$41
    2553              
    2554              
    2555              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2556                      .dwattr $C$DW$T$42, DW_AT_name("ADCINTOVF_BITS")
    2557                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2558              $C$DW$214       .dwtag  DW_TAG_member
    2559                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2560                      .dwattr $C$DW$214, DW_AT_name("ADCINT1")
    2561                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_ADCINT1")
    2562                      .dwattr $C$DW$214, DW_AT_bit_offset(0x0f)
    2563                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    2564                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2565                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2566              
    2567              $C$DW$215       .dwtag  DW_TAG_member
    2568                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2569                      .dwattr $C$DW$215, DW_AT_name("ADCINT2")
    2570                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_ADCINT2")
    2571                      .dwattr $C$DW$215, DW_AT_bit_offset(0x0e)
    2572                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    2573                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2574                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2575              
    2576              $C$DW$216       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   50

    2577                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2578                      .dwattr $C$DW$216, DW_AT_name("ADCINT3")
    2579                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_ADCINT3")
    2580                      .dwattr $C$DW$216, DW_AT_bit_offset(0x0d)
    2581                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    2582                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2583                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2584              
    2585              $C$DW$217       .dwtag  DW_TAG_member
    2586                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2587                      .dwattr $C$DW$217, DW_AT_name("ADCINT4")
    2588                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_ADCINT4")
    2589                      .dwattr $C$DW$217, DW_AT_bit_offset(0x0c)
    2590                      .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    2591                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2592                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2593              
    2594              $C$DW$218       .dwtag  DW_TAG_member
    2595                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2596                      .dwattr $C$DW$218, DW_AT_name("rsvd1")
    2597                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_rsvd1")
    2598                      .dwattr $C$DW$218, DW_AT_bit_offset(0x00)
    2599                      .dwattr $C$DW$218, DW_AT_bit_size(0x0c)
    2600                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2601                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2602              
    2603                      .dwendtag $C$DW$T$42
    2604              
    2605              
    2606              $C$DW$T$43      .dwtag  DW_TAG_union_type
    2607                      .dwattr $C$DW$T$43, DW_AT_name("ADCINTOVF_REG")
    2608                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    2609              $C$DW$219       .dwtag  DW_TAG_member
    2610                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2611                      .dwattr $C$DW$219, DW_AT_name("all")
    2612                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_all")
    2613                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2614                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2615              
    2616              $C$DW$220       .dwtag  DW_TAG_member
    2617                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$42)
    2618                      .dwattr $C$DW$220, DW_AT_name("bit")
    2619                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_bit")
    2620                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2621                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2622              
    2623                      .dwendtag $C$DW$T$43
    2624              
    2625              
    2626              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2627                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTSEL1N2_BITS")
    2628                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    2629              $C$DW$221       .dwtag  DW_TAG_member
    2630                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2631                      .dwattr $C$DW$221, DW_AT_name("INT1SEL")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   51

    2632                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_INT1SEL")
    2633                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0c)
    2634                      .dwattr $C$DW$221, DW_AT_bit_size(0x04)
    2635                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2636                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2637              
    2638              $C$DW$222       .dwtag  DW_TAG_member
    2639                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2640                      .dwattr $C$DW$222, DW_AT_name("rsvd1")
