TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Tue May 11 14:30:53 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drv8305.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Chiaming\CCSworkspace_V10\MonoMtrServo_377s\F2837x_RAM")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DRV8305_SPI_Write")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DRV8305_SPI_Write")

     951              $C$DW$41        .dwtag  DW_TAG_TI_branch
     952                      .dwattr $C$DW$41, DW_AT_low_pc(0x00)
     953                      .dwattr $C$DW$41, DW_AT_name("_DRV8305_SPI_Read")
     954                      .dwattr $C$DW$41, DW_AT_TI_call
     955              
     956 00000296 7640!         LCR       #_DRV8305_SPI_Read    ; [CPU_ALU] |159| 
         00000297 0000 
     957                      ; call occurs [#_DRV8305_SPI_Read] ; [] |159| 
     958 00000298 CCA9          AND       AL,AL,#0x0777         ; [CPU_ALU] |159| 
         00000299 0777 
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   21

     959 0000029a 8F00          MOVL      XAR4,#962             ; [CPU_ARAU] |159| 
         0000029b 03C2 
     960 0000029c 88A9          MOVZ      AR6,AL                ; [CPU_ALU] |159| 
     961 0000029d A8A9          MOVL      ACC,XAR4              ; [CPU_ALU] |159| 
     962 0000029e 0742          ADDL      ACC,*-SP[2]           ; [CPU_ALU] |159| 
     963 0000029f 8AA9          MOVL      XAR4,ACC              ; [CPU_ALU] |159| 
     964 000002a0 7EC4          MOV       *+XAR4[0],AR6         ; [CPU_ALU] |159| 
     965                      .dwpsn  file "../drv8305.c",line 160,column 2,is_stmt,isa 0
     966 000002a1 9A04          MOVB      AL,#4                 ; [CPU_ALU] |160| 
     967 000002a2 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_ALU] |160| 
     968              $C$DW$42        .dwtag  DW_TAG_TI_branch
     969                      .dwattr $C$DW$42, DW_AT_low_pc(0x00)
     970                      .dwattr $C$DW$42, DW_AT_name("_DRV8305_SPI_Read")
     971                      .dwattr $C$DW$42, DW_AT_TI_call
     972              
     973 000002a3 7640!         LCR       #_DRV8305_SPI_Read    ; [CPU_ALU] |160| 
         000002a4 0000 
     974                      ; call occurs [#_DRV8305_SPI_Read] ; [] |160| 
     975 000002a5 CCA9          AND       AL,AL,#0x07e0         ; [CPU_ALU] |160| 
         000002a6 07E0 
     976 000002a7 8F00          MOVL      XAR4,#963             ; [CPU_ARAU] |160| 
         000002a8 03C3 
     977 000002a9 88A9          MOVZ      AR6,AL                ; [CPU_ALU] |160| 
     978 000002aa A8A9          MOVL      ACC,XAR4              ; [CPU_ALU] |160| 
     979 000002ab 0742          ADDL      ACC,*-SP[2]           ; [CPU_ALU] |160| 
     980 000002ac 8AA9          MOVL      XAR4,ACC              ; [CPU_ALU] |160| 
     981 000002ad 7EC4          MOV       *+XAR4[0],AR6         ; [CPU_ALU] |160| 
     982                      .dwpsn  file "../drv8305.c",line 162,column 2,is_stmt,isa 0
     983                      .dwpsn  file "../drv8305.c",line 167,column 2,is_stmt,isa 0
     984                      .dwpsn  file "../drv8305.c",line 172,column 2,is_stmt,isa 0
     985                      .dwpsn  file "../drv8305.c",line 177,column 2,is_stmt,isa 0
     986 000002ae 8F00          MOVL      XAR4,#963             ; [CPU_ARAU] |177| 
         000002af 03C3 
     987 000002b0 A8A9          MOVL      ACC,XAR4              ; [CPU_ALU] |177| 
     988 000002b1 0742          ADDL      ACC,*-SP[2]           ; [CPU_ALU] |177| 
     989 000002b2 8AA9          MOVL      XAR4,ACC              ; [CPU_ALU] |177| 
     990 000002b3 92C4          MOV       AL,*+XAR4[0]          ; [CPU_ALU] |177| 
     991 000002b4 6001          B         $C$L7,NEQ             ; [CPU_ALU] |177| 
     992                      ; branchcc occurs ; [] |177| 
     993                      .dwpsn  file "../drv8305.c",line 182,column 2,is_stmt,isa 0
     994 000002b5       $C$L7:    
     995                      .dwpsn  file "../drv8305.c",line 183,column 1,is_stmt,isa 0
     996 000002b5 FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
     997                      .dwcfi  cfa_offset, -2
     998              $C$DW$43        .dwtag  DW_TAG_TI_branch
     999                      .dwattr $C$DW$43, DW_AT_low_pc(0x00)
    1000                      .dwattr $C$DW$43, DW_AT_TI_return
    1001              
    1002 000002b6 0006          LRETR     ; [CPU_ALU] 
    1003                      ; return occurs ; [] 
    1004                      .dwattr $C$DW$36, DW_AT_TI_end_file("../drv8305.c")
    1005                      .dwattr $C$DW$36, DW_AT_TI_end_line(0xb7)
    1006                      .dwattr $C$DW$36, DW_AT_TI_end_column(0x01)
    1007                      .dwendentry
    1008                      .dwendtag $C$DW$36
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   22

    1009              
    1010              ;**************************************************************
    1011              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1012              ;**************************************************************
    1013                      .global _DRV8305_SPI_Write
    1014                      .global _DRV8305_SPI_Read
    1015              
    1016              ;***************************************************************
    1017              ;* TYPE INFORMATION                                            *
    1018              ;***************************************************************
    1019              
    1020              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1021                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
    1022              $C$DW$44        .dwtag  DW_TAG_member
    1023                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
    1024                      .dwattr $C$DW$44, DW_AT_name("As")
    1025                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_As")
    1026                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1027                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1028              
    1029              $C$DW$45        .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
    1031                      .dwattr $C$DW$45, DW_AT_name("Bs")
    1032                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_Bs")
    1033                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1034                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1035              
    1036              $C$DW$46        .dwtag  DW_TAG_member
    1037                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
    1038                      .dwattr $C$DW$46, DW_AT_name("Cs")
    1039                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_Cs")
    1040                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1041                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1042              
    1043              $C$DW$47        .dwtag  DW_TAG_member
    1044                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
    1045                      .dwattr $C$DW$47, DW_AT_name("Alpha")
    1046                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_Alpha")
    1047                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1048                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1049              
    1050              $C$DW$48        .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
    1052                      .dwattr $C$DW$48, DW_AT_name("Beta")
    1053                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_Beta")
    1054                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1055                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1056              
    1057                      .dwendtag $C$DW$T$20
    1058              
    1059              $C$DW$T$66      .dwtag  DW_TAG_typedef
    1060                      .dwattr $C$DW$T$66, DW_AT_name("CLARKE")
    1061                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$20)
    1062                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    1063              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   23

    1064              
    1065              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1066                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
    1067              $C$DW$49        .dwtag  DW_TAG_member
    1068                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
    1069                      .dwattr $C$DW$49, DW_AT_name("Alpha")
    1070                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_Alpha")
    1071                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1072                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1073              
    1074              $C$DW$50        .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
    1076                      .dwattr $C$DW$50, DW_AT_name("Beta")
    1077                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_Beta")
    1078                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1079                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1080              
    1081              $C$DW$51        .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
    1083                      .dwattr $C$DW$51, DW_AT_name("Angle")
    1084                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_Angle")
    1085                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1086                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1087              
    1088              $C$DW$52        .dwtag  DW_TAG_member
    1089                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
    1090                      .dwattr $C$DW$52, DW_AT_name("Ds")
    1091                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_Ds")
    1092                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1093                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1094              
    1095              $C$DW$53        .dwtag  DW_TAG_member
    1096                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
    1097                      .dwattr $C$DW$53, DW_AT_name("Qs")
    1098                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_Qs")
    1099                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1100                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1101              
    1102              $C$DW$54        .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
    1104                      .dwattr $C$DW$54, DW_AT_name("Sine")
    1105                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_Sine")
    1106                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1107                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1108              
    1109              $C$DW$55        .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
    1111                      .dwattr $C$DW$55, DW_AT_name("Cosine")
    1112                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_Cosine")
    1113                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1114                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1115              
    1116                      .dwendtag $C$DW$T$21
    1117              
    1118              $C$DW$T$67      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   24

    1119                      .dwattr $C$DW$T$67, DW_AT_name("PARK")
    1120                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$21)
    1121                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1122              
    1123              
    1124              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1125                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
    1126              $C$DW$56        .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1128                      .dwattr $C$DW$56, DW_AT_name("Alpha")
    1129                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_Alpha")
    1130                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1131                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1132              
    1133              $C$DW$57        .dwtag  DW_TAG_member
    1134                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
    1135                      .dwattr $C$DW$57, DW_AT_name("Beta")
    1136                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_Beta")
    1137                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1138                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1139              
    1140              $C$DW$58        .dwtag  DW_TAG_member
    1141                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1142                      .dwattr $C$DW$58, DW_AT_name("Angle")
    1143                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_Angle")
    1144                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1145                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1146              
    1147              $C$DW$59        .dwtag  DW_TAG_member
    1148                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1149                      .dwattr $C$DW$59, DW_AT_name("Ds")
    1150                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_Ds")
    1151                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1152                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1153              
    1154              $C$DW$60        .dwtag  DW_TAG_member
    1155                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1156                      .dwattr $C$DW$60, DW_AT_name("Qs")
    1157                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_Qs")
    1158                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1159                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1160              
    1161              $C$DW$61        .dwtag  DW_TAG_member
    1162                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1163                      .dwattr $C$DW$61, DW_AT_name("Sine")
    1164                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_Sine")
    1165                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1166                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1167              
    1168              $C$DW$62        .dwtag  DW_TAG_member
    1169                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1170                      .dwattr $C$DW$62, DW_AT_name("Cosine")
    1171                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_Cosine")
    1172                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1173                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   25

    1174              
    1175                      .dwendtag $C$DW$T$22
    1176              
    1177              $C$DW$T$68      .dwtag  DW_TAG_typedef
    1178                      .dwattr $C$DW$T$68, DW_AT_name("IPARK")
    1179                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$22)
    1180                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1181              
    1182              
    1183              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1184                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    1185              $C$DW$63        .dwtag  DW_TAG_member
    1186                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1187                      .dwattr $C$DW$63, DW_AT_name("Alpha")
    1188                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_Alpha")
    1189                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1190                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1191              
    1192              $C$DW$64        .dwtag  DW_TAG_member
    1193                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1194                      .dwattr $C$DW$64, DW_AT_name("Beta")
    1195                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_Beta")
    1196                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1197                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1198              
    1199              $C$DW$65        .dwtag  DW_TAG_member
    1200                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1201                      .dwattr $C$DW$65, DW_AT_name("As")
    1202                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_As")
    1203                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1204                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1205              
    1206              $C$DW$66        .dwtag  DW_TAG_member
    1207                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1208                      .dwattr $C$DW$66, DW_AT_name("Bs")
    1209                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_Bs")
    1210                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1211                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1212              
    1213              $C$DW$67        .dwtag  DW_TAG_member
    1214                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1215                      .dwattr $C$DW$67, DW_AT_name("Cs")
    1216                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_Cs")
    1217                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1218                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1219              
    1220                      .dwendtag $C$DW$T$23
    1221              
    1222              $C$DW$T$69      .dwtag  DW_TAG_typedef
    1223                      .dwattr $C$DW$T$69, DW_AT_name("ICLARKE")
    1224                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$23)
    1225                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1226              
    1227              
    1228              $C$DW$T$24      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   26

    1229                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
    1230              $C$DW$68        .dwtag  DW_TAG_member
    1231                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1232                      .dwattr $C$DW$68, DW_AT_name("Vc_AB")
    1233                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_Vc_AB")
    1234                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1235                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1236              
    1237              $C$DW$69        .dwtag  DW_TAG_member
    1238                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1239                      .dwattr $C$DW$69, DW_AT_name("Vc_BC")
    1240                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_Vc_BC")
    1241                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1242                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1243              
    1244              $C$DW$70        .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1246                      .dwattr $C$DW$70, DW_AT_name("Vc_A")
    1247                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_Vc_A")
    1248                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1249                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1250              
    1251              $C$DW$71        .dwtag  DW_TAG_member
    1252                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1253                      .dwattr $C$DW$71, DW_AT_name("Vc_B")
    1254                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_Vc_B")
    1255                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1256                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1257              
    1258                      .dwendtag $C$DW$T$24
    1259              
    1260              $C$DW$T$70      .dwtag  DW_TAG_typedef
    1261                      .dwattr $C$DW$T$70, DW_AT_name("VCMEAS")
    1262                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$24)
    1263                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1264              
    1265              
    1266              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1267                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    1268              $C$DW$72        .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1270                      .dwattr $C$DW$72, DW_AT_name("Ref")
    1271                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_Ref")
    1272                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1274              
    1275              $C$DW$73        .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1277                      .dwattr $C$DW$73, DW_AT_name("Fbk")
    1278                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_Fbk")
    1279                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1280                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1281              
    1282              $C$DW$74        .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   27

    1284                      .dwattr $C$DW$74, DW_AT_name("Out")
    1285                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_Out")
    1286                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1287                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1288              
    1289              $C$DW$75        .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1291                      .dwattr $C$DW$75, DW_AT_name("c1")
    1292                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_c1")
    1293                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1294                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1295              
    1296              $C$DW$76        .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1298                      .dwattr $C$DW$76, DW_AT_name("c2")
    1299                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_c2")
    1300                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1301                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1302              
    1303              $C$DW$77        .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1305                      .dwattr $C$DW$77, DW_AT_name("Ref1")
    1306                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Ref1")
    1307                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1308                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1309              
    1310              $C$DW$78        .dwtag  DW_TAG_member
    1311                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1312                      .dwattr $C$DW$78, DW_AT_name("Fbk1")
    1313                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_Fbk1")
    1314                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1315                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1316              
    1317              $C$DW$79        .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1319                      .dwattr $C$DW$79, DW_AT_name("We")
    1320                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_We")
    1321                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1322                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1323              
    1324                      .dwendtag $C$DW$T$25
    1325              
    1326              $C$DW$T$28      .dwtag  DW_TAG_typedef
    1327                      .dwattr $C$DW$T$28, DW_AT_name("PID_GRANDO_TERMINALS")
    1328                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
    1329                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1330              
    1331              
    1332              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1333                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x14)
    1334              $C$DW$80        .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1336                      .dwattr $C$DW$80, DW_AT_name("Kr")
    1337                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_Kr")
    1338                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   28

    1339                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1340              
    1341              $C$DW$81        .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$81, DW_AT_name("Bw")
    1344                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_Bw")
    1345                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1346                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1347              
    1348              $C$DW$82        .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1350                      .dwattr $C$DW$82, DW_AT_name("Kp")
    1351                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_Kp")
    1352                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1353                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1354              
    1355              $C$DW$83        .dwtag  DW_TAG_member
    1356                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1357                      .dwattr $C$DW$83, DW_AT_name("Ki")
    1358                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_Ki")
    1359                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1360                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1361              
    1362              $C$DW$84        .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1364                      .dwattr $C$DW$84, DW_AT_name("Kd")
    1365                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Kd")
    1366                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1367                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1368              
    1369              $C$DW$85        .dwtag  DW_TAG_member
    1370                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1371                      .dwattr $C$DW$85, DW_AT_name("Km")
    1372                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Km")
    1373                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1374                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1375              
    1376              $C$DW$86        .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1378                      .dwattr $C$DW$86, DW_AT_name("Umax")
    1379                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_Umax")
    1380                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1381                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1382              
    1383              $C$DW$87        .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1385                      .dwattr $C$DW$87, DW_AT_name("Umin")
    1386                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_Umin")
    1387                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1388                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1389              
    1390              $C$DW$88        .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1392                      .dwattr $C$DW$88, DW_AT_name("sig")
    1393                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_sig")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   29

    1394                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1395                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1396              
    1397              $C$DW$89        .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1399                      .dwattr $C$DW$89, DW_AT_name("La")
    1400                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_La")
    1401                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1402                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1403              
    1404                      .dwendtag $C$DW$T$26
    1405              
    1406              $C$DW$T$29      .dwtag  DW_TAG_typedef
    1407                      .dwattr $C$DW$T$29, DW_AT_name("PID_GRANDO_PARAMETERS")
    1408                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    1409                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1410              
    1411              
    1412              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1413                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x18)
    1414              $C$DW$90        .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1416                      .dwattr $C$DW$90, DW_AT_name("up")
    1417                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_up")
    1418                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1419                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1420              
    1421              $C$DW$91        .dwtag  DW_TAG_member
    1422                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1423                      .dwattr $C$DW$91, DW_AT_name("ui")
    1424                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_ui")
    1425                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1426                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1427              
    1428              $C$DW$92        .dwtag  DW_TAG_member
    1429                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1430                      .dwattr $C$DW$92, DW_AT_name("ud")
    1431                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_ud")
    1432                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1433                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1434              
    1435              $C$DW$93        .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1437                      .dwattr $C$DW$93, DW_AT_name("p1")
    1438                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_p1")
    1439                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1440                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1441              
    1442              $C$DW$94        .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1444                      .dwattr $C$DW$94, DW_AT_name("v1")
    1445                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_v1")
    1446                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1447                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1448              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   30

    1449              $C$DW$95        .dwtag  DW_TAG_member
    1450                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1451                      .dwattr $C$DW$95, DW_AT_name("i1")
    1452                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_i1")
    1453                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1454                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1455              
    1456              $C$DW$96        .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1458                      .dwattr $C$DW$96, DW_AT_name("d1")
    1459                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_d1")
    1460                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1461                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1462              
    1463              $C$DW$97        .dwtag  DW_TAG_member
    1464                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1465                      .dwattr $C$DW$97, DW_AT_name("d2")
    1466                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_d2")
    1467                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1468                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1469              
    1470              $C$DW$98        .dwtag  DW_TAG_member
    1471                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1472                      .dwattr $C$DW$98, DW_AT_name("w1")
    1473                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_w1")
    1474                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1475                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1476              
    1477              $C$DW$99        .dwtag  DW_TAG_member
    1478                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1479                      .dwattr $C$DW$99, DW_AT_name("uc")
    1480                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_uc")
    1481                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1482                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1483              
    1484              $C$DW$100       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$100, DW_AT_name("p2")
    1487                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_p2")
    1488                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1489                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1490              
    1491              $C$DW$101       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1493                      .dwattr $C$DW$101, DW_AT_name("i2")
    1494                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_i2")
    1495                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1496                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1497              
    1498                      .dwendtag $C$DW$T$27
    1499              
    1500              $C$DW$T$30      .dwtag  DW_TAG_typedef
    1501                      .dwattr $C$DW$T$30, DW_AT_name("PID_GRANDO_DATA")
    1502                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$27)
    1503                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   31

    1504              
    1505              
    1506              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1507                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x3c)
    1508              $C$DW$102       .dwtag  DW_TAG_member
    1509                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$28)
    1510                      .dwattr $C$DW$102, DW_AT_name("term")
    1511                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_term")
    1512                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1513                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1514              
    1515              $C$DW$103       .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$29)
    1517                      .dwattr $C$DW$103, DW_AT_name("param")
    1518                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_param")
    1519                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1520                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1521              
    1522              $C$DW$104       .dwtag  DW_TAG_member
    1523                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$30)
    1524                      .dwattr $C$DW$104, DW_AT_name("data")
    1525                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_data")
    1526                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1527                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1528              
    1529                      .dwendtag $C$DW$T$31
    1530              
    1531              $C$DW$T$71      .dwtag  DW_TAG_typedef
    1532                      .dwattr $C$DW$T$71, DW_AT_name("PID_GRANDO_CONTROLLER")
    1533                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$31)
    1534                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1535              
    1536              
    1537              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1538                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x12)
    1539              $C$DW$105       .dwtag  DW_TAG_member
    1540                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1541                      .dwattr $C$DW$105, DW_AT_name("Ualpha")
    1542                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_Ualpha")
    1543                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1544                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1545              
    1546              $C$DW$106       .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1548                      .dwattr $C$DW$106, DW_AT_name("Ubeta")
    1549                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_Ubeta")
    1550                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1551                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1552              
    1553              $C$DW$107       .dwtag  DW_TAG_member
    1554                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1555                      .dwattr $C$DW$107, DW_AT_name("Ta")
    1556                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_Ta")
    1557                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1558                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   32

    1559              
    1560              $C$DW$108       .dwtag  DW_TAG_member
    1561                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1562                      .dwattr $C$DW$108, DW_AT_name("Tb")
    1563                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_Tb")
    1564                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1565                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1566              
    1567              $C$DW$109       .dwtag  DW_TAG_member
    1568                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1569                      .dwattr $C$DW$109, DW_AT_name("Tc")
    1570                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_Tc")
    1571                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1572                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1573              
    1574              $C$DW$110       .dwtag  DW_TAG_member
    1575                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1576                      .dwattr $C$DW$110, DW_AT_name("tmp1")
    1577                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_tmp1")
    1578                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1579                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1580              
    1581              $C$DW$111       .dwtag  DW_TAG_member
    1582                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1583                      .dwattr $C$DW$111, DW_AT_name("tmp2")
    1584                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_tmp2")
    1585                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1586                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1587              
    1588              $C$DW$112       .dwtag  DW_TAG_member
    1589                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1590                      .dwattr $C$DW$112, DW_AT_name("tmp3")
    1591                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_tmp3")
    1592                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1593                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1594              
    1595              $C$DW$113       .dwtag  DW_TAG_member
    1596                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$32)
    1597                      .dwattr $C$DW$113, DW_AT_name("VecSector")
    1598                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_VecSector")
    1599                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1600                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1601              
    1602                      .dwendtag $C$DW$T$33
    1603              
    1604              $C$DW$T$72      .dwtag  DW_TAG_typedef
    1605                      .dwattr $C$DW$T$72, DW_AT_name("SVGEN")
    1606                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$33)
    1607                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1608              
    1609              
    1610              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1611                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x14)
    1612              $C$DW$114       .dwtag  DW_TAG_member
    1613                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   33

    1614                      .dwattr $C$DW$114, DW_AT_name("TargetValue")
    1615                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_TargetValue")
    1616                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1617                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1618              
    1619              $C$DW$115       .dwtag  DW_TAG_member
    1620                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$34)
    1621                      .dwattr $C$DW$115, DW_AT_name("RampDelayCount")
    1622                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_RampDelayCount")
    1623                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1624                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1625              
    1626              $C$DW$116       .dwtag  DW_TAG_member
    1627                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1628                      .dwattr $C$DW$116, DW_AT_name("Acceleration")
    1629                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_Acceleration")
    1630                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1631                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1632              
    1633              $C$DW$117       .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1635                      .dwattr $C$DW$117, DW_AT_name("T")
    1636                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_T")
    1637                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1638                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1639              
    1640              $C$DW$118       .dwtag  DW_TAG_member
    1641                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1642                      .dwattr $C$DW$118, DW_AT_name("Max_RPM")
    1643                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_Max_RPM")
    1644                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1645                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1646              
    1647              $C$DW$119       .dwtag  DW_TAG_member
    1648                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1649                      .dwattr $C$DW$119, DW_AT_name("SetpointRpm")
    1650                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_SetpointRpm")
    1651                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1652                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1653              
    1654              $C$DW$120       .dwtag  DW_TAG_member
    1655                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1656                      .dwattr $C$DW$120, DW_AT_name("SetpointValue")
    1657                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_SetpointValue")
    1658                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1659                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1660              
    1661              $C$DW$121       .dwtag  DW_TAG_member
    1662                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$34)
    1663                      .dwattr $C$DW$121, DW_AT_name("EqualFlag")
    1664                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_EqualFlag")
    1665                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1666                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1667              
    1668              $C$DW$122       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   34

    1669                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1670                      .dwattr $C$DW$122, DW_AT_name("rmp_tmp")
    1671                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rmp_tmp")
    1672                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1673                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1674              
    1675              $C$DW$123       .dwtag  DW_TAG_member
    1676                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1677                      .dwattr $C$DW$123, DW_AT_name("rc_err")
    1678                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rc_err")
    1679                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1680                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1681              
    1682                      .dwendtag $C$DW$T$35
    1683              
    1684              $C$DW$T$73      .dwtag  DW_TAG_typedef
    1685                      .dwattr $C$DW$T$73, DW_AT_name("RMPCELE")
    1686                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$35)
    1687                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1688              
    1689              
    1690              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1691                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0c)
    1692              $C$DW$124       .dwtag  DW_TAG_member
    1693                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1694                      .dwattr $C$DW$124, DW_AT_name("Freq")
    1695                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_Freq")
    1696                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1697                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1698              
    1699              $C$DW$125       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1701                      .dwattr $C$DW$125, DW_AT_name("StepAngleMax")
    1702                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_StepAngleMax")
    1703                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1704                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1705              
    1706              $C$DW$126       .dwtag  DW_TAG_member
    1707                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1708                      .dwattr $C$DW$126, DW_AT_name("Angle")
    1709                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_Angle")
    1710                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1711                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1712              
    1713              $C$DW$127       .dwtag  DW_TAG_member
    1714                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1715                      .dwattr $C$DW$127, DW_AT_name("Gain")
    1716                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_Gain")
    1717                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1718                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1719              
    1720              $C$DW$128       .dwtag  DW_TAG_member
    1721                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1722                      .dwattr $C$DW$128, DW_AT_name("Out")
    1723                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_Out")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   35

    1724                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1725                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1726              
    1727              $C$DW$129       .dwtag  DW_TAG_member
    1728                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1729                      .dwattr $C$DW$129, DW_AT_name("Offset")
    1730                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_Offset")
    1731                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1732                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1733              
    1734                      .dwendtag $C$DW$T$36
    1735              
    1736              $C$DW$T$74      .dwtag  DW_TAG_typedef
    1737                      .dwattr $C$DW$T$74, DW_AT_name("RAMPGEN")
    1738                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$36)
    1739                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1740              
    1741              
    1742              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1743                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x16)
    1744              $C$DW$130       .dwtag  DW_TAG_member
    1745                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1746                      .dwattr $C$DW$130, DW_AT_name("DcBusVolt")
    1747                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_DcBusVolt")
    1748                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1750              
    1751              $C$DW$131       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1753                      .dwattr $C$DW$131, DW_AT_name("MfuncV1")
    1754                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_MfuncV1")
    1755                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1756                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1757              
    1758              $C$DW$132       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1760                      .dwattr $C$DW$132, DW_AT_name("MfuncV2")
    1761                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_MfuncV2")
    1762                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1763                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1764              
    1765              $C$DW$133       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1767                      .dwattr $C$DW$133, DW_AT_name("MfuncV3")
    1768                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_MfuncV3")
    1769                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1770                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1771              
    1772              $C$DW$134       .dwtag  DW_TAG_member
    1773                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$32)
    1774                      .dwattr $C$DW$134, DW_AT_name("OutOfPhase")
    1775                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_OutOfPhase")
    1776                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1777                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1778              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   36

    1779              $C$DW$135       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1781                      .dwattr $C$DW$135, DW_AT_name("VphaseA")
    1782                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_VphaseA")
    1783                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1784                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1785              
    1786              $C$DW$136       .dwtag  DW_TAG_member
    1787                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1788                      .dwattr $C$DW$136, DW_AT_name("VphaseB")
    1789                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_VphaseB")
    1790                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1791                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1792              
    1793              $C$DW$137       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1795                      .dwattr $C$DW$137, DW_AT_name("VphaseC")
    1796                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_VphaseC")
    1797                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1798                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1799              
    1800              $C$DW$138       .dwtag  DW_TAG_member
    1801                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1802                      .dwattr $C$DW$138, DW_AT_name("Valpha")
    1803                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_Valpha")
    1804                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1805                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1806              
    1807              $C$DW$139       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1809                      .dwattr $C$DW$139, DW_AT_name("Vbeta")
    1810                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_Vbeta")
    1811                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1812                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1813              
    1814              $C$DW$140       .dwtag  DW_TAG_member
    1815                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1816                      .dwattr $C$DW$140, DW_AT_name("temp")
    1817                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_temp")
    1818                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1819                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1820              
    1821                      .dwendtag $C$DW$T$37
    1822              
    1823              $C$DW$T$75      .dwtag  DW_TAG_typedef
    1824                      .dwattr $C$DW$T$75, DW_AT_name("PHASEVOLTAGE")
    1825                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$37)
    1826                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1827              
    1828              
    1829              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1830                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x14)
    1831              $C$DW$141       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1833                      .dwattr $C$DW$141, DW_AT_name("ElecTheta")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   37

    1834                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ElecTheta")
    1835                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1836                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1837              
    1838              $C$DW$142       .dwtag  DW_TAG_member
    1839                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$34)
    1840                      .dwattr $C$DW$142, DW_AT_name("DirectionQep")
    1841                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_DirectionQep")
    1842                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1843                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1844              
    1845              $C$DW$143       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1847                      .dwattr $C$DW$143, DW_AT_name("OldElecTheta")
    1848                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_OldElecTheta")
    1849                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1850                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1851              
    1852              $C$DW$144       .dwtag  DW_TAG_member
    1853                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1854                      .dwattr $C$DW$144, DW_AT_name("Speed")
    1855                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_Speed")
    1856                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1857                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1858              
    1859              $C$DW$145       .dwtag  DW_TAG_member
    1860                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$34)
    1861                      .dwattr $C$DW$145, DW_AT_name("BaseRpm")
    1862                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_BaseRpm")
    1863                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1864                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1865              
    1866              $C$DW$146       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$38)
    1868                      .dwattr $C$DW$146, DW_AT_name("K1")
    1869                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_K1")
    1870                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1871                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1872              
    1873              $C$DW$147       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1875                      .dwattr $C$DW$147, DW_AT_name("K2")
    1876                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_K2")
    1877                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1878                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1879              
    1880              $C$DW$148       .dwtag  DW_TAG_member
    1881                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1882                      .dwattr $C$DW$148, DW_AT_name("K3")
    1883                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_K3")
    1884                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1885                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1886              
    1887              $C$DW$149       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   38

    1889                      .dwattr $C$DW$149, DW_AT_name("SpeedRpm")
    1890                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_SpeedRpm")
    1891                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1892                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1893              
    1894              $C$DW$150       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1896                      .dwattr $C$DW$150, DW_AT_name("Tmp")
    1897                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_Tmp")
    1898                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1899                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1900              
    1901                      .dwendtag $C$DW$T$40
    1902              
    1903              $C$DW$T$76      .dwtag  DW_TAG_typedef
    1904                      .dwattr $C$DW$T$76, DW_AT_name("SPEED_MEAS_QEP")
    1905                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$40)
    1906                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1907              
    1908              
    1909              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1910                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x12)
    1911              $C$DW$151       .dwtag  DW_TAG_member
    1912                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$41)
    1913                      .dwattr $C$DW$151, DW_AT_name("ElecTheta")
    1914                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ElecTheta")
    1915                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1916                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1917              
    1918              $C$DW$152       .dwtag  DW_TAG_member
    1919                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$41)
    1920                      .dwattr $C$DW$152, DW_AT_name("MechTheta")
    1921                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_MechTheta")
    1922                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1923                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1924              
    1925              $C$DW$153       .dwtag  DW_TAG_member
    1926                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$32)
    1927                      .dwattr $C$DW$153, DW_AT_name("DirectionQep")
    1928                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_DirectionQep")
    1929                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1930                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1931              
    1932              $C$DW$154       .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$32)
    1934                      .dwattr $C$DW$154, DW_AT_name("QepPeriod")
    1935                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_QepPeriod")
    1936                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1937                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1938              
    1939              $C$DW$155       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$34)
    1941                      .dwattr $C$DW$155, DW_AT_name("QepCountIndex")
    1942                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_QepCountIndex")
    1943                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   39

    1944                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1945              
    1946              $C$DW$156       .dwtag  DW_TAG_member
    1947                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$39)
    1948                      .dwattr $C$DW$156, DW_AT_name("RawTheta")
    1949                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_RawTheta")
    1950                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1951                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1952              
    1953              $C$DW$157       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$41)
    1955                      .dwattr $C$DW$157, DW_AT_name("MechScaler")
    1956                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_MechScaler")
    1957                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1958                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1959              
    1960              $C$DW$158       .dwtag  DW_TAG_member
    1961                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$32)
    1962                      .dwattr $C$DW$158, DW_AT_name("LineEncoder")
    1963                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_LineEncoder")
    1964                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1965                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1966              
    1967              $C$DW$159       .dwtag  DW_TAG_member
    1968                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$32)
    1969                      .dwattr $C$DW$159, DW_AT_name("PolePairs")
    1970                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PolePairs")
    1971                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1972                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1973              
    1974              $C$DW$160       .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$39)
    1976                      .dwattr $C$DW$160, DW_AT_name("CalibratedAngle")
    1977                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_CalibratedAngle")
    1978                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1979                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1980              
    1981              $C$DW$161       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$32)
    1983                      .dwattr $C$DW$161, DW_AT_name("IndexSyncFlag")
    1984                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_IndexSyncFlag")
    1985                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1986                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1987              
    1988                      .dwendtag $C$DW$T$42
    1989              
    1990              $C$DW$T$77      .dwtag  DW_TAG_typedef
    1991                      .dwattr $C$DW$T$77, DW_AT_name("QEP")
    1992                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$42)
    1993                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1994              
    1995              
    1996              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1997                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x07)
    1998              $C$DW$162       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   40

    1999                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$43)
    2000                      .dwattr $C$DW$162, DW_AT_name("stat_reg1")
    2001                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_stat_reg1")
    2002                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2003                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2004              
    2005              $C$DW$163       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$44)
    2007                      .dwattr $C$DW$163, DW_AT_name("stat_reg2")
    2008                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_stat_reg2")
    2009                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2010                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2011              
    2012              $C$DW$164       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$45)
    2014                      .dwattr $C$DW$164, DW_AT_name("cntrl_reg1")
    2015                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_cntrl_reg1")
    2016                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2017                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2018              
    2019              $C$DW$165       .dwtag  DW_TAG_member
    2020                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$46)
    2021                      .dwattr $C$DW$165, DW_AT_name("cntrl_reg2")
    2022                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_cntrl_reg2")
    2023                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2024                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2025              
    2026              $C$DW$166       .dwtag  DW_TAG_member
    2027                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$32)
    2028                      .dwattr $C$DW$166, DW_AT_name("readCntrl1")
    2029                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_readCntrl1")
    2030                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2031                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2032              
    2033              $C$DW$167       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$32)
    2035                      .dwattr $C$DW$167, DW_AT_name("readCntrl2")
    2036                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_readCntrl2")
    2037                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2038                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2039              
    2040              $C$DW$168       .dwtag  DW_TAG_member
    2041                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$32)
    2042                      .dwattr $C$DW$168, DW_AT_name("DRV_fault")
    2043                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_DRV_fault")
    2044                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2045                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2046              
    2047                      .dwendtag $C$DW$T$47
    2048              
    2049              $C$DW$T$78      .dwtag  DW_TAG_typedef
    2050                      .dwattr $C$DW$T$78, DW_AT_name("DRV8301_Vars")
    2051                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$47)
    2052                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2053              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   41

    2054              
    2055              $C$DW$T$59      .dwtag  DW_TAG_structure_type
    2056                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x15)
    2057              $C$DW$169       .dwtag  DW_TAG_member
    2058                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$32)
    2059                      .dwattr $C$DW$169, DW_AT_name("Rsvd0")
    2060                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_Rsvd0")
    2061                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2062                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2063              
    2064              $C$DW$170       .dwtag  DW_TAG_member
    2065                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$48)
    2066                      .dwattr $C$DW$170, DW_AT_name("status1_wwd")
    2067                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_status1_wwd")
    2068                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2069                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2070              
    2071              $C$DW$171       .dwtag  DW_TAG_member
    2072                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$49)
    2073                      .dwattr $C$DW$171, DW_AT_name("status2_ov_vds")
    2074                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_status2_ov_vds")
    2075                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2076                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2077              
    2078              $C$DW$172       .dwtag  DW_TAG_member
    2079                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$50)
    2080                      .dwattr $C$DW$172, DW_AT_name("status3_IC")
    2081                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_status3_IC")
    2082                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2083                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2084              
    2085              $C$DW$173       .dwtag  DW_TAG_member
    2086                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$51)
    2087                      .dwattr $C$DW$173, DW_AT_name("status4_gd_Vgs")
    2088                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    2089                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2090                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2091              
    2092              $C$DW$174       .dwtag  DW_TAG_member
    2093                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$52)
    2094                      .dwattr $C$DW$174, DW_AT_name("cntrl5_hs_gd")
    2095                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    2096                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2097                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2098              
    2099              $C$DW$175       .dwtag  DW_TAG_member
    2100                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$53)
    2101                      .dwattr $C$DW$175, DW_AT_name("cntrl6_ls_gd")
    2102                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    2103                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2104                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2105              
    2106              $C$DW$176       .dwtag  DW_TAG_member
    2107                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$54)
    2108                      .dwattr $C$DW$176, DW_AT_name("cntrl7_gd")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   42

    2109                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_cntrl7_gd")
    2110                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2111                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2112              
    2113              $C$DW$177       .dwtag  DW_TAG_member
    2114                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$32)
    2115                      .dwattr $C$DW$177, DW_AT_name("Rsvd8")
    2116                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_Rsvd8")
    2117                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2118                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2119              
    2120              $C$DW$178       .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$55)
    2122                      .dwattr $C$DW$178, DW_AT_name("cntrl9_IC_ops")
    2123                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    2124                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2125                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2126              
    2127              $C$DW$179       .dwtag  DW_TAG_member
    2128                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$56)
    2129                      .dwattr $C$DW$179, DW_AT_name("cntrlA_shunt_amp")
    2130                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    2131                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2132                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2133              
    2134              $C$DW$180       .dwtag  DW_TAG_member
    2135                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$57)
    2136                      .dwattr $C$DW$180, DW_AT_name("cntrlB_Vreg")
    2137                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    2138                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2139                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2140              
    2141              $C$DW$181       .dwtag  DW_TAG_member
    2142                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$58)
    2143                      .dwattr $C$DW$181, DW_AT_name("cntrlC_Vds_SNS")
    2144                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
    2145                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2146                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2147              
    2148              $C$DW$182       .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$32)
    2150                      .dwattr $C$DW$182, DW_AT_name("readCntrl5")
    2151                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_readCntrl5")
    2152                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2153                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2154              
    2155              $C$DW$183       .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$32)
    2157                      .dwattr $C$DW$183, DW_AT_name("readCntrl6")
    2158                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_readCntrl6")
    2159                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2160                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2161              
    2162              $C$DW$184       .dwtag  DW_TAG_member
    2163                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   43

    2164                      .dwattr $C$DW$184, DW_AT_name("readCntrl7")
    2165                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_readCntrl7")
    2166                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2167                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2168              
    2169              $C$DW$185       .dwtag  DW_TAG_member
    2170                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$32)
    2171                      .dwattr $C$DW$185, DW_AT_name("readCntrl9")
    2172                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_readCntrl9")
    2173                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2174                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2175              
    2176              $C$DW$186       .dwtag  DW_TAG_member
    2177                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$32)
    2178                      .dwattr $C$DW$186, DW_AT_name("readCntrlA")
    2179                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_readCntrlA")
    2180                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2181                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2182              
    2183              $C$DW$187       .dwtag  DW_TAG_member
    2184                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$32)
    2185                      .dwattr $C$DW$187, DW_AT_name("readCntrlB")
    2186                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_readCntrlB")
    2187                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2188                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2189              
    2190              $C$DW$188       .dwtag  DW_TAG_member
    2191                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$32)
    2192                      .dwattr $C$DW$188, DW_AT_name("readCntrlC")
    2193                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_readCntrlC")
    2194                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2195                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2196              
    2197              $C$DW$189       .dwtag  DW_TAG_member
    2198                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$32)
    2199                      .dwattr $C$DW$189, DW_AT_name("DRV_fault")
    2200                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_DRV_fault")
    2201                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2202                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2203              
    2204                      .dwendtag $C$DW$T$59
    2205              
    2206              $C$DW$T$79      .dwtag  DW_TAG_typedef
    2207                      .dwattr $C$DW$T$79, DW_AT_name("DRV8305_Vars")
    2208                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$59)
    2209                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    2210              
    2211              
    2212              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    2213                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x3d4)
    2214              $C$DW$190       .dwtag  DW_TAG_member
    2215                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$61)
    2216                      .dwattr $C$DW$190, DW_AT_name("PwmARegs")
    2217                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_PwmARegs")
    2218                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   44

    2219                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2220              
    2221              $C$DW$191       .dwtag  DW_TAG_member
    2222                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$61)
    2223                      .dwattr $C$DW$191, DW_AT_name("PwmBRegs")
    2224                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_PwmBRegs")
    2225                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2226                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2227              
    2228              $C$DW$192       .dwtag  DW_TAG_member
    2229                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$61)
    2230                      .dwattr $C$DW$192, DW_AT_name("PwmCRegs")
    2231                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PwmCRegs")
    2232                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2233                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2234              
    2235              $C$DW$193       .dwtag  DW_TAG_member
    2236                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$63)
    2237                      .dwattr $C$DW$193, DW_AT_name("QepRegs")
    2238                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_QepRegs")
    2239                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2240                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2241              
    2242              $C$DW$194       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$65)
    2244                      .dwattr $C$DW$194, DW_AT_name("SpiRegs")
    2245                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_SpiRegs")
    2246                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2247                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2248              
    2249              $C$DW$195       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$32)
    2251                      .dwattr $C$DW$195, DW_AT_name("drvScsPin")
    2252                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_drvScsPin")
    2253                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2254                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2255              
    2256              $C$DW$196       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2258                      .dwattr $C$DW$196, DW_AT_name("offset_shntA")
    2259                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_offset_shntA")
    2260                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2261                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2262              
    2263              $C$DW$197       .dwtag  DW_TAG_member
    2264                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2265                      .dwattr $C$DW$197, DW_AT_name("offset_shntB")
    2266                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_offset_shntB")
    2267                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2268                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2269              
    2270              $C$DW$198       .dwtag  DW_TAG_member
    2271                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2272                      .dwattr $C$DW$198, DW_AT_name("offset_As")
    2273                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_offset_As")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   45

    2274                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2275                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2276              
    2277              $C$DW$199       .dwtag  DW_TAG_member
    2278                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2279                      .dwattr $C$DW$199, DW_AT_name("offset_Bs")
    2280                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_offset_Bs")
    2281                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2282                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2283              
    2284              $C$DW$200       .dwtag  DW_TAG_member
    2285                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2286                      .dwattr $C$DW$200, DW_AT_name("offset_ABV")
    2287                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_offset_ABV")
    2288                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2289                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2290              
    2291              $C$DW$201       .dwtag  DW_TAG_member
    2292                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2293                      .dwattr $C$DW$201, DW_AT_name("offset_BCV")
    2294                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_offset_BCV")
