TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Tue May 11 14:30:53 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drv8301.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Chiaming\CCSworkspace_V10\MonoMtrServo_377s\F2837x_RAM")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DRV8301_SPI_Write")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DRV8301_SPI_Write")

     372 000000c2 2D47          MOV       T,*-SP[7]             ; [CPU_ALU] |113| 
     373 000000c3 9A01          MOVB      AL,#1                 ; [CPU_ALU] |113| 
     374 000000c4 FF66          LSL       AL,T                  ; [CPU_ALU] |113| 
     375 000000c5 98C4          OR        *+XAR4[0],AL          ; [CPU_ALU] |113| 
     376 000000c6       $C$L2:    
     377                      .dwpsn  file "../drv8301.c",line 110,column 27,is_stmt,isa 0
     378 000000c6 0A47          INC       *-SP[7]               ; [CPU_ALU] |110| 
     379                      .dwpsn  file "../drv8301.c",line 110,column 17,is_stmt,isa 0
     380 000000c7 9247          MOV       AL,*-SP[7]            ; [CPU_ALU] |110| 
     381 000000c8 5201          CMPB      AL,#1                 ; [CPU_ALU] |110| 
     382 000000c9 69F0          B         $C$L1,LOS             ; [CPU_ALU] |110| 
     383                      ; branchcc occurs ; [] |110| 
     384 000000ca       $C$L3:    
     385                      .dwpsn  file "../drv8301.c",line 117,column 9,is_stmt,isa 0
     386 000000ca 5203          CMPB      AL,#3                 ; [CPU_ALU] |117| 
     387 000000cb 6617          B         $C$L6,HI              ; [CPU_ALU] |117| 
     388                      ; branchcc occurs ; [] |117| 
     389 000000cc       $C$L4:    
     390                      .dwpsn  file "../drv8301.c",line 119,column 3,is_stmt,isa 0
     391 000000cc 8A46          MOVL      XAR4,*-SP[6]          ; [CPU_ALU] |119| 
     392 000000cd 8344          MOVL      XAR5,*-SP[4]          ; [CPU_ALU] |119| 
     393 000000ce 9284          MOV       AL,*XAR4++            ; [CPU_ALU] |119| 
     394 000000cf A846          MOVL      *-SP[6],XAR4          ; [CPU_ALU] |119| 
     395 000000d0 8885          MOVZ      AR6,*XAR5++           ; [CPU_ALU] |119| 
     396 000000d1 0EA9          MOVU      ACC,AL                ; [CPU_ALU] |119| 
     397 000000d2 A044          MOVL      *-SP[4],XAR5          ; [CPU_ALU] |119| 
     398 000000d3 0FA6          CMPL      ACC,XAR6              ; [CPU_ALU] |119| 
     399 000000d4 610A          B         $C$L5,EQ              ; [CPU_ALU] |119| 
     400                      ; branchcc occurs ; [] |119| 
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE    9

     401                      .dwpsn  file "../drv8301.c",line 120,column 4,is_stmt,isa 0
     402 000000d5 8F00          MOVL      XAR4,#958             ; [CPU_ARAU] |120| 
         000000d6 03BE 
     403 000000d7 A8A9          MOVL      ACC,XAR4              ; [CPU_ALU] |120| 
     404 000000d8 0742          ADDL      ACC,*-SP[2]           ; [CPU_ALU] |120| 
     405 000000d9 8AA9          MOVL      XAR4,ACC              ; [CPU_ALU] |120| 
     406 000000da 2D47          MOV       T,*-SP[7]             ; [CPU_ALU] |120| 
     407 000000db 9A01          MOVB      AL,#1                 ; [CPU_ALU] |120| 
     408 000000dc FF66          LSL       AL,T                  ; [CPU_ALU] |120| 
     409 000000dd 98C4          OR        *+XAR4[0],AL          ; [CPU_ALU] |120| 
     410 000000de       $C$L5:    
     411                      .dwpsn  file "../drv8301.c",line 117,column 19,is_stmt,isa 0
     412 000000de 0A47          INC       *-SP[7]               ; [CPU_ALU] |117| 
     413                      .dwpsn  file "../drv8301.c",line 117,column 9,is_stmt,isa 0
     414 000000df 9247          MOV       AL,*-SP[7]            ; [CPU_ALU] |117| 
     415 000000e0 5203          CMPB      AL,#3                 ; [CPU_ALU] |117| 
     416 000000e1 69EB          B         $C$L4,LOS             ; [CPU_ALU] |117| 
     417                      ; branchcc occurs ; [] |117| 
     418                      .dwpsn  file "../drv8301.c",line 123,column 2,is_stmt,isa 0
     419 000000e2       $C$L6:    
     420                      .dwpsn  file "../drv8301.c",line 124,column 1,is_stmt,isa 0
     421 000000e2 FE88          SUBB      SP,#8                 ; [CPU_ARAU] 
     422                      .dwcfi  cfa_offset, -2
     423              $C$DW$22        .dwtag  DW_TAG_TI_branch
     424                      .dwattr $C$DW$22, DW_AT_low_pc(0x00)
     425                      .dwattr $C$DW$22, DW_AT_TI_return
     426              
     427 000000e3 0006          LRETR     ; [CPU_ALU] 
     428                      ; return occurs ; [] 
     429                      .dwattr $C$DW$11, DW_AT_TI_end_file("../drv8301.c")
     430                      .dwattr $C$DW$11, DW_AT_TI_end_line(0x7c)
     431                      .dwattr $C$DW$11, DW_AT_TI_end_column(0x01)
     432                      .dwendentry
     433                      .dwendtag $C$DW$11
     434              
     435              ;**************************************************************
     436              ;* UNDEFINED EXTERNAL REFERENCES                              *
     437              ;**************************************************************
     438                      .global _DRV8301_SPI_Write
     439                      .global _DRV8301_SPI_Read
     440              
     441              ;***************************************************************
     442              ;* TYPE INFORMATION                                            *
     443              ;***************************************************************
     444              
     445              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     446                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
     447              $C$DW$23        .dwtag  DW_TAG_member
     448                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     449                      .dwattr $C$DW$23, DW_AT_name("As")
     450                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_As")
     451                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     452                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     453              
     454              $C$DW$24        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   10

     455                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     456                      .dwattr $C$DW$24, DW_AT_name("Bs")
     457                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_Bs")
     458                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     459                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     460              
     461              $C$DW$25        .dwtag  DW_TAG_member
     462                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     463                      .dwattr $C$DW$25, DW_AT_name("Cs")
     464                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_Cs")
     465                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     466                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     467              
     468              $C$DW$26        .dwtag  DW_TAG_member
     469                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     470                      .dwattr $C$DW$26, DW_AT_name("Alpha")
     471                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_Alpha")
     472                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     473                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     474              
     475              $C$DW$27        .dwtag  DW_TAG_member
     476                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     477                      .dwattr $C$DW$27, DW_AT_name("Beta")
     478                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_Beta")
     479                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     480                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     481              
     482                      .dwendtag $C$DW$T$20
     483              
     484              $C$DW$T$66      .dwtag  DW_TAG_typedef
     485                      .dwattr $C$DW$T$66, DW_AT_name("CLARKE")
     486                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$20)
     487                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
     488              
     489              
     490              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     491                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
     492              $C$DW$28        .dwtag  DW_TAG_member
     493                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     494                      .dwattr $C$DW$28, DW_AT_name("Alpha")
     495                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_Alpha")
     496                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     497                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     498              
     499              $C$DW$29        .dwtag  DW_TAG_member
     500                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     501                      .dwattr $C$DW$29, DW_AT_name("Beta")
     502                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_Beta")
     503                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     504                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     505              
     506              $C$DW$30        .dwtag  DW_TAG_member
     507                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     508                      .dwattr $C$DW$30, DW_AT_name("Angle")
     509                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_Angle")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   11

     510                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     511                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     512              
     513              $C$DW$31        .dwtag  DW_TAG_member
     514                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     515                      .dwattr $C$DW$31, DW_AT_name("Ds")
     516                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_Ds")
     517                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     518                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     519              
     520              $C$DW$32        .dwtag  DW_TAG_member
     521                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     522                      .dwattr $C$DW$32, DW_AT_name("Qs")
     523                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_Qs")
     524                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     525                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     526              
     527              $C$DW$33        .dwtag  DW_TAG_member
     528                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     529                      .dwattr $C$DW$33, DW_AT_name("Sine")
     530                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_Sine")
     531                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     532                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     533              
     534              $C$DW$34        .dwtag  DW_TAG_member
     535                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     536                      .dwattr $C$DW$34, DW_AT_name("Cosine")
     537                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_Cosine")
     538                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     539                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     540              
     541                      .dwendtag $C$DW$T$21
     542              
     543              $C$DW$T$67      .dwtag  DW_TAG_typedef
     544                      .dwattr $C$DW$T$67, DW_AT_name("PARK")
     545                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$21)
     546                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     547              
     548              
     549              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     550                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
     551              $C$DW$35        .dwtag  DW_TAG_member
     552                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     553                      .dwattr $C$DW$35, DW_AT_name("Alpha")
     554                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_Alpha")
     555                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     556                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     557              
     558              $C$DW$36        .dwtag  DW_TAG_member
     559                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     560                      .dwattr $C$DW$36, DW_AT_name("Beta")
     561                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_Beta")
     562                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     563                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     564              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   12

     565              $C$DW$37        .dwtag  DW_TAG_member
     566                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     567                      .dwattr $C$DW$37, DW_AT_name("Angle")
     568                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_Angle")
     569                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     570                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     571              
     572              $C$DW$38        .dwtag  DW_TAG_member
     573                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     574                      .dwattr $C$DW$38, DW_AT_name("Ds")
     575                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_Ds")
     576                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     577                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     578              
     579              $C$DW$39        .dwtag  DW_TAG_member
     580                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     581                      .dwattr $C$DW$39, DW_AT_name("Qs")
     582                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_Qs")
     583                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     584                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     585              
     586              $C$DW$40        .dwtag  DW_TAG_member
     587                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     588                      .dwattr $C$DW$40, DW_AT_name("Sine")
     589                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_Sine")
     590                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     591                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     592              
     593              $C$DW$41        .dwtag  DW_TAG_member
     594                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     595                      .dwattr $C$DW$41, DW_AT_name("Cosine")
     596                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_Cosine")
     597                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     598                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     599              
     600                      .dwendtag $C$DW$T$22
     601              
     602              $C$DW$T$68      .dwtag  DW_TAG_typedef
     603                      .dwattr $C$DW$T$68, DW_AT_name("IPARK")
     604                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$22)
     605                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
     606              
     607              
     608              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     609                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
     610              $C$DW$42        .dwtag  DW_TAG_member
     611                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     612                      .dwattr $C$DW$42, DW_AT_name("Alpha")
     613                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_Alpha")
     614                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     615                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     616              
     617              $C$DW$43        .dwtag  DW_TAG_member
     618                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     619                      .dwattr $C$DW$43, DW_AT_name("Beta")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   13

     620                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_Beta")
     621                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     622                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     623              
     624              $C$DW$44        .dwtag  DW_TAG_member
     625                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     626                      .dwattr $C$DW$44, DW_AT_name("As")
     627                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_As")
     628                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     629                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     630              
     631              $C$DW$45        .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     633                      .dwattr $C$DW$45, DW_AT_name("Bs")
     634                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_Bs")
     635                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     636                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     637              
     638              $C$DW$46        .dwtag  DW_TAG_member
     639                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     640                      .dwattr $C$DW$46, DW_AT_name("Cs")
     641                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_Cs")
     642                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     643                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     644              
     645                      .dwendtag $C$DW$T$23
     646              
     647              $C$DW$T$69      .dwtag  DW_TAG_typedef
     648                      .dwattr $C$DW$T$69, DW_AT_name("ICLARKE")
     649                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$23)
     650                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
     651              
     652              
     653              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     654                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
     655              $C$DW$47        .dwtag  DW_TAG_member
     656                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     657                      .dwattr $C$DW$47, DW_AT_name("Vc_AB")
     658                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_Vc_AB")
     659                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     660                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     661              
     662              $C$DW$48        .dwtag  DW_TAG_member
     663                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     664                      .dwattr $C$DW$48, DW_AT_name("Vc_BC")
     665                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_Vc_BC")
     666                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     667                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     668              
     669              $C$DW$49        .dwtag  DW_TAG_member
     670                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     671                      .dwattr $C$DW$49, DW_AT_name("Vc_A")
     672                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_Vc_A")
     673                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     674                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   14

     675              
     676              $C$DW$50        .dwtag  DW_TAG_member
     677                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     678                      .dwattr $C$DW$50, DW_AT_name("Vc_B")
     679                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_Vc_B")
     680                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     681                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     682              
     683                      .dwendtag $C$DW$T$24
     684              
     685              $C$DW$T$70      .dwtag  DW_TAG_typedef
     686                      .dwattr $C$DW$T$70, DW_AT_name("VCMEAS")
     687                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$24)
     688                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
     689              
     690              
     691              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     692                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
     693              $C$DW$51        .dwtag  DW_TAG_member
     694                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     695                      .dwattr $C$DW$51, DW_AT_name("Ref")
     696                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_Ref")
     697                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     698                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     699              
     700              $C$DW$52        .dwtag  DW_TAG_member
     701                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     702                      .dwattr $C$DW$52, DW_AT_name("Fbk")
     703                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_Fbk")
     704                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     705                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     706              
     707              $C$DW$53        .dwtag  DW_TAG_member
     708                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     709                      .dwattr $C$DW$53, DW_AT_name("Out")
     710                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_Out")
     711                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     712                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     713              
     714              $C$DW$54        .dwtag  DW_TAG_member
     715                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     716                      .dwattr $C$DW$54, DW_AT_name("c1")
     717                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_c1")
     718                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     719                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     720              
     721              $C$DW$55        .dwtag  DW_TAG_member
     722                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     723                      .dwattr $C$DW$55, DW_AT_name("c2")
     724                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_c2")
     725                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     726                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     727              
     728              $C$DW$56        .dwtag  DW_TAG_member
     729                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   15

     730                      .dwattr $C$DW$56, DW_AT_name("Ref1")
     731                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_Ref1")
     732                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     733                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     734              
     735              $C$DW$57        .dwtag  DW_TAG_member
     736                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     737                      .dwattr $C$DW$57, DW_AT_name("Fbk1")
     738                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_Fbk1")
     739                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     740                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     741              
     742              $C$DW$58        .dwtag  DW_TAG_member
     743                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     744                      .dwattr $C$DW$58, DW_AT_name("We")
     745                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_We")
     746                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     747                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     748              
     749                      .dwendtag $C$DW$T$25
     750              
     751              $C$DW$T$28      .dwtag  DW_TAG_typedef
     752                      .dwattr $C$DW$T$28, DW_AT_name("PID_GRANDO_TERMINALS")
     753                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
     754                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     755              
     756              
     757              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     758                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x14)
     759              $C$DW$59        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     761                      .dwattr $C$DW$59, DW_AT_name("Kr")
     762                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_Kr")
     763                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     764                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     765              
     766              $C$DW$60        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     768                      .dwattr $C$DW$60, DW_AT_name("Bw")
     769                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_Bw")
     770                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     771                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     772              
     773              $C$DW$61        .dwtag  DW_TAG_member
     774                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     775                      .dwattr $C$DW$61, DW_AT_name("Kp")
     776                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_Kp")
     777                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     778                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     779              
     780              $C$DW$62        .dwtag  DW_TAG_member
     781                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     782                      .dwattr $C$DW$62, DW_AT_name("Ki")
     783                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_Ki")
     784                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   16

     785                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     786              
     787              $C$DW$63        .dwtag  DW_TAG_member
     788                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     789                      .dwattr $C$DW$63, DW_AT_name("Kd")
     790                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_Kd")
     791                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     792                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     793              
     794              $C$DW$64        .dwtag  DW_TAG_member
     795                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     796                      .dwattr $C$DW$64, DW_AT_name("Km")
     797                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_Km")
     798                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     799                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     800              
     801              $C$DW$65        .dwtag  DW_TAG_member
     802                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     803                      .dwattr $C$DW$65, DW_AT_name("Umax")
     804                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_Umax")
     805                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     806                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     807              
     808              $C$DW$66        .dwtag  DW_TAG_member
     809                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     810                      .dwattr $C$DW$66, DW_AT_name("Umin")
     811                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_Umin")
     812                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     813                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     814              
     815              $C$DW$67        .dwtag  DW_TAG_member
     816                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     817                      .dwattr $C$DW$67, DW_AT_name("sig")
     818                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_sig")
     819                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     820                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     821              
     822              $C$DW$68        .dwtag  DW_TAG_member
     823                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     824                      .dwattr $C$DW$68, DW_AT_name("La")
     825                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_La")
     826                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     827                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     828              
     829                      .dwendtag $C$DW$T$26
     830              
     831              $C$DW$T$29      .dwtag  DW_TAG_typedef
     832                      .dwattr $C$DW$T$29, DW_AT_name("PID_GRANDO_PARAMETERS")
     833                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
     834                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
     835              
     836              
     837              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     838                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x18)
     839              $C$DW$69        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   17

     840                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     841                      .dwattr $C$DW$69, DW_AT_name("up")
     842                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_up")
     843                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     844                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     845              
     846              $C$DW$70        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$70, DW_AT_name("ui")
     849                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_ui")
     850                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     851                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     852              
     853              $C$DW$71        .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     855                      .dwattr $C$DW$71, DW_AT_name("ud")
     856                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_ud")
     857                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     858                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     859              
     860              $C$DW$72        .dwtag  DW_TAG_member
     861                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     862                      .dwattr $C$DW$72, DW_AT_name("p1")
     863                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_p1")
     864                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     865                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     866              
     867              $C$DW$73        .dwtag  DW_TAG_member
     868                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     869                      .dwattr $C$DW$73, DW_AT_name("v1")
     870                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_v1")
     871                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     872                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     873              
     874              $C$DW$74        .dwtag  DW_TAG_member
     875                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     876                      .dwattr $C$DW$74, DW_AT_name("i1")
     877                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_i1")
     878                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     879                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     880              
     881              $C$DW$75        .dwtag  DW_TAG_member
     882                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     883                      .dwattr $C$DW$75, DW_AT_name("d1")
     884                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_d1")
     885                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     886                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     887              
     888              $C$DW$76        .dwtag  DW_TAG_member
     889                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     890                      .dwattr $C$DW$76, DW_AT_name("d2")
     891                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_d2")
     892                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     893                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     894              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   18

     895              $C$DW$77        .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     897                      .dwattr $C$DW$77, DW_AT_name("w1")
     898                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_w1")
     899                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     900                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     901              
     902              $C$DW$78        .dwtag  DW_TAG_member
     903                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     904                      .dwattr $C$DW$78, DW_AT_name("uc")
     905                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_uc")
     906                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     907                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     908              
     909              $C$DW$79        .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     911                      .dwattr $C$DW$79, DW_AT_name("p2")
     912                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_p2")
     913                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     914                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     915              
     916              $C$DW$80        .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     918                      .dwattr $C$DW$80, DW_AT_name("i2")
     919                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_i2")
     920                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     921                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     922              
     923                      .dwendtag $C$DW$T$27
     924              
     925              $C$DW$T$30      .dwtag  DW_TAG_typedef
     926                      .dwattr $C$DW$T$30, DW_AT_name("PID_GRANDO_DATA")
     927                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$27)
     928                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
     929              
     930              
     931              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     932                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x3c)
     933              $C$DW$81        .dwtag  DW_TAG_member
     934                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$28)
     935                      .dwattr $C$DW$81, DW_AT_name("term")
     936                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_term")
     937                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     938                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     939              
     940              $C$DW$82        .dwtag  DW_TAG_member
     941                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$29)
     942                      .dwattr $C$DW$82, DW_AT_name("param")
     943                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_param")
     944                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     945                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     946              
     947              $C$DW$83        .dwtag  DW_TAG_member
     948                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$30)
     949                      .dwattr $C$DW$83, DW_AT_name("data")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   19

     950                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_data")
     951                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     952                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     953              
     954                      .dwendtag $C$DW$T$31
     955              
     956              $C$DW$T$71      .dwtag  DW_TAG_typedef
     957                      .dwattr $C$DW$T$71, DW_AT_name("PID_GRANDO_CONTROLLER")
     958                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$31)
     959                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
     960              
     961              
     962              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     963                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x12)
     964              $C$DW$84        .dwtag  DW_TAG_member
     965                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     966                      .dwattr $C$DW$84, DW_AT_name("Ualpha")
     967                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Ualpha")
     968                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     969                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     970              
     971              $C$DW$85        .dwtag  DW_TAG_member
     972                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     973                      .dwattr $C$DW$85, DW_AT_name("Ubeta")
     974                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Ubeta")
     975                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     976                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     977              
     978              $C$DW$86        .dwtag  DW_TAG_member
     979                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     980                      .dwattr $C$DW$86, DW_AT_name("Ta")
     981                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_Ta")
     982                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     983                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     984              
     985              $C$DW$87        .dwtag  DW_TAG_member
     986                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     987                      .dwattr $C$DW$87, DW_AT_name("Tb")
     988                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_Tb")
     989                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     990                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     991              
     992              $C$DW$88        .dwtag  DW_TAG_member
     993                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     994                      .dwattr $C$DW$88, DW_AT_name("Tc")
     995                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_Tc")
     996                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     997                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     998              
     999              $C$DW$89        .dwtag  DW_TAG_member
    1000                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1001                      .dwattr $C$DW$89, DW_AT_name("tmp1")
    1002                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_tmp1")
    1003                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1004                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   20

    1005              
    1006              $C$DW$90        .dwtag  DW_TAG_member
    1007                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1008                      .dwattr $C$DW$90, DW_AT_name("tmp2")
    1009                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_tmp2")
    1010                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1011                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1012              
    1013              $C$DW$91        .dwtag  DW_TAG_member
    1014                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1015                      .dwattr $C$DW$91, DW_AT_name("tmp3")
    1016                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_tmp3")
    1017                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1018                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1019              
    1020              $C$DW$92        .dwtag  DW_TAG_member
    1021                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$32)
    1022                      .dwattr $C$DW$92, DW_AT_name("VecSector")
    1023                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_VecSector")
    1024                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1025                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1026              
    1027                      .dwendtag $C$DW$T$33
    1028              
    1029              $C$DW$T$72      .dwtag  DW_TAG_typedef
    1030                      .dwattr $C$DW$T$72, DW_AT_name("SVGEN")
    1031                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$33)
    1032                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1033              
    1034              
    1035              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1036                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x14)
    1037              $C$DW$93        .dwtag  DW_TAG_member
    1038                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1039                      .dwattr $C$DW$93, DW_AT_name("TargetValue")
    1040                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_TargetValue")
    1041                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1043              
    1044              $C$DW$94        .dwtag  DW_TAG_member
    1045                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$34)
    1046                      .dwattr $C$DW$94, DW_AT_name("RampDelayCount")
    1047                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_RampDelayCount")
    1048                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1049                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1050              
    1051              $C$DW$95        .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1053                      .dwattr $C$DW$95, DW_AT_name("Acceleration")
    1054                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_Acceleration")
    1055                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1056                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1057              
    1058              $C$DW$96        .dwtag  DW_TAG_member
    1059                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   21

    1060                      .dwattr $C$DW$96, DW_AT_name("T")
    1061                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_T")
    1062                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1063                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1064              
    1065              $C$DW$97        .dwtag  DW_TAG_member
    1066                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1067                      .dwattr $C$DW$97, DW_AT_name("Max_RPM")
    1068                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_Max_RPM")
    1069                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1070                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1071              
    1072              $C$DW$98        .dwtag  DW_TAG_member
    1073                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1074                      .dwattr $C$DW$98, DW_AT_name("SetpointRpm")
    1075                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_SetpointRpm")
    1076                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1077                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1078              
    1079              $C$DW$99        .dwtag  DW_TAG_member
    1080                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1081                      .dwattr $C$DW$99, DW_AT_name("SetpointValue")
    1082                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_SetpointValue")
    1083                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1084                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1085              
    1086              $C$DW$100       .dwtag  DW_TAG_member
    1087                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$34)
    1088                      .dwattr $C$DW$100, DW_AT_name("EqualFlag")
    1089                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_EqualFlag")
    1090                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1091                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1092              
    1093              $C$DW$101       .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1095                      .dwattr $C$DW$101, DW_AT_name("rmp_tmp")
    1096                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rmp_tmp")
    1097                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1098                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1099              
    1100              $C$DW$102       .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1102                      .dwattr $C$DW$102, DW_AT_name("rc_err")
    1103                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rc_err")
    1104                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1105                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1106              
    1107                      .dwendtag $C$DW$T$35
    1108              
    1109              $C$DW$T$73      .dwtag  DW_TAG_typedef
    1110                      .dwattr $C$DW$T$73, DW_AT_name("RMPCELE")
    1111                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$35)
    1112                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1113              
    1114              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   22

    1115              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1116                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0c)
    1117              $C$DW$103       .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1119                      .dwattr $C$DW$103, DW_AT_name("Freq")
    1120                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_Freq")
    1121                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1122                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1123              
    1124              $C$DW$104       .dwtag  DW_TAG_member
    1125                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1126                      .dwattr $C$DW$104, DW_AT_name("StepAngleMax")
    1127                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_StepAngleMax")
    1128                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1129                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1130              
    1131              $C$DW$105       .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1133                      .dwattr $C$DW$105, DW_AT_name("Angle")
    1134                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_Angle")
    1135                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1136                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1137              
    1138              $C$DW$106       .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1140                      .dwattr $C$DW$106, DW_AT_name("Gain")
    1141                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_Gain")
    1142                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1143                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1144              
    1145              $C$DW$107       .dwtag  DW_TAG_member
    1146                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1147                      .dwattr $C$DW$107, DW_AT_name("Out")
    1148                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_Out")
    1149                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1150                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1151              
    1152              $C$DW$108       .dwtag  DW_TAG_member
    1153                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1154                      .dwattr $C$DW$108, DW_AT_name("Offset")
    1155                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_Offset")
    1156                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1157                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1158              
    1159                      .dwendtag $C$DW$T$36
    1160              
    1161              $C$DW$T$74      .dwtag  DW_TAG_typedef
    1162                      .dwattr $C$DW$T$74, DW_AT_name("RAMPGEN")
    1163                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$36)
    1164                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1165              
    1166              
    1167              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1168                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x16)
    1169              $C$DW$109       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   23

    1170                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1171                      .dwattr $C$DW$109, DW_AT_name("DcBusVolt")
    1172                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_DcBusVolt")
    1173                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1174                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1175              
    1176              $C$DW$110       .dwtag  DW_TAG_member
    1177                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1178                      .dwattr $C$DW$110, DW_AT_name("MfuncV1")
    1179                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_MfuncV1")
    1180                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1181                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1182              
    1183              $C$DW$111       .dwtag  DW_TAG_member
    1184                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1185                      .dwattr $C$DW$111, DW_AT_name("MfuncV2")
    1186                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_MfuncV2")
    1187                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1188                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1189              
    1190              $C$DW$112       .dwtag  DW_TAG_member
    1191                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1192                      .dwattr $C$DW$112, DW_AT_name("MfuncV3")
    1193                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_MfuncV3")
    1194                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1195                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1196              
    1197              $C$DW$113       .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$32)
    1199                      .dwattr $C$DW$113, DW_AT_name("OutOfPhase")
    1200                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_OutOfPhase")
    1201                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1202                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1203              
    1204              $C$DW$114       .dwtag  DW_TAG_member
    1205                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1206                      .dwattr $C$DW$114, DW_AT_name("VphaseA")
    1207                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_VphaseA")
    1208                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1209                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1210              
    1211              $C$DW$115       .dwtag  DW_TAG_member
    1212                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1213                      .dwattr $C$DW$115, DW_AT_name("VphaseB")
    1214                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_VphaseB")
    1215                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1216                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1217              
    1218              $C$DW$116       .dwtag  DW_TAG_member
    1219                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1220                      .dwattr $C$DW$116, DW_AT_name("VphaseC")
    1221                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_VphaseC")
    1222                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1223                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1224              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   24

    1225              $C$DW$117       .dwtag  DW_TAG_member
    1226                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1227                      .dwattr $C$DW$117, DW_AT_name("Valpha")
    1228                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_Valpha")
    1229                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1230                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1231              
    1232              $C$DW$118       .dwtag  DW_TAG_member
    1233                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1234                      .dwattr $C$DW$118, DW_AT_name("Vbeta")
    1235                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_Vbeta")
    1236                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1237                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1238              
    1239              $C$DW$119       .dwtag  DW_TAG_member
    1240                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1241                      .dwattr $C$DW$119, DW_AT_name("temp")
    1242                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_temp")
    1243                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1244                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1245              
    1246                      .dwendtag $C$DW$T$37
    1247              
    1248              $C$DW$T$75      .dwtag  DW_TAG_typedef
    1249                      .dwattr $C$DW$T$75, DW_AT_name("PHASEVOLTAGE")
    1250                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$37)
    1251                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1252              
    1253              
    1254              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1255                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x14)
    1256              $C$DW$120       .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1258                      .dwattr $C$DW$120, DW_AT_name("ElecTheta")
    1259                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_ElecTheta")
    1260                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1261                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1262              
    1263              $C$DW$121       .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$34)
    1265                      .dwattr $C$DW$121, DW_AT_name("DirectionQep")
    1266                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_DirectionQep")
    1267                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1268                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1269              
    1270              $C$DW$122       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1272                      .dwattr $C$DW$122, DW_AT_name("OldElecTheta")
    1273                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_OldElecTheta")
    1274                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1275                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1276              
    1277              $C$DW$123       .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1279                      .dwattr $C$DW$123, DW_AT_name("Speed")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   25

    1280                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_Speed")
    1281                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1282                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1283              
    1284              $C$DW$124       .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$34)
    1286                      .dwattr $C$DW$124, DW_AT_name("BaseRpm")
    1287                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_BaseRpm")
    1288                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1289                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1290              
    1291              $C$DW$125       .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$38)
    1293                      .dwattr $C$DW$125, DW_AT_name("K1")
    1294                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_K1")
    1295                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1296                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1297              
    1298              $C$DW$126       .dwtag  DW_TAG_member
    1299                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1300                      .dwattr $C$DW$126, DW_AT_name("K2")
    1301                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_K2")
    1302                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1303                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1304              
    1305              $C$DW$127       .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1307                      .dwattr $C$DW$127, DW_AT_name("K3")
    1308                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_K3")
    1309                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1310                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1311              
    1312              $C$DW$128       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$39)
    1314                      .dwattr $C$DW$128, DW_AT_name("SpeedRpm")
    1315                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_SpeedRpm")
    1316                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1317                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1318              
    1319              $C$DW$129       .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1321                      .dwattr $C$DW$129, DW_AT_name("Tmp")
    1322                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_Tmp")
    1323                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1324                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1325              
    1326                      .dwendtag $C$DW$T$40
    1327              
    1328              $C$DW$T$76      .dwtag  DW_TAG_typedef
    1329                      .dwattr $C$DW$T$76, DW_AT_name("SPEED_MEAS_QEP")
    1330                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$40)
    1331                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1332              
    1333              
    1334              $C$DW$T$42      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   26

    1335                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x12)
    1336              $C$DW$130       .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$41)
    1338                      .dwattr $C$DW$130, DW_AT_name("ElecTheta")
    1339                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_ElecTheta")
    1340                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1341                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1342              
    1343              $C$DW$131       .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$41)
    1345                      .dwattr $C$DW$131, DW_AT_name("MechTheta")
    1346                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_MechTheta")
    1347                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1348                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1349              
    1350              $C$DW$132       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$32)
    1352                      .dwattr $C$DW$132, DW_AT_name("DirectionQep")
    1353                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_DirectionQep")
    1354                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1355                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1356              
    1357              $C$DW$133       .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$32)
    1359                      .dwattr $C$DW$133, DW_AT_name("QepPeriod")
    1360                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_QepPeriod")
    1361                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1362                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1363              
    1364              $C$DW$134       .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$34)
    1366                      .dwattr $C$DW$134, DW_AT_name("QepCountIndex")
    1367                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_QepCountIndex")
    1368                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1369                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1370              
    1371              $C$DW$135       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$39)
    1373                      .dwattr $C$DW$135, DW_AT_name("RawTheta")
    1374                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_RawTheta")
    1375                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1376                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1377              
    1378              $C$DW$136       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$41)
    1380                      .dwattr $C$DW$136, DW_AT_name("MechScaler")
    1381                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_MechScaler")
    1382                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1383                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1384              
    1385              $C$DW$137       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$32)
    1387                      .dwattr $C$DW$137, DW_AT_name("LineEncoder")
    1388                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_LineEncoder")
    1389                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   27

    1390                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1391              
    1392              $C$DW$138       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$32)
    1394                      .dwattr $C$DW$138, DW_AT_name("PolePairs")
    1395                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_PolePairs")
    1396                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1397                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1398              
    1399              $C$DW$139       .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$39)
    1401                      .dwattr $C$DW$139, DW_AT_name("CalibratedAngle")
    1402                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_CalibratedAngle")
    1403                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1404                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1405              
    1406              $C$DW$140       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$32)
    1408                      .dwattr $C$DW$140, DW_AT_name("IndexSyncFlag")
    1409                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_IndexSyncFlag")
    1410                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1411                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1412              
    1413                      .dwendtag $C$DW$T$42
    1414              
    1415              $C$DW$T$77      .dwtag  DW_TAG_typedef
    1416                      .dwattr $C$DW$T$77, DW_AT_name("QEP")
    1417                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$42)
    1418                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1419              
    1420              
    1421              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1422                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x07)
    1423              $C$DW$141       .dwtag  DW_TAG_member
    1424                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$43)
    1425                      .dwattr $C$DW$141, DW_AT_name("stat_reg1")
    1426                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_stat_reg1")
    1427                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1428                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1429              
    1430              $C$DW$142       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$44)
    1432                      .dwattr $C$DW$142, DW_AT_name("stat_reg2")
    1433                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_stat_reg2")
    1434                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1435                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1436              
    1437              $C$DW$143       .dwtag  DW_TAG_member
    1438                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$45)
    1439                      .dwattr $C$DW$143, DW_AT_name("cntrl_reg1")
    1440                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_cntrl_reg1")
    1441                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1442                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1443              
    1444              $C$DW$144       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   28

    1445                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$46)
    1446                      .dwattr $C$DW$144, DW_AT_name("cntrl_reg2")
    1447                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_cntrl_reg2")
    1448                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1449                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1450              
    1451              $C$DW$145       .dwtag  DW_TAG_member
    1452                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$32)
    1453                      .dwattr $C$DW$145, DW_AT_name("readCntrl1")
    1454                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_readCntrl1")
    1455                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1456                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1457              
    1458              $C$DW$146       .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$32)
    1460                      .dwattr $C$DW$146, DW_AT_name("readCntrl2")
    1461                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_readCntrl2")
    1462                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1463                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1464              
    1465              $C$DW$147       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$32)
    1467                      .dwattr $C$DW$147, DW_AT_name("DRV_fault")
    1468                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_DRV_fault")
    1469                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1470                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1471              
    1472                      .dwendtag $C$DW$T$47
    1473              
    1474              $C$DW$T$78      .dwtag  DW_TAG_typedef
    1475                      .dwattr $C$DW$T$78, DW_AT_name("DRV8301_Vars")
    1476                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$47)
    1477                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1478              
    1479              
    1480              $C$DW$T$59      .dwtag  DW_TAG_structure_type
    1481                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x15)
    1482              $C$DW$148       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$32)
    1484                      .dwattr $C$DW$148, DW_AT_name("Rsvd0")
    1485                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_Rsvd0")
    1486                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1487                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1488              
    1489              $C$DW$149       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$48)
    1491                      .dwattr $C$DW$149, DW_AT_name("status1_wwd")
    1492                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_status1_wwd")
    1493                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1494                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1495              
    1496              $C$DW$150       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$49)
    1498                      .dwattr $C$DW$150, DW_AT_name("status2_ov_vds")
    1499                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_status2_ov_vds")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   29

    1500                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1501                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1502              
    1503              $C$DW$151       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$50)
    1505                      .dwattr $C$DW$151, DW_AT_name("status3_IC")
    1506                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_status3_IC")
    1507                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1508                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1509              
    1510              $C$DW$152       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$51)
    1512                      .dwattr $C$DW$152, DW_AT_name("status4_gd_Vgs")
    1513                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    1514                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1515                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1516              
    1517              $C$DW$153       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$52)
    1519                      .dwattr $C$DW$153, DW_AT_name("cntrl5_hs_gd")
    1520                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    1521                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1522                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524              $C$DW$154       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$53)
    1526                      .dwattr $C$DW$154, DW_AT_name("cntrl6_ls_gd")
    1527                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    1528                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1529                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1530              
    1531              $C$DW$155       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$54)
    1533                      .dwattr $C$DW$155, DW_AT_name("cntrl7_gd")
    1534                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_cntrl7_gd")
    1535                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1536                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1537              
    1538              $C$DW$156       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$32)
    1540                      .dwattr $C$DW$156, DW_AT_name("Rsvd8")
    1541                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_Rsvd8")
    1542                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1543                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1544              
    1545              $C$DW$157       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$55)
    1547                      .dwattr $C$DW$157, DW_AT_name("cntrl9_IC_ops")
    1548                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    1549                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1550                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1551              
    1552              $C$DW$158       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$56)
    1554                      .dwattr $C$DW$158, DW_AT_name("cntrlA_shunt_amp")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   30

    1555                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    1556                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1557                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1558              
    1559              $C$DW$159       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$57)
    1561                      .dwattr $C$DW$159, DW_AT_name("cntrlB_Vreg")
    1562                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    1563                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1564                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1565              
    1566              $C$DW$160       .dwtag  DW_TAG_member
    1567                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$58)
    1568                      .dwattr $C$DW$160, DW_AT_name("cntrlC_Vds_SNS")
    1569                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
    1570                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1571                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1572              
    1573              $C$DW$161       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$32)
    1575                      .dwattr $C$DW$161, DW_AT_name("readCntrl5")
    1576                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_readCntrl5")
    1577                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1578                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1579              
    1580              $C$DW$162       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$32)
    1582                      .dwattr $C$DW$162, DW_AT_name("readCntrl6")
    1583                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_readCntrl6")
    1584                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1585                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1586              
    1587              $C$DW$163       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$32)
    1589                      .dwattr $C$DW$163, DW_AT_name("readCntrl7")
    1590                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_readCntrl7")
    1591                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1592                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1593              
    1594              $C$DW$164       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$32)
    1596                      .dwattr $C$DW$164, DW_AT_name("readCntrl9")
    1597                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_readCntrl9")
    1598                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1599                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1600              
    1601              $C$DW$165       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$32)
    1603                      .dwattr $C$DW$165, DW_AT_name("readCntrlA")
    1604                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_readCntrlA")
    1605                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1606                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1607              
    1608              $C$DW$166       .dwtag  DW_TAG_member
    1609                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   31

    1610                      .dwattr $C$DW$166, DW_AT_name("readCntrlB")
    1611                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_readCntrlB")
    1612                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1613                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1614              
    1615              $C$DW$167       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$32)
    1617                      .dwattr $C$DW$167, DW_AT_name("readCntrlC")
    1618                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_readCntrlC")
    1619                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1620                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1621              
    1622              $C$DW$168       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$32)
    1624                      .dwattr $C$DW$168, DW_AT_name("DRV_fault")
    1625                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_DRV_fault")
    1626                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1627                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1628              
    1629                      .dwendtag $C$DW$T$59
    1630              
    1631              $C$DW$T$79      .dwtag  DW_TAG_typedef
    1632                      .dwattr $C$DW$T$79, DW_AT_name("DRV8305_Vars")
    1633                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$59)
    1634                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1635              
    1636              
    1637              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    1638                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x3d4)
    1639              $C$DW$169       .dwtag  DW_TAG_member
    1640                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$61)
    1641                      .dwattr $C$DW$169, DW_AT_name("PwmARegs")
    1642                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PwmARegs")
    1643                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1644                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1645              
    1646              $C$DW$170       .dwtag  DW_TAG_member
    1647                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$61)
    1648                      .dwattr $C$DW$170, DW_AT_name("PwmBRegs")
    1649                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PwmBRegs")
    1650                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1651                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1652              
    1653              $C$DW$171       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$61)
    1655                      .dwattr $C$DW$171, DW_AT_name("PwmCRegs")
    1656                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PwmCRegs")
    1657                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1658                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1659              
    1660              $C$DW$172       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$63)
    1662                      .dwattr $C$DW$172, DW_AT_name("QepRegs")
    1663                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_QepRegs")
    1664                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   32

    1665                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1666              
    1667              $C$DW$173       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$65)
    1669                      .dwattr $C$DW$173, DW_AT_name("SpiRegs")
    1670                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_SpiRegs")
    1671                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1672                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1673              
    1674              $C$DW$174       .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$32)
    1676                      .dwattr $C$DW$174, DW_AT_name("drvScsPin")
    1677                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_drvScsPin")
    1678                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1679                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1680              
    1681              $C$DW$175       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1683                      .dwattr $C$DW$175, DW_AT_name("offset_shntA")
    1684                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_offset_shntA")
    1685                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1686                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1687              
    1688              $C$DW$176       .dwtag  DW_TAG_member
    1689                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1690                      .dwattr $C$DW$176, DW_AT_name("offset_shntB")
    1691                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_offset_shntB")
    1692                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1693                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1694              
    1695              $C$DW$177       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1697                      .dwattr $C$DW$177, DW_AT_name("offset_As")
    1698                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_offset_As")
    1699                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1700                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1701              
    1702              $C$DW$178       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1704                      .dwattr $C$DW$178, DW_AT_name("offset_Bs")
    1705                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_offset_Bs")
    1706                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1707                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1708              
    1709              $C$DW$179       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1711                      .dwattr $C$DW$179, DW_AT_name("offset_ABV")
    1712                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_offset_ABV")
    1713                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1714                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1715              
    1716              $C$DW$180       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1718                      .dwattr $C$DW$180, DW_AT_name("offset_BCV")
    1719                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_offset_BCV")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:53 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
