TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Fri Jul 31 12:17:35 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Chiaming\CCSworkspace_V10\MonoMtrServo_377s\F2837x_RAM")
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("SDFM")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SDFM")

    2420                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_sdfmNumber")
    2421                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    2422                      .dwattr $C$DW$79, DW_AT_location[DW_OP_reg12]
    2423              
    2424              $C$DW$80        .dwtag  DW_TAG_formal_parameter
    2425                      .dwattr $C$DW$80, DW_AT_name("sdfmReadFlagRegister")
    2426                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_sdfmReadFlagRegister")
    2427                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$55)
    2428                      .dwattr $C$DW$80, DW_AT_location[DW_OP_reg0]
    2429              
    2430              
    2431              ;***************************************************************
    2432              ;* FNAME: _Sdfm_clearFlagRegister       FR SIZE:   4           *
    2433              ;*                                                             *
    2434              ;* FUNCTION ENVIRONMENT                                        *
    2435              ;*                                                             *
    2436              ;* FUNCTION PROPERTIES                                         *
    2437              ;*                            0 Parameter,  3 Auto,  0 SOE     *
    2438              ;***************************************************************
    2439              
    2440 00000760       _Sdfm_clearFlagRegister:
    2441                      .dwcfi  cfa_offset, -2
    2442                      .dwcfi  save_reg_to_mem, 26, 0
    2443 00000760 FE04          ADDB      SP,#4                 ; [CPU_ARAU] 
    2444                      .dwcfi  cfa_offset, -6
    2445              $C$DW$81        .dwtag  DW_TAG_variable
    2446                      .dwattr $C$DW$81, DW_AT_name("sdfmReadFlagRegister")
    2447                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_sdfmReadFlagRegister")
    2448                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$55)
    2449                      .dwattr $C$DW$81, DW_AT_location[DW_OP_breg20 -2]
    2450              
    2451              $C$DW$82        .dwtag  DW_TAG_variable
    2452                      .dwattr $C$DW$82, DW_AT_name("sdfmNumber")
    2453                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_sdfmNumber")
    2454                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    2455                      .dwattr $C$DW$82, DW_AT_location[DW_OP_breg20 -3]
    2456              
    2457 00000761 7C43          MOV       *-SP[3],AR4           ; [CPU_ALU] |403| 
    2458 00000762 1E42          MOVL      *-SP[2],ACC           ; [CPU_ALU] |403| 
    2459                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_sdfm_drive
    2460 00000763 2901          CLRC      SXM                   ; [CPU_ALU] 
    2461 00000764 8F00!         MOVL      XAR4,#_SDFM           ; [CPU_ARAU] |404| 
         00000765 0000 
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   55

    2462 00000766 5603          MOV       ACC,*-SP[3] << 1      ; [CPU_ALU] |404| 
         00000767 0143 
    2463 00000768 5601          ADDL      XAR4,ACC              ; [CPU_ALU] |404| 
         00000769 00A4 
    2464 0000076a 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_ALU] |404| 
    2465 0000076b 0642          MOVL      ACC,*-SP[2]           ; [CPU_ALU] |404| 
    2466 0000076c 1ED4          MOVL      *+XAR4[2],ACC         ; [CPU_ALU] |404| 
    2467                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_sdfm_drive
    2468 0000076d FE84          SUBB      SP,#4                 ; [CPU_ARAU] 
    2469                      .dwcfi  cfa_offset, -2
    2470              $C$DW$83        .dwtag  DW_TAG_TI_branch
    2471                      .dwattr $C$DW$83, DW_AT_low_pc(0x00)
    2472                      .dwattr $C$DW$83, DW_AT_TI_return
    2473              
    2474 0000076e 0006          LRETR     ; [CPU_ALU] 
    2475                      ; return occurs ; [] 
    2476                      .dwattr $C$DW$78, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/so
    2477                      .dwattr $C$DW$78, DW_AT_TI_end_line(0x195)
    2478                      .dwattr $C$DW$78, DW_AT_TI_end_column(0x01)
    2479                      .dwendentry
    2480                      .dwendtag $C$DW$78
    2481              
    2482              ;**************************************************************
    2483              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2484              ;**************************************************************
    2485                      .global _SDFM
    2486              
    2487              ;***************************************************************
    2488              ;* TYPE INFORMATION                                            *
    2489              ;***************************************************************
    2490              
    2491              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2492                      .dwattr $C$DW$T$20, DW_AT_name("SDCMPH1_BITS")
    2493                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    2494              $C$DW$84        .dwtag  DW_TAG_member
    2495                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    2496                      .dwattr $C$DW$84, DW_AT_name("HLT")
    2497                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_HLT")
    2498                      .dwattr $C$DW$84, DW_AT_bit_offset(0x01)
    2499                      .dwattr $C$DW$84, DW_AT_bit_size(0x0f)
    2500                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2501                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    2502              
    2503              $C$DW$85        .dwtag  DW_TAG_member
    2504                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    2505                      .dwattr $C$DW$85, DW_AT_name("rsvd1")
    2506                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd1")
    2507                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
    2508                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    2509                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2510                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    2511              
    2512                      .dwendtag $C$DW$T$20
    2513              
    2514              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   56

    2515              $C$DW$T$21      .dwtag  DW_TAG_union_type
    2516                      .dwattr $C$DW$T$21, DW_AT_name("SDCMPH1_REG")
    2517                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    2518              $C$DW$86        .dwtag  DW_TAG_member
    2519                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    2520                      .dwattr $C$DW$86, DW_AT_name("all")
    2521                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
    2522                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2523                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    2524              
    2525              $C$DW$87        .dwtag  DW_TAG_member
    2526                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
    2527                      .dwattr $C$DW$87, DW_AT_name("bit")
    2528                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
    2529                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2530                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    2531              
    2532                      .dwendtag $C$DW$T$21
    2533              
    2534              
    2535              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2536                      .dwattr $C$DW$T$22, DW_AT_name("SDCMPH2_BITS")
    2537                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    2538              $C$DW$88        .dwtag  DW_TAG_member
    2539                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    2540                      .dwattr $C$DW$88, DW_AT_name("HLT")
    2541                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_HLT")
    2542                      .dwattr $C$DW$88, DW_AT_bit_offset(0x01)
    2543                      .dwattr $C$DW$88, DW_AT_bit_size(0x0f)
    2544                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2545                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    2546              
    2547              $C$DW$89        .dwtag  DW_TAG_member
    2548                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    2549                      .dwattr $C$DW$89, DW_AT_name("rsvd1")
    2550                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd1")
    2551                      .dwattr $C$DW$89, DW_AT_bit_offset(0x00)
    2552                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    2553                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2554                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    2555              
    2556                      .dwendtag $C$DW$T$22
    2557              
    2558              
    2559              $C$DW$T$23      .dwtag  DW_TAG_union_type
    2560                      .dwattr $C$DW$T$23, DW_AT_name("SDCMPH2_REG")
    2561                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    2562              $C$DW$90        .dwtag  DW_TAG_member
    2563                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    2564                      .dwattr $C$DW$90, DW_AT_name("all")
    2565                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_all")
    2566                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2567                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    2568              
    2569              $C$DW$91        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   57

    2570                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$22)
    2571                      .dwattr $C$DW$91, DW_AT_name("bit")
    2572                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_bit")
    2573                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2574                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2575              
    2576                      .dwendtag $C$DW$T$23
    2577              
    2578              
    2579              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2580                      .dwattr $C$DW$T$24, DW_AT_name("SDCMPH3_BITS")
    2581                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    2582              $C$DW$92        .dwtag  DW_TAG_member
    2583                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    2584                      .dwattr $C$DW$92, DW_AT_name("HLT")
    2585                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_HLT")
    2586                      .dwattr $C$DW$92, DW_AT_bit_offset(0x01)
    2587                      .dwattr $C$DW$92, DW_AT_bit_size(0x0f)
    2588                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2589                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2590              
    2591              $C$DW$93        .dwtag  DW_TAG_member
    2592                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    2593                      .dwattr $C$DW$93, DW_AT_name("rsvd1")
    2594                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd1")
    2595                      .dwattr $C$DW$93, DW_AT_bit_offset(0x00)
    2596                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    2597                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2598                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2599              
    2600                      .dwendtag $C$DW$T$24
    2601              
    2602              
    2603              $C$DW$T$25      .dwtag  DW_TAG_union_type
    2604                      .dwattr $C$DW$T$25, DW_AT_name("SDCMPH3_REG")
    2605                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    2606              $C$DW$94        .dwtag  DW_TAG_member
    2607                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    2608                      .dwattr $C$DW$94, DW_AT_name("all")
    2609                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_all")
    2610                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2611                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2612              
    2613              $C$DW$95        .dwtag  DW_TAG_member
    2614                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$24)
    2615                      .dwattr $C$DW$95, DW_AT_name("bit")
    2616                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_bit")
    2617                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2618                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2619              
    2620                      .dwendtag $C$DW$T$25
    2621              
    2622              
    2623              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2624                      .dwattr $C$DW$T$26, DW_AT_name("SDCMPH4_BITS")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   58

    2625                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    2626              $C$DW$96        .dwtag  DW_TAG_member
    2627                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    2628                      .dwattr $C$DW$96, DW_AT_name("HLT")
    2629                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_HLT")
    2630                      .dwattr $C$DW$96, DW_AT_bit_offset(0x01)
    2631                      .dwattr $C$DW$96, DW_AT_bit_size(0x0f)
    2632                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2633                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2634              
    2635              $C$DW$97        .dwtag  DW_TAG_member
    2636                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    2637                      .dwattr $C$DW$97, DW_AT_name("rsvd1")
    2638                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd1")
    2639                      .dwattr $C$DW$97, DW_AT_bit_offset(0x00)
    2640                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    2641                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2642                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2643              
    2644                      .dwendtag $C$DW$T$26
    2645              
    2646              
    2647              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2648                      .dwattr $C$DW$T$27, DW_AT_name("SDCMPH4_REG")
    2649                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2650              $C$DW$98        .dwtag  DW_TAG_member
    2651                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    2652                      .dwattr $C$DW$98, DW_AT_name("all")
    2653                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_all")
    2654                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2655                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2656              
    2657              $C$DW$99        .dwtag  DW_TAG_member
    2658                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$26)
    2659                      .dwattr $C$DW$99, DW_AT_name("bit")
    2660                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_bit")
    2661                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2662                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2663              
    2664                      .dwendtag $C$DW$T$27
    2665              
    2666              
    2667              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2668                      .dwattr $C$DW$T$28, DW_AT_name("SDCMPL1_BITS")
    2669                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2670              $C$DW$100       .dwtag  DW_TAG_member
    2671                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    2672                      .dwattr $C$DW$100, DW_AT_name("LLT")
    2673                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_LLT")
    2674                      .dwattr $C$DW$100, DW_AT_bit_offset(0x01)
    2675                      .dwattr $C$DW$100, DW_AT_bit_size(0x0f)
    2676                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2677                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2678              
    2679              $C$DW$101       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   59

    2680                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    2681                      .dwattr $C$DW$101, DW_AT_name("rsvd1")
    2682                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd1")
    2683                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    2684                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    2685                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2686                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2687              
    2688                      .dwendtag $C$DW$T$28
    2689              
    2690              
    2691              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2692                      .dwattr $C$DW$T$29, DW_AT_name("SDCMPL1_REG")
    2693                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2694              $C$DW$102       .dwtag  DW_TAG_member
    2695                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    2696                      .dwattr $C$DW$102, DW_AT_name("all")
    2697                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_all")
    2698                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2699                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2700              
    2701              $C$DW$103       .dwtag  DW_TAG_member
    2702                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$28)
    2703                      .dwattr $C$DW$103, DW_AT_name("bit")
    2704                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_bit")
    2705                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2706                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2707              
    2708                      .dwendtag $C$DW$T$29
    2709              
    2710              
    2711              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2712                      .dwattr $C$DW$T$30, DW_AT_name("SDCMPL2_BITS")
    2713                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2714              $C$DW$104       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    2716                      .dwattr $C$DW$104, DW_AT_name("LLT")
    2717                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_LLT")
    2718                      .dwattr $C$DW$104, DW_AT_bit_offset(0x01)
    2719                      .dwattr $C$DW$104, DW_AT_bit_size(0x0f)
    2720                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2721                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2722              
    2723              $C$DW$105       .dwtag  DW_TAG_member
    2724                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2725                      .dwattr $C$DW$105, DW_AT_name("rsvd1")
    2726                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd1")
    2727                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    2728                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    2729                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2730                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2731              
    2732                      .dwendtag $C$DW$T$30
    2733              
    2734              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   60

    2735              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2736                      .dwattr $C$DW$T$31, DW_AT_name("SDCMPL2_REG")
    2737                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2738              $C$DW$106       .dwtag  DW_TAG_member
    2739                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    2740                      .dwattr $C$DW$106, DW_AT_name("all")
    2741                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    2742                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2743                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2744              
    2745              $C$DW$107       .dwtag  DW_TAG_member
    2746                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$30)
    2747                      .dwattr $C$DW$107, DW_AT_name("bit")
    2748                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    2749                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2750                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2751              
    2752                      .dwendtag $C$DW$T$31
    2753              
    2754              
    2755              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2756                      .dwattr $C$DW$T$32, DW_AT_name("SDCMPL3_BITS")
    2757                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2758              $C$DW$108       .dwtag  DW_TAG_member
    2759                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    2760                      .dwattr $C$DW$108, DW_AT_name("LLT")
    2761                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_LLT")
    2762                      .dwattr $C$DW$108, DW_AT_bit_offset(0x01)
    2763                      .dwattr $C$DW$108, DW_AT_bit_size(0x0f)
    2764                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2765                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2766              
    2767              $C$DW$109       .dwtag  DW_TAG_member
    2768                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2769                      .dwattr $C$DW$109, DW_AT_name("rsvd1")
    2770                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd1")
    2771                      .dwattr $C$DW$109, DW_AT_bit_offset(0x00)
    2772                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    2773                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2774                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2775              
    2776                      .dwendtag $C$DW$T$32
    2777              
    2778              
    2779              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2780                      .dwattr $C$DW$T$33, DW_AT_name("SDCMPL3_REG")
    2781                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2782              $C$DW$110       .dwtag  DW_TAG_member
    2783                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2784                      .dwattr $C$DW$110, DW_AT_name("all")
    2785                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_all")
    2786                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2787                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2788              
    2789              $C$DW$111       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   61

    2790                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$32)
    2791                      .dwattr $C$DW$111, DW_AT_name("bit")
    2792                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_bit")
    2793                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2794                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2795              
    2796                      .dwendtag $C$DW$T$33
    2797              
    2798              
    2799              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2800                      .dwattr $C$DW$T$34, DW_AT_name("SDCMPL4_BITS")
    2801                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2802              $C$DW$112       .dwtag  DW_TAG_member
    2803                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2804                      .dwattr $C$DW$112, DW_AT_name("LLT")
    2805                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_LLT")
    2806                      .dwattr $C$DW$112, DW_AT_bit_offset(0x01)
    2807                      .dwattr $C$DW$112, DW_AT_bit_size(0x0f)
    2808                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2809                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2810              
    2811              $C$DW$113       .dwtag  DW_TAG_member
    2812                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2813                      .dwattr $C$DW$113, DW_AT_name("rsvd1")
    2814                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd1")
    2815                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00)
    2816                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    2817                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2818                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2819              
    2820                      .dwendtag $C$DW$T$34
    2821              
    2822              
    2823              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2824                      .dwattr $C$DW$T$35, DW_AT_name("SDCMPL4_REG")
    2825                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2826              $C$DW$114       .dwtag  DW_TAG_member
    2827                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2828                      .dwattr $C$DW$114, DW_AT_name("all")
    2829                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_all")
    2830                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2831                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2832              
    2833              $C$DW$115       .dwtag  DW_TAG_member
    2834                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$34)
    2835                      .dwattr $C$DW$115, DW_AT_name("bit")
    2836                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_bit")
    2837                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2838                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2839              
    2840                      .dwendtag $C$DW$T$35
    2841              
    2842              
    2843              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2844                      .dwattr $C$DW$T$36, DW_AT_name("SDCPARM1_BITS")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   62

    2845                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2846              $C$DW$116       .dwtag  DW_TAG_member
    2847                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2848                      .dwattr $C$DW$116, DW_AT_name("COSR")
    2849                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_COSR")
    2850                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0b)
    2851                      .dwattr $C$DW$116, DW_AT_bit_size(0x05)
    2852                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2853                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2854              
    2855              $C$DW$117       .dwtag  DW_TAG_member
    2856                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2857                      .dwattr $C$DW$117, DW_AT_name("IEH")
    2858                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_IEH")
    2859                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0a)
    2860                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    2861                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2862                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2863              
    2864              $C$DW$118       .dwtag  DW_TAG_member
    2865                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2866                      .dwattr $C$DW$118, DW_AT_name("IEL")
    2867                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_IEL")
    2868                      .dwattr $C$DW$118, DW_AT_bit_offset(0x09)
    2869                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    2870                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2871                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2872              
    2873              $C$DW$119       .dwtag  DW_TAG_member
    2874                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2875                      .dwattr $C$DW$119, DW_AT_name("CS1_CS0")
    2876                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_CS1_CS0")
    2877                      .dwattr $C$DW$119, DW_AT_bit_offset(0x07)
    2878                      .dwattr $C$DW$119, DW_AT_bit_size(0x02)
    2879                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2880                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2881              
    2882              $C$DW$120       .dwtag  DW_TAG_member
    2883                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2884                      .dwattr $C$DW$120, DW_AT_name("MFIE")
    2885                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_MFIE")
    2886                      .dwattr $C$DW$120, DW_AT_bit_offset(0x06)
    2887                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    2888                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2889                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2890              
    2891              $C$DW$121       .dwtag  DW_TAG_member
    2892                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2893                      .dwattr $C$DW$121, DW_AT_name("rsvd1")
    2894                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd1")
    2895                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    2896                      .dwattr $C$DW$121, DW_AT_bit_size(0x06)
    2897                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2898                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2899              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   63

    2900                      .dwendtag $C$DW$T$36
    2901              
    2902              
    2903              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2904                      .dwattr $C$DW$T$37, DW_AT_name("SDCPARM1_REG")
    2905                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2906              $C$DW$122       .dwtag  DW_TAG_member
    2907                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2908                      .dwattr $C$DW$122, DW_AT_name("all")
    2909                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    2910                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2911                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2912              
    2913              $C$DW$123       .dwtag  DW_TAG_member
    2914                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$36)
    2915                      .dwattr $C$DW$123, DW_AT_name("bit")
    2916                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    2917                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2918                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2919              
    2920                      .dwendtag $C$DW$T$37
    2921              
    2922              
    2923              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2924                      .dwattr $C$DW$T$38, DW_AT_name("SDCPARM2_BITS")
    2925                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2926              $C$DW$124       .dwtag  DW_TAG_member
    2927                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2928                      .dwattr $C$DW$124, DW_AT_name("COSR")
    2929                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_COSR")
    2930                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0b)
    2931                      .dwattr $C$DW$124, DW_AT_bit_size(0x05)
    2932                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2933                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2934              
    2935              $C$DW$125       .dwtag  DW_TAG_member
    2936                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2937                      .dwattr $C$DW$125, DW_AT_name("IEH")
    2938                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_IEH")
    2939                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0a)
    2940                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    2941                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2942                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2943              
    2944              $C$DW$126       .dwtag  DW_TAG_member
    2945                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2946                      .dwattr $C$DW$126, DW_AT_name("IEL")
    2947                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_IEL")
    2948                      .dwattr $C$DW$126, DW_AT_bit_offset(0x09)
    2949                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    2950                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2951                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2952              
    2953              $C$DW$127       .dwtag  DW_TAG_member
    2954                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   64

    2955                      .dwattr $C$DW$127, DW_AT_name("CS1_CS0")
    2956                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_CS1_CS0")
    2957                      .dwattr $C$DW$127, DW_AT_bit_offset(0x07)
    2958                      .dwattr $C$DW$127, DW_AT_bit_size(0x02)
    2959                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2960                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2961              
    2962              $C$DW$128       .dwtag  DW_TAG_member
    2963                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2964                      .dwattr $C$DW$128, DW_AT_name("MFIE")
    2965                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_MFIE")
    2966                      .dwattr $C$DW$128, DW_AT_bit_offset(0x06)
    2967                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    2968                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2969                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2970              
    2971              $C$DW$129       .dwtag  DW_TAG_member
    2972                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2973                      .dwattr $C$DW$129, DW_AT_name("rsvd1")
    2974                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd1")
    2975                      .dwattr $C$DW$129, DW_AT_bit_offset(0x00)
    2976                      .dwattr $C$DW$129, DW_AT_bit_size(0x06)
    2977                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2978                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2979              
    2980                      .dwendtag $C$DW$T$38
    2981              
    2982              
    2983              $C$DW$T$39      .dwtag  DW_TAG_union_type
    2984                      .dwattr $C$DW$T$39, DW_AT_name("SDCPARM2_REG")
    2985                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    2986              $C$DW$130       .dwtag  DW_TAG_member
    2987                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2988                      .dwattr $C$DW$130, DW_AT_name("all")
    2989                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_all")
    2990                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2991                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2992              
    2993              $C$DW$131       .dwtag  DW_TAG_member
    2994                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$38)
    2995                      .dwattr $C$DW$131, DW_AT_name("bit")
    2996                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_bit")
    2997                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2998                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2999              
    3000                      .dwendtag $C$DW$T$39
    3001              
    3002              
    3003              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3004                      .dwattr $C$DW$T$40, DW_AT_name("SDCPARM3_BITS")
    3005                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    3006              $C$DW$132       .dwtag  DW_TAG_member
    3007                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    3008                      .dwattr $C$DW$132, DW_AT_name("COSR")
    3009                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_COSR")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   65

    3010                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0b)
    3011                      .dwattr $C$DW$132, DW_AT_bit_size(0x05)
    3012                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3013                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    3014              
    3015              $C$DW$133       .dwtag  DW_TAG_member
    3016                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    3017                      .dwattr $C$DW$133, DW_AT_name("IEH")
    3018                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_IEH")
    3019                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0a)
    3020                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    3021                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3022                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    3023              
    3024              $C$DW$134       .dwtag  DW_TAG_member
    3025                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    3026                      .dwattr $C$DW$134, DW_AT_name("IEL")
    3027                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_IEL")
    3028                      .dwattr $C$DW$134, DW_AT_bit_offset(0x09)
    3029                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    3030                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3031                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    3032              
    3033              $C$DW$135       .dwtag  DW_TAG_member
    3034                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    3035                      .dwattr $C$DW$135, DW_AT_name("CS1_CS0")
    3036                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_CS1_CS0")
    3037                      .dwattr $C$DW$135, DW_AT_bit_offset(0x07)
    3038                      .dwattr $C$DW$135, DW_AT_bit_size(0x02)
    3039                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3040                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    3041              
    3042              $C$DW$136       .dwtag  DW_TAG_member
    3043                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    3044                      .dwattr $C$DW$136, DW_AT_name("MFIE")
    3045                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_MFIE")
    3046                      .dwattr $C$DW$136, DW_AT_bit_offset(0x06)
    3047                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    3048                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3049                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    3050              
    3051              $C$DW$137       .dwtag  DW_TAG_member
    3052                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    3053                      .dwattr $C$DW$137, DW_AT_name("rsvd1")
    3054                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd1")
    3055                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    3056                      .dwattr $C$DW$137, DW_AT_bit_size(0x06)
    3057                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3058                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    3059              
    3060                      .dwendtag $C$DW$T$40
    3061              
    3062              
    3063              $C$DW$T$41      .dwtag  DW_TAG_union_type
    3064                      .dwattr $C$DW$T$41, DW_AT_name("SDCPARM3_REG")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   66

    3065                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    3066              $C$DW$138       .dwtag  DW_TAG_member
    3067                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    3068                      .dwattr $C$DW$138, DW_AT_name("all")
    3069                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    3070                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3071                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    3072              
    3073              $C$DW$139       .dwtag  DW_TAG_member
    3074                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$40)
    3075                      .dwattr $C$DW$139, DW_AT_name("bit")
    3076                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    3077                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3078                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    3079              
    3080                      .dwendtag $C$DW$T$41
    3081              
    3082              
    3083              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    3084                      .dwattr $C$DW$T$42, DW_AT_name("SDCPARM4_BITS")
    3085                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    3086              $C$DW$140       .dwtag  DW_TAG_member
    3087                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    3088                      .dwattr $C$DW$140, DW_AT_name("COSR")
    3089                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_COSR")
    3090                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0b)
    3091                      .dwattr $C$DW$140, DW_AT_bit_size(0x05)
    3092                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3093                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    3094              
    3095              $C$DW$141       .dwtag  DW_TAG_member
    3096                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    3097                      .dwattr $C$DW$141, DW_AT_name("IEH")
    3098                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_IEH")
    3099                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0a)
    3100                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    3101                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3102                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    3103              
    3104              $C$DW$142       .dwtag  DW_TAG_member
    3105                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    3106                      .dwattr $C$DW$142, DW_AT_name("IEL")
    3107                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_IEL")
    3108                      .dwattr $C$DW$142, DW_AT_bit_offset(0x09)
    3109                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    3110                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3111                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    3112              
    3113              $C$DW$143       .dwtag  DW_TAG_member
    3114                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    3115                      .dwattr $C$DW$143, DW_AT_name("CS1_CS0")
    3116                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_CS1_CS0")
    3117                      .dwattr $C$DW$143, DW_AT_bit_offset(0x07)
    3118                      .dwattr $C$DW$143, DW_AT_bit_size(0x02)
    3119                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   67

    3120                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    3121              
    3122              $C$DW$144       .dwtag  DW_TAG_member
    3123                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    3124                      .dwattr $C$DW$144, DW_AT_name("MFIE")
    3125                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_MFIE")
    3126                      .dwattr $C$DW$144, DW_AT_bit_offset(0x06)
    3127                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    3128                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3129                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    3130              
    3131              $C$DW$145       .dwtag  DW_TAG_member
    3132                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    3133                      .dwattr $C$DW$145, DW_AT_name("rsvd1")
    3134                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd1")
    3135                      .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    3136                      .dwattr $C$DW$145, DW_AT_bit_size(0x06)
    3137                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3138                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    3139              
    3140                      .dwendtag $C$DW$T$42
    3141              
    3142              
    3143              $C$DW$T$43      .dwtag  DW_TAG_union_type
    3144                      .dwattr $C$DW$T$43, DW_AT_name("SDCPARM4_REG")
    3145                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    3146              $C$DW$146       .dwtag  DW_TAG_member
    3147                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    3148                      .dwattr $C$DW$146, DW_AT_name("all")
    3149                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_all")
    3150                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3151                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    3152              
    3153              $C$DW$147       .dwtag  DW_TAG_member
    3154                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$42)
    3155                      .dwattr $C$DW$147, DW_AT_name("bit")
    3156                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_bit")
    3157                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3158                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    3159              
    3160                      .dwendtag $C$DW$T$43
    3161              
    3162              
    3163              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3164                      .dwattr $C$DW$T$44, DW_AT_name("SDCTLPARM1_BITS")
    3165                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    3166              $C$DW$148       .dwtag  DW_TAG_member
    3167                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    3168                      .dwattr $C$DW$148, DW_AT_name("MOD")
    3169                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_MOD")
    3170                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0e)
    3171                      .dwattr $C$DW$148, DW_AT_bit_size(0x02)
    3172                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3173                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    3174              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   68

    3175              $C$DW$149       .dwtag  DW_TAG_member
    3176                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    3177                      .dwattr $C$DW$149, DW_AT_name("rsvd1")
    3178                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd1")
    3179                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0d)
    3180                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    3181                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3182                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    3183              
    3184              $C$DW$150       .dwtag  DW_TAG_member
    3185                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    3186                      .dwattr $C$DW$150, DW_AT_name("rsvd2")
    3187                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd2")
    3188                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0c)
    3189                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    3190                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3191                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    3192              
    3193              $C$DW$151       .dwtag  DW_TAG_member
    3194                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    3195                      .dwattr $C$DW$151, DW_AT_name("rsvd3")
    3196                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd3")
    3197                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0b)
    3198                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    3199                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3200                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    3201              
    3202              $C$DW$152       .dwtag  DW_TAG_member
    3203                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    3204                      .dwattr $C$DW$152, DW_AT_name("rsvd4")
    3205                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd4")
    3206                      .dwattr $C$DW$152, DW_AT_bit_offset(0x00)
    3207                      .dwattr $C$DW$152, DW_AT_bit_size(0x0b)
    3208                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3209                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    3210              
    3211                      .dwendtag $C$DW$T$44
    3212              
    3213              
    3214              $C$DW$T$45      .dwtag  DW_TAG_union_type
    3215                      .dwattr $C$DW$T$45, DW_AT_name("SDCTLPARM1_REG")
    3216                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    3217              $C$DW$153       .dwtag  DW_TAG_member
    3218                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    3219                      .dwattr $C$DW$153, DW_AT_name("all")
    3220                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_all")
    3221                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3222                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    3223              
    3224              $C$DW$154       .dwtag  DW_TAG_member
    3225                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$44)
    3226                      .dwattr $C$DW$154, DW_AT_name("bit")
    3227                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_bit")
    3228                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3229                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   69

    3230              
    3231                      .dwendtag $C$DW$T$45
    3232              
    3233              
    3234              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3235                      .dwattr $C$DW$T$46, DW_AT_name("SDCTLPARM2_BITS")
    3236                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    3237              $C$DW$155       .dwtag  DW_TAG_member
    3238                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    3239                      .dwattr $C$DW$155, DW_AT_name("MOD")
    3240                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_MOD")
    3241                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0e)
    3242                      .dwattr $C$DW$155, DW_AT_bit_size(0x02)
    3243                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3244                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    3245              
    3246              $C$DW$156       .dwtag  DW_TAG_member
    3247                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    3248                      .dwattr $C$DW$156, DW_AT_name("rsvd1")
    3249                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rsvd1")
    3250                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0d)
    3251                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    3252                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3253                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    3254              
    3255              $C$DW$157       .dwtag  DW_TAG_member
    3256                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    3257                      .dwattr $C$DW$157, DW_AT_name("rsvd2")
    3258                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd2")
    3259                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0c)
    3260                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    3261                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3262                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    3263              
    3264              $C$DW$158       .dwtag  DW_TAG_member
    3265                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    3266                      .dwattr $C$DW$158, DW_AT_name("rsvd3")
    3267                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd3")
    3268                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0b)
    3269                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    3270                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3271                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    3272              
    3273              $C$DW$159       .dwtag  DW_TAG_member
    3274                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    3275                      .dwattr $C$DW$159, DW_AT_name("MS")
    3276                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_MS")
    3277                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00)
    3278                      .dwattr $C$DW$159, DW_AT_bit_size(0x0b)
    3279                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3280                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3281              
    3282                      .dwendtag $C$DW$T$46
    3283              
    3284              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   70

    3285              $C$DW$T$47      .dwtag  DW_TAG_union_type
    3286                      .dwattr $C$DW$T$47, DW_AT_name("SDCTLPARM2_REG")
    3287                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    3288              $C$DW$160       .dwtag  DW_TAG_member
    3289                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    3290                      .dwattr $C$DW$160, DW_AT_name("all")
    3291                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_all")
    3292                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3293                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3294              
    3295              $C$DW$161       .dwtag  DW_TAG_member
    3296                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$46)
    3297                      .dwattr $C$DW$161, DW_AT_name("bit")
    3298                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_bit")
    3299                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3300                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3301              
    3302                      .dwendtag $C$DW$T$47
    3303              
    3304              
    3305              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3306                      .dwattr $C$DW$T$48, DW_AT_name("SDCTLPARM3_BITS")
    3307                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    3308              $C$DW$162       .dwtag  DW_TAG_member
    3309                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    3310                      .dwattr $C$DW$162, DW_AT_name("MOD")
    3311                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_MOD")
    3312                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0e)
    3313                      .dwattr $C$DW$162, DW_AT_bit_size(0x02)
    3314                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3315                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3316              
    3317              $C$DW$163       .dwtag  DW_TAG_member
    3318                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    3319                      .dwattr $C$DW$163, DW_AT_name("rsvd1")
    3320                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd1")
    3321                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0d)
    3322                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    3323                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3324                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3325              
    3326              $C$DW$164       .dwtag  DW_TAG_member
    3327                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    3328                      .dwattr $C$DW$164, DW_AT_name("rsvd2")
    3329                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd2")
    3330                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0c)
    3331                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    3332                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3333                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3334              
    3335              $C$DW$165       .dwtag  DW_TAG_member
    3336                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    3337                      .dwattr $C$DW$165, DW_AT_name("rsvd3")
    3338                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd3")
    3339                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0b)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   71

    3340                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    3341                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3342                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3343              
    3344              $C$DW$166       .dwtag  DW_TAG_member
    3345                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    3346                      .dwattr $C$DW$166, DW_AT_name("MS")
    3347                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_MS")
    3348                      .dwattr $C$DW$166, DW_AT_bit_offset(0x00)
    3349                      .dwattr $C$DW$166, DW_AT_bit_size(0x0b)
    3350                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3351                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3352              
    3353                      .dwendtag $C$DW$T$48
    3354              
    3355              
    3356              $C$DW$T$49      .dwtag  DW_TAG_union_type
    3357                      .dwattr $C$DW$T$49, DW_AT_name("SDCTLPARM3_REG")
    3358                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    3359              $C$DW$167       .dwtag  DW_TAG_member
    3360                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    3361                      .dwattr $C$DW$167, DW_AT_name("all")
    3362                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_all")
    3363                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3364                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3365              
    3366              $C$DW$168       .dwtag  DW_TAG_member
    3367                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$48)
    3368                      .dwattr $C$DW$168, DW_AT_name("bit")
    3369                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_bit")
    3370                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3371                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3372              
    3373                      .dwendtag $C$DW$T$49
    3374              
    3375              
    3376              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3377                      .dwattr $C$DW$T$50, DW_AT_name("SDCTLPARM4_BITS")
    3378                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    3379              $C$DW$169       .dwtag  DW_TAG_member
    3380                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    3381                      .dwattr $C$DW$169, DW_AT_name("MOD")
    3382                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_MOD")
    3383                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0e)
    3384                      .dwattr $C$DW$169, DW_AT_bit_size(0x02)
    3385                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3386                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3387              
    3388              $C$DW$170       .dwtag  DW_TAG_member
    3389                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    3390                      .dwattr $C$DW$170, DW_AT_name("rsvd1")
    3391                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd1")
    3392                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0d)
    3393                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    3394                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   72

    3395                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3396              
    3397              $C$DW$171       .dwtag  DW_TAG_member
    3398                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    3399                      .dwattr $C$DW$171, DW_AT_name("rsvd2")
    3400                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd2")
    3401                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0c)
    3402                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    3403                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3404                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3405              
    3406              $C$DW$172       .dwtag  DW_TAG_member
    3407                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    3408                      .dwattr $C$DW$172, DW_AT_name("rsvd3")
    3409                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd3")
    3410                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0b)
    3411                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    3412                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3413                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3414              
    3415              $C$DW$173       .dwtag  DW_TAG_member
    3416                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    3417                      .dwattr $C$DW$173, DW_AT_name("MS")
    3418                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_MS")
    3419                      .dwattr $C$DW$173, DW_AT_bit_offset(0x00)
    3420                      .dwattr $C$DW$173, DW_AT_bit_size(0x0b)
    3421                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3422                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3423              
    3424                      .dwendtag $C$DW$T$50
    3425              
    3426              
    3427              $C$DW$T$51      .dwtag  DW_TAG_union_type
    3428                      .dwattr $C$DW$T$51, DW_AT_name("SDCTLPARM4_REG")
    3429                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    3430              $C$DW$174       .dwtag  DW_TAG_member
    3431                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    3432                      .dwattr $C$DW$174, DW_AT_name("all")
    3433                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_all")
    3434                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3435                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3436              
    3437              $C$DW$175       .dwtag  DW_TAG_member
    3438                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$50)
    3439                      .dwattr $C$DW$175, DW_AT_name("bit")
    3440                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_bit")
    3441                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3442                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3443              
    3444                      .dwendtag $C$DW$T$51
    3445              
    3446              
    3447              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3448                      .dwattr $C$DW$T$52, DW_AT_name("SDCTL_BITS")
    3449                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   73

    3450              $C$DW$176       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    3452                      .dwattr $C$DW$176, DW_AT_name("rsvd1")
    3453                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd1")
    3454                      .dwattr $C$DW$176, DW_AT_bit_offset(0x03)
    3455                      .dwattr $C$DW$176, DW_AT_bit_size(0x0d)
    3456                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3457                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3458              
    3459              $C$DW$177       .dwtag  DW_TAG_member
    3460                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    3461                      .dwattr $C$DW$177, DW_AT_name("MIE")
    3462                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_MIE")
    3463                      .dwattr $C$DW$177, DW_AT_bit_offset(0x02)
    3464                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    3465                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3466                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3467              
    3468              $C$DW$178       .dwtag  DW_TAG_member
    3469                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    3470                      .dwattr $C$DW$178, DW_AT_name("rsvd2")
    3471                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd2")
    3472                      .dwattr $C$DW$178, DW_AT_bit_offset(0x01)
    3473                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    3474                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3475                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3476              
    3477              $C$DW$179       .dwtag  DW_TAG_member
    3478                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    3479                      .dwattr $C$DW$179, DW_AT_name("rsvd3")
    3480                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd3")
    3481                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00)
    3482                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    3483                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3484                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3485              
    3486                      .dwendtag $C$DW$T$52
    3487              
    3488              
    3489              $C$DW$T$53      .dwtag  DW_TAG_union_type
    3490                      .dwattr $C$DW$T$53, DW_AT_name("SDCTL_REG")
    3491                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    3492              $C$DW$180       .dwtag  DW_TAG_member
    3493                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    3494                      .dwattr $C$DW$180, DW_AT_name("all")
    3495                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_all")
    3496                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3497                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3498              
    3499              $C$DW$181       .dwtag  DW_TAG_member
    3500                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$52)
    3501                      .dwattr $C$DW$181, DW_AT_name("bit")
    3502                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_bit")
    3503                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3504                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   74

    3505              
    3506                      .dwendtag $C$DW$T$53
    3507              
    3508              
    3509              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3510                      .dwattr $C$DW$T$54, DW_AT_name("SDDATA1_BITS")
    3511                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
    3512              $C$DW$182       .dwtag  DW_TAG_member
    3513                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    3514                      .dwattr $C$DW$182, DW_AT_name("DATA16")
    3515                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_DATA16")
    3516                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    3517                      .dwattr $C$DW$182, DW_AT_bit_size(0x10)
    3518                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3519                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3520              
    3521              $C$DW$183       .dwtag  DW_TAG_member
    3522                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    3523                      .dwattr $C$DW$183, DW_AT_name("DATA32HI")
    3524                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_DATA32HI")
    3525                      .dwattr $C$DW$183, DW_AT_bit_offset(0x00)
    3526                      .dwattr $C$DW$183, DW_AT_bit_size(0x10)
    3527                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3528                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3529              
    3530                      .dwendtag $C$DW$T$54
    3531              
    3532              
    3533              $C$DW$T$56      .dwtag  DW_TAG_union_type
    3534                      .dwattr $C$DW$T$56, DW_AT_name("SDDATA1_REG")
    3535                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x02)
    3536              $C$DW$184       .dwtag  DW_TAG_member
    3537                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$55)
    3538                      .dwattr $C$DW$184, DW_AT_name("all")
    3539                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_all")
    3540                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3541                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3542              
    3543              $C$DW$185       .dwtag  DW_TAG_member
    3544                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$54)
    3545                      .dwattr $C$DW$185, DW_AT_name("bit")
    3546                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_bit")
    3547                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3548                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3549              
    3550                      .dwendtag $C$DW$T$56
    3551              
    3552              
    3553              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3554                      .dwattr $C$DW$T$57, DW_AT_name("SDDATA2_BITS")
    3555                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x02)
    3556              $C$DW$186       .dwtag  DW_TAG_member
    3557                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    3558                      .dwattr $C$DW$186, DW_AT_name("DATA16")
    3559                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_DATA16")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   75

    3560                      .dwattr $C$DW$186, DW_AT_bit_offset(0x00)
    3561                      .dwattr $C$DW$186, DW_AT_bit_size(0x10)
    3562                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3563                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3564              
    3565              $C$DW$187       .dwtag  DW_TAG_member
    3566                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    3567                      .dwattr $C$DW$187, DW_AT_name("DATA32HI")
    3568                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_DATA32HI")
    3569                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00)
    3570                      .dwattr $C$DW$187, DW_AT_bit_size(0x10)
    3571                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3572                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3573              
    3574                      .dwendtag $C$DW$T$57
    3575              
    3576              
    3577              $C$DW$T$58      .dwtag  DW_TAG_union_type
    3578                      .dwattr $C$DW$T$58, DW_AT_name("SDDATA2_REG")
    3579                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x02)
    3580              $C$DW$188       .dwtag  DW_TAG_member
    3581                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$55)
    3582                      .dwattr $C$DW$188, DW_AT_name("all")
    3583                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_all")
    3584                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3585                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3586              
    3587              $C$DW$189       .dwtag  DW_TAG_member
    3588                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$57)
    3589                      .dwattr $C$DW$189, DW_AT_name("bit")
    3590                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_bit")
    3591                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3592                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3593              
    3594                      .dwendtag $C$DW$T$58
    3595              
    3596              
    3597              $C$DW$T$59      .dwtag  DW_TAG_structure_type
    3598                      .dwattr $C$DW$T$59, DW_AT_name("SDDATA3_BITS")
    3599                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    3600              $C$DW$190       .dwtag  DW_TAG_member
    3601                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    3602                      .dwattr $C$DW$190, DW_AT_name("DATA16")
    3603                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_DATA16")
    3604                      .dwattr $C$DW$190, DW_AT_bit_offset(0x00)
    3605                      .dwattr $C$DW$190, DW_AT_bit_size(0x10)
    3606                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3607                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3608              
    3609              $C$DW$191       .dwtag  DW_TAG_member
    3610                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    3611                      .dwattr $C$DW$191, DW_AT_name("DATA32HI")
    3612                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_DATA32HI")
    3613                      .dwattr $C$DW$191, DW_AT_bit_offset(0x00)
    3614                      .dwattr $C$DW$191, DW_AT_bit_size(0x10)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   76

    3615                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3616                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3617              
    3618                      .dwendtag $C$DW$T$59
    3619              
    3620              
    3621              $C$DW$T$60      .dwtag  DW_TAG_union_type
    3622                      .dwattr $C$DW$T$60, DW_AT_name("SDDATA3_REG")
    3623                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x02)
    3624              $C$DW$192       .dwtag  DW_TAG_member
    3625                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$55)
    3626                      .dwattr $C$DW$192, DW_AT_name("all")
    3627                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_all")
    3628                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3629                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3630              
    3631              $C$DW$193       .dwtag  DW_TAG_member
    3632                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$59)
    3633                      .dwattr $C$DW$193, DW_AT_name("bit")
    3634                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_bit")
    3635                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3636                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3637              
    3638                      .dwendtag $C$DW$T$60
    3639              
    3640              
    3641              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3642                      .dwattr $C$DW$T$61, DW_AT_name("SDDATA4_BITS")
    3643                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x02)
    3644              $C$DW$194       .dwtag  DW_TAG_member
    3645                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    3646                      .dwattr $C$DW$194, DW_AT_name("DATA16")
    3647                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_DATA16")
    3648                      .dwattr $C$DW$194, DW_AT_bit_offset(0x00)
    3649                      .dwattr $C$DW$194, DW_AT_bit_size(0x10)
    3650                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3651                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3652              
    3653              $C$DW$195       .dwtag  DW_TAG_member
    3654                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    3655                      .dwattr $C$DW$195, DW_AT_name("DATA32HI")
    3656                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_DATA32HI")
    3657                      .dwattr $C$DW$195, DW_AT_bit_offset(0x00)
    3658                      .dwattr $C$DW$195, DW_AT_bit_size(0x10)
    3659                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3660                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3661              
    3662                      .dwendtag $C$DW$T$61
    3663              
    3664              
    3665              $C$DW$T$62      .dwtag  DW_TAG_union_type
    3666                      .dwattr $C$DW$T$62, DW_AT_name("SDDATA4_REG")
    3667                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x02)
    3668              $C$DW$196       .dwtag  DW_TAG_member
    3669                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$55)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   77

    3670                      .dwattr $C$DW$196, DW_AT_name("all")
    3671                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_all")
    3672                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3673                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3674              
    3675              $C$DW$197       .dwtag  DW_TAG_member
    3676                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$61)
    3677                      .dwattr $C$DW$197, DW_AT_name("bit")
    3678                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_bit")
    3679                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3680                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3681              
    3682                      .dwendtag $C$DW$T$62
    3683              
    3684              
    3685              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3686                      .dwattr $C$DW$T$63, DW_AT_name("SDDFPARM1_BITS")
    3687                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x01)
    3688              $C$DW$198       .dwtag  DW_TAG_member
    3689                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    3690                      .dwattr $C$DW$198, DW_AT_name("DOSR")
    3691                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_DOSR")
    3692                      .dwattr $C$DW$198, DW_AT_bit_offset(0x08)
    3693                      .dwattr $C$DW$198, DW_AT_bit_size(0x08)
    3694                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3695                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3696              
    3697              $C$DW$199       .dwtag  DW_TAG_member
    3698                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3699                      .dwattr $C$DW$199, DW_AT_name("FEN")
    3700                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_FEN")
    3701                      .dwattr $C$DW$199, DW_AT_bit_offset(0x07)
    3702                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    3703                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3704                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3705              
    3706              $C$DW$200       .dwtag  DW_TAG_member
    3707                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    3708                      .dwattr $C$DW$200, DW_AT_name("AE")
    3709                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_AE")
    3710                      .dwattr $C$DW$200, DW_AT_bit_offset(0x06)
    3711                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    3712                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3713                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3714              
    3715              $C$DW$201       .dwtag  DW_TAG_member
    3716                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    3717                      .dwattr $C$DW$201, DW_AT_name("SST")
    3718                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_SST")
    3719                      .dwattr $C$DW$201, DW_AT_bit_offset(0x04)
    3720                      .dwattr $C$DW$201, DW_AT_bit_size(0x02)
    3721                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3722                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3723              
    3724              $C$DW$202       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   78

    3725                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    3726                      .dwattr $C$DW$202, DW_AT_name("FILRESEN")
    3727                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_FILRESEN")
    3728                      .dwattr $C$DW$202, DW_AT_bit_offset(0x03)
    3729                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    3730                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3731                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3732              
    3733              $C$DW$203       .dwtag  DW_TAG_member
    3734                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    3735                      .dwattr $C$DW$203, DW_AT_name("rsvd1")
    3736                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd1")
    3737                      .dwattr $C$DW$203, DW_AT_bit_offset(0x00)
    3738                      .dwattr $C$DW$203, DW_AT_bit_size(0x03)
    3739                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3740                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3741              
    3742                      .dwendtag $C$DW$T$63
    3743              
    3744              
    3745              $C$DW$T$64      .dwtag  DW_TAG_union_type
    3746                      .dwattr $C$DW$T$64, DW_AT_name("SDDFPARM1_REG")
    3747                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    3748              $C$DW$204       .dwtag  DW_TAG_member
    3749                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    3750                      .dwattr $C$DW$204, DW_AT_name("all")
    3751                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_all")
    3752                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3753                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3754              
    3755              $C$DW$205       .dwtag  DW_TAG_member
    3756                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$63)
    3757                      .dwattr $C$DW$205, DW_AT_name("bit")
    3758                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_bit")
    3759                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3760                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3761              
    3762                      .dwendtag $C$DW$T$64
    3763              
    3764              
    3765              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    3766                      .dwattr $C$DW$T$65, DW_AT_name("SDDFPARM2_BITS")
    3767                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x01)
    3768              $C$DW$206       .dwtag  DW_TAG_member
    3769                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    3770                      .dwattr $C$DW$206, DW_AT_name("DOSR")
    3771                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_DOSR")
    3772                      .dwattr $C$DW$206, DW_AT_bit_offset(0x08)
    3773                      .dwattr $C$DW$206, DW_AT_bit_size(0x08)
    3774                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3775                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3776              
    3777              $C$DW$207       .dwtag  DW_TAG_member
    3778                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    3779                      .dwattr $C$DW$207, DW_AT_name("FEN")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:35 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   79

    3780                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_FEN")
    3781                      .dwattr $C$DW$207, DW_AT_bit_offset(0x07)
    3782                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    3783                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3784                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3785              
    3786              $C$DW$208       .dwtag  DW_TAG_member
    3787                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    3788                      .dwattr $C$DW$208, DW_AT_name("AE")
    3789                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_AE")
    3790                      .dwattr $C$DW$208, DW_AT_bit_offset(0x06)
    3791                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    3792                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3793                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3794              
    3795              $C$DW$209       .dwtag  DW_TAG_member
    3796                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    3797                      .dwattr $C$DW$209, DW_AT_name("SST")
    3798                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_SST")
    3799                      .dwattr $C$DW$209, DW_AT_bit_offset(0x04)
    3800                      .dwattr $C$DW$209, DW_AT_bit_size(0x02)
    3801                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
