TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Fri Jul 31 12:17:34 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Chiaming\CCSworkspace_V10\MonoMtrServo_377s\F2837x_RAM")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_EnableUnbondedIOPullups")

    1972              ;* FUNCTION ENVIRONMENT                                        *
    1973              ;*                                                             *
    1974              ;* FUNCTION PROPERTIES                                         *
    1975              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1976              ;***************************************************************
    1977              
    1978 00000285       _HIB:
    1979                      .dwcfi  cfa_offset, -2
    1980                      .dwcfi  save_reg_to_mem, 26, 0
    1981                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    1982 00000285 7622   EALLOW
    1983                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    1984 00000286 761F!         MOVW      DP,#_CpuSysRegs+118   ; [CPU_ARAU] 
         00000287 0001 
    1985 00000288 1A36!         OR        @$BLOCKED(_CpuSysRegs)+118,#0x0003 ; [CPU_ALU] |724| 
         00000289 0003 
    1986                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    1987 0000028a 761A   EDIS
    1988                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    1989 0000028b FF69          SPM       #0                    ; [CPU_ALU] 
    1990              $C$DW$86        .dwtag  DW_TAG_TI_branch
    1991                      .dwattr $C$DW$86, DW_AT_low_pc(0x00)
    1992                      .dwattr $C$DW$86, DW_AT_name("_DisablePeripheralClocks")
    1993                      .dwattr $C$DW$86, DW_AT_TI_call
    1994              
    1995 0000028c 7640'         LCR       #_DisablePeripheralClocks ; [CPU_ALU] |726| 
         0000028d 00B5 
    1996                      ; call occurs [#_DisablePeripheralClocks] ; [] |726| 
    1997                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    1998 0000028e 7622   EALLOW
    1999                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2000 0000028f 761F!         MOVW      DP,#_ClkCfgRegs+14    ; [CPU_ARAU] 
         00000290 0000 
    2001 00000291 180E!         AND       @$BLOCKED(_ClkCfgRegs)+14,#0xfffd ; [CPU_ALU] |728| 
         00000292 FFFD 
    2002                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2003 00000293 180E!         AND       @$BLOCKED(_ClkCfgRegs)+14,#0xfffe ; [CPU_ALU] |729| 
         00000294 FFFE 
    2004                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2005 00000295 761A   EDIS
    2006                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2007 00000296 7621   IDLE
    2008                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    2009 00000297 FF69          SPM       #0                    ; [CPU_ALU] 
    2010              $C$DW$87        .dwtag  DW_TAG_TI_branch
    2011                      .dwattr $C$DW$87, DW_AT_low_pc(0x00)
    2012                      .dwattr $C$DW$87, DW_AT_TI_return
    2013              
    2014 00000298 0006          LRETR     ; [CPU_ALU] 
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   41

    2015                      ; return occurs ; [] 
    2016                      .dwattr $C$DW$85, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/so
    2017                      .dwattr $C$DW$85, DW_AT_TI_end_line(0x2dc)
    2018                      .dwattr $C$DW$85, DW_AT_TI_end_column(0x01)
    2019                      .dwendentry
    2020                      .dwendtag $C$DW$85
    2021              
    2022              ;**************************************************************
    2023              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2024              ;**************************************************************
    2025                      .global _GPIO_EnableUnbondedIOPullups
    2026                      .global _F28x_usDelay
    2027                      .global _DcsmZ1Regs
    2028                      .global _DcsmZ2Regs
    2029                      .global _Flash0EccRegs
    2030                      .global _Flash1EccRegs
    2031                      .global _WdRegs
    2032                      .global _ClkCfgRegs
    2033                      .global _AnalogSubsysRegs
    2034                      .global _CpuSysRegs
    2035                      .global _Flash0CtrlRegs
    2036                      .global _Flash1CtrlRegs
    2037              
    2038              ;***************************************************************
    2039              ;* TYPE INFORMATION                                            *
    2040              ;***************************************************************
    2041              
    2042              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2043                      .dwattr $C$DW$T$25, DW_AT_name("ANALOG_SUBSYS_REGS")
    2044                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
    2045              $C$DW$88        .dwtag  DW_TAG_member
    2046                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
    2047                      .dwattr $C$DW$88, DW_AT_name("rsvd1")
    2048                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd1")
    2049                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2050                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    2051              
    2052              $C$DW$89        .dwtag  DW_TAG_member
    2053                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$112)
    2054                      .dwattr $C$DW$89, DW_AT_name("INTOSC1TRIM")
    2055                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_INTOSC1TRIM")
    2056                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2057                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    2058              
    2059              $C$DW$90        .dwtag  DW_TAG_member
    2060                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$114)
    2061                      .dwattr $C$DW$90, DW_AT_name("INTOSC2TRIM")
    2062                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_INTOSC2TRIM")
    2063                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2064                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    2065              
    2066              $C$DW$91        .dwtag  DW_TAG_member
    2067                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$21)
    2068                      .dwattr $C$DW$91, DW_AT_name("rsvd2")
    2069                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   42

    2070                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2071                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2072              
    2073              $C$DW$92        .dwtag  DW_TAG_member
    2074                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$176)
    2075                      .dwattr $C$DW$92, DW_AT_name("TSNSCTL")
    2076                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_TSNSCTL")
    2077                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2078                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2079              
    2080              $C$DW$93        .dwtag  DW_TAG_member
    2081                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$22)
    2082                      .dwattr $C$DW$93, DW_AT_name("rsvd3")
    2083                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd3")
    2084                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2085                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2086              
    2087              $C$DW$94        .dwtag  DW_TAG_member
    2088                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$118)
    2089                      .dwattr $C$DW$94, DW_AT_name("LOCK")
    2090                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_LOCK")
    2091                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2092                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2093              
    2094              $C$DW$95        .dwtag  DW_TAG_member
    2095                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$23)
    2096                      .dwattr $C$DW$95, DW_AT_name("rsvd4")
    2097                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd4")
    2098                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2099                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2100              
    2101              $C$DW$96        .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$28)
    2103                      .dwattr $C$DW$96, DW_AT_name("ANAREFTRIMA")
    2104                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_ANAREFTRIMA")
    2105                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2106                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2107              
    2108              $C$DW$97        .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$30)
    2110                      .dwattr $C$DW$97, DW_AT_name("ANAREFTRIMB")
    2111                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_ANAREFTRIMB")
    2112                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2113                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2114              
    2115              $C$DW$98        .dwtag  DW_TAG_member
    2116                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$32)
    2117                      .dwattr $C$DW$98, DW_AT_name("ANAREFTRIMC")
    2118                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_ANAREFTRIMC")
    2119                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2120                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2121              
    2122              $C$DW$99        .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$34)
    2124                      .dwattr $C$DW$99, DW_AT_name("ANAREFTRIMD")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   43

    2125                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_ANAREFTRIMD")
    2126                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2127                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2128              
    2129              $C$DW$100       .dwtag  DW_TAG_member
    2130                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$24)
    2131                      .dwattr $C$DW$100, DW_AT_name("rsvd5")
    2132                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd5")
    2133                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2134                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2135              
    2136                      .dwendtag $C$DW$T$25
    2137              
    2138              $C$DW$101       .dwtag  DW_TAG_TI_far_type
    2139                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$25)
    2140              
    2141              $C$DW$T$224     .dwtag  DW_TAG_volatile_type
    2142                      .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$101)
    2143              
    2144              
    2145              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2146                      .dwattr $C$DW$T$26, DW_AT_name("ANAREFTRIMA_BITS")
    2147                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2148              $C$DW$102       .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    2150                      .dwattr $C$DW$102, DW_AT_name("BGVALTRIM")
    2151                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_BGVALTRIM")
    2152                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0a)
    2153                      .dwattr $C$DW$102, DW_AT_bit_size(0x06)
    2154                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2155                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2156              
    2157              $C$DW$103       .dwtag  DW_TAG_member
    2158                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    2159                      .dwattr $C$DW$103, DW_AT_name("BGSLOPETRIM")
    2160                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2161                      .dwattr $C$DW$103, DW_AT_bit_offset(0x05)
    2162                      .dwattr $C$DW$103, DW_AT_bit_size(0x05)
    2163                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2164                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2165              
    2166              $C$DW$104       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    2168                      .dwattr $C$DW$104, DW_AT_name("IREFTRIM")
    2169                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_IREFTRIM")
    2170                      .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    2171                      .dwattr $C$DW$104, DW_AT_bit_size(0x05)
    2172                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2173                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2174              
    2175              $C$DW$105       .dwtag  DW_TAG_member
    2176                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2177                      .dwattr $C$DW$105, DW_AT_name("rsvd1")
    2178                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd1")
    2179                      .dwattr $C$DW$105, DW_AT_bit_offset(0x08)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   44

    2180                      .dwattr $C$DW$105, DW_AT_bit_size(0x08)
    2181                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2182                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2183              
    2184              $C$DW$106       .dwtag  DW_TAG_member
    2185                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    2186                      .dwattr $C$DW$106, DW_AT_name("rsvd2")
    2187                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd2")
    2188                      .dwattr $C$DW$106, DW_AT_bit_offset(0x00)
    2189                      .dwattr $C$DW$106, DW_AT_bit_size(0x08)
    2190                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2191                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2192              
    2193                      .dwendtag $C$DW$T$26
    2194              
    2195              
    2196              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2197                      .dwattr $C$DW$T$28, DW_AT_name("ANAREFTRIMA_REG")
    2198                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2199              $C$DW$107       .dwtag  DW_TAG_member
    2200                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$27)
    2201                      .dwattr $C$DW$107, DW_AT_name("all")
    2202                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_all")
    2203                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2204                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2205              
    2206              $C$DW$108       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$26)
    2208                      .dwattr $C$DW$108, DW_AT_name("bit")
    2209                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_bit")
    2210                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2211                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2212              
    2213                      .dwendtag $C$DW$T$28
    2214              
    2215              
    2216              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2217                      .dwattr $C$DW$T$29, DW_AT_name("ANAREFTRIMB_BITS")
    2218                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2219              $C$DW$109       .dwtag  DW_TAG_member
    2220                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2221                      .dwattr $C$DW$109, DW_AT_name("BGVALTRIM")
    2222                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_BGVALTRIM")
    2223                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0a)
    2224                      .dwattr $C$DW$109, DW_AT_bit_size(0x06)
    2225                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2226                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2227              
    2228              $C$DW$110       .dwtag  DW_TAG_member
    2229                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2230                      .dwattr $C$DW$110, DW_AT_name("BGSLOPETRIM")
    2231                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2232                      .dwattr $C$DW$110, DW_AT_bit_offset(0x05)
    2233                      .dwattr $C$DW$110, DW_AT_bit_size(0x05)
    2234                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   45

    2235                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2236              
    2237              $C$DW$111       .dwtag  DW_TAG_member
    2238                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2239                      .dwattr $C$DW$111, DW_AT_name("IREFTRIM")
    2240                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_IREFTRIM")
    2241                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    2242                      .dwattr $C$DW$111, DW_AT_bit_size(0x05)
    2243                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2244                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2245              
    2246              $C$DW$112       .dwtag  DW_TAG_member
    2247                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2248                      .dwattr $C$DW$112, DW_AT_name("rsvd1")
    2249                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd1")
    2250                      .dwattr $C$DW$112, DW_AT_bit_offset(0x08)
    2251                      .dwattr $C$DW$112, DW_AT_bit_size(0x08)
    2252                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2253                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2254              
    2255              $C$DW$113       .dwtag  DW_TAG_member
    2256                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2257                      .dwattr $C$DW$113, DW_AT_name("rsvd2")
    2258                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd2")
    2259                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00)
    2260                      .dwattr $C$DW$113, DW_AT_bit_size(0x08)
    2261                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2262                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2263              
    2264                      .dwendtag $C$DW$T$29
    2265              
    2266              
    2267              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2268                      .dwattr $C$DW$T$30, DW_AT_name("ANAREFTRIMB_REG")
    2269                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2270              $C$DW$114       .dwtag  DW_TAG_member
    2271                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$27)
    2272                      .dwattr $C$DW$114, DW_AT_name("all")
    2273                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_all")
    2274                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2275                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2276              
    2277              $C$DW$115       .dwtag  DW_TAG_member
    2278                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$29)
    2279                      .dwattr $C$DW$115, DW_AT_name("bit")
    2280                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_bit")
    2281                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2282                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2283              
    2284                      .dwendtag $C$DW$T$30
    2285              
    2286              
    2287              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2288                      .dwattr $C$DW$T$31, DW_AT_name("ANAREFTRIMC_BITS")
    2289                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   46

    2290              $C$DW$116       .dwtag  DW_TAG_member
    2291                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2292                      .dwattr $C$DW$116, DW_AT_name("BGVALTRIM")
    2293                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_BGVALTRIM")
    2294                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0a)
    2295                      .dwattr $C$DW$116, DW_AT_bit_size(0x06)
    2296                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2297                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2298              
    2299              $C$DW$117       .dwtag  DW_TAG_member
    2300                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2301                      .dwattr $C$DW$117, DW_AT_name("BGSLOPETRIM")
    2302                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2303                      .dwattr $C$DW$117, DW_AT_bit_offset(0x05)
    2304                      .dwattr $C$DW$117, DW_AT_bit_size(0x05)
    2305                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2306                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2307              
    2308              $C$DW$118       .dwtag  DW_TAG_member
    2309                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2310                      .dwattr $C$DW$118, DW_AT_name("IREFTRIM")
    2311                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_IREFTRIM")
    2312                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    2313                      .dwattr $C$DW$118, DW_AT_bit_size(0x05)
    2314                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2315                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2316              
    2317              $C$DW$119       .dwtag  DW_TAG_member
    2318                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2319                      .dwattr $C$DW$119, DW_AT_name("rsvd1")
    2320                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd1")
    2321                      .dwattr $C$DW$119, DW_AT_bit_offset(0x08)
    2322                      .dwattr $C$DW$119, DW_AT_bit_size(0x08)
    2323                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2324                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2325              
    2326              $C$DW$120       .dwtag  DW_TAG_member
    2327                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2328                      .dwattr $C$DW$120, DW_AT_name("rsvd2")
    2329                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd2")
    2330                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00)
    2331                      .dwattr $C$DW$120, DW_AT_bit_size(0x08)
    2332                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2333                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2334              
    2335                      .dwendtag $C$DW$T$31
    2336              
    2337              
    2338              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2339                      .dwattr $C$DW$T$32, DW_AT_name("ANAREFTRIMC_REG")
    2340                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2341              $C$DW$121       .dwtag  DW_TAG_member
    2342                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$27)
    2343                      .dwattr $C$DW$121, DW_AT_name("all")
    2344                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   47

    2345                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2346                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2347              
    2348              $C$DW$122       .dwtag  DW_TAG_member
    2349                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$31)
    2350                      .dwattr $C$DW$122, DW_AT_name("bit")
    2351                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_bit")
    2352                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2353                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2354              
    2355                      .dwendtag $C$DW$T$32
    2356              
    2357              
    2358              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2359                      .dwattr $C$DW$T$33, DW_AT_name("ANAREFTRIMD_BITS")
    2360                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2361              $C$DW$123       .dwtag  DW_TAG_member
    2362                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2363                      .dwattr $C$DW$123, DW_AT_name("BGVALTRIM")
    2364                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_BGVALTRIM")
    2365                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0a)
    2366                      .dwattr $C$DW$123, DW_AT_bit_size(0x06)
    2367                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2368                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2369              
    2370              $C$DW$124       .dwtag  DW_TAG_member
    2371                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2372                      .dwattr $C$DW$124, DW_AT_name("BGSLOPETRIM")
    2373                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2374                      .dwattr $C$DW$124, DW_AT_bit_offset(0x05)
    2375                      .dwattr $C$DW$124, DW_AT_bit_size(0x05)
    2376                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2377                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2378              
    2379              $C$DW$125       .dwtag  DW_TAG_member
    2380                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2381                      .dwattr $C$DW$125, DW_AT_name("IREFTRIM")
    2382                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_IREFTRIM")
    2383                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00)
    2384                      .dwattr $C$DW$125, DW_AT_bit_size(0x05)
    2385                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2386                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2387              
    2388              $C$DW$126       .dwtag  DW_TAG_member
    2389                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2390                      .dwattr $C$DW$126, DW_AT_name("rsvd1")
    2391                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd1")
    2392                      .dwattr $C$DW$126, DW_AT_bit_offset(0x08)
    2393                      .dwattr $C$DW$126, DW_AT_bit_size(0x08)
    2394                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2395                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2396              
    2397              $C$DW$127       .dwtag  DW_TAG_member
    2398                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2399                      .dwattr $C$DW$127, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   48

    2400                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd2")
    2401                      .dwattr $C$DW$127, DW_AT_bit_offset(0x00)
    2402                      .dwattr $C$DW$127, DW_AT_bit_size(0x08)
    2403                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2404                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2405              
    2406                      .dwendtag $C$DW$T$33
    2407              
    2408              
    2409              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2410                      .dwattr $C$DW$T$34, DW_AT_name("ANAREFTRIMD_REG")
    2411                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2412              $C$DW$128       .dwtag  DW_TAG_member
    2413                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$27)
    2414                      .dwattr $C$DW$128, DW_AT_name("all")
    2415                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_all")
    2416                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2417                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2418              
    2419              $C$DW$129       .dwtag  DW_TAG_member
    2420                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$33)
    2421                      .dwattr $C$DW$129, DW_AT_name("bit")
    2422                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_bit")
    2423                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2424                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2425              
    2426                      .dwendtag $C$DW$T$34
    2427              
    2428              
    2429              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2430                      .dwattr $C$DW$T$35, DW_AT_name("AUXCLKDIVSEL_BITS")
    2431                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2432              $C$DW$130       .dwtag  DW_TAG_member
    2433                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2434                      .dwattr $C$DW$130, DW_AT_name("AUXPLLDIV")
    2435                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_AUXPLLDIV")
    2436                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0e)
    2437                      .dwattr $C$DW$130, DW_AT_bit_size(0x02)
    2438                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2439                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2440              
    2441              $C$DW$131       .dwtag  DW_TAG_member
    2442                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2443                      .dwattr $C$DW$131, DW_AT_name("rsvd1")
    2444                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd1")
    2445                      .dwattr $C$DW$131, DW_AT_bit_offset(0x00)
    2446                      .dwattr $C$DW$131, DW_AT_bit_size(0x0e)
    2447                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2448                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2449              
    2450              $C$DW$132       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2452                      .dwattr $C$DW$132, DW_AT_name("rsvd2")
    2453                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd2")
    2454                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   49

    2455                      .dwattr $C$DW$132, DW_AT_bit_size(0x10)
    2456                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2457                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2458              
    2459                      .dwendtag $C$DW$T$35
    2460              
    2461              
    2462              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2463                      .dwattr $C$DW$T$36, DW_AT_name("AUXCLKDIVSEL_REG")
    2464                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2465              $C$DW$133       .dwtag  DW_TAG_member
    2466                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$27)
    2467                      .dwattr $C$DW$133, DW_AT_name("all")
    2468                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_all")
    2469                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2470                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2471              
    2472              $C$DW$134       .dwtag  DW_TAG_member
    2473                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$35)
    2474                      .dwattr $C$DW$134, DW_AT_name("bit")
    2475                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_bit")
    2476                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2477                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2478              
    2479                      .dwendtag $C$DW$T$36
    2480              
    2481              
    2482              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2483                      .dwattr $C$DW$T$37, DW_AT_name("AUXPLLCTL1_BITS")
    2484                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2485              $C$DW$135       .dwtag  DW_TAG_member
    2486                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2487                      .dwattr $C$DW$135, DW_AT_name("PLLEN")
    2488                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_PLLEN")
    2489                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0f)
    2490                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    2491                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2492                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2493              
    2494              $C$DW$136       .dwtag  DW_TAG_member
    2495                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2496                      .dwattr $C$DW$136, DW_AT_name("PLLCLKEN")
    2497                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_PLLCLKEN")
    2498                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0e)
    2499                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    2500                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2501                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2502              
    2503              $C$DW$137       .dwtag  DW_TAG_member
    2504                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2505                      .dwattr $C$DW$137, DW_AT_name("rsvd1")
    2506                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd1")
    2507                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    2508                      .dwattr $C$DW$137, DW_AT_bit_size(0x0e)
    2509                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   50

    2510                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2511              
    2512              $C$DW$138       .dwtag  DW_TAG_member
    2513                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2514                      .dwattr $C$DW$138, DW_AT_name("rsvd2")
    2515                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd2")
    2516                      .dwattr $C$DW$138, DW_AT_bit_offset(0x00)
    2517                      .dwattr $C$DW$138, DW_AT_bit_size(0x10)
    2518                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2519                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2520              
    2521                      .dwendtag $C$DW$T$37
    2522              
    2523              
    2524              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2525                      .dwattr $C$DW$T$38, DW_AT_name("AUXPLLCTL1_REG")
    2526                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2527              $C$DW$139       .dwtag  DW_TAG_member
    2528                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$27)
    2529                      .dwattr $C$DW$139, DW_AT_name("all")
    2530                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_all")
    2531                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2532                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2533              
    2534              $C$DW$140       .dwtag  DW_TAG_member
    2535                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$37)
    2536                      .dwattr $C$DW$140, DW_AT_name("bit")
    2537                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_bit")
    2538                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2539                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2540              
    2541                      .dwendtag $C$DW$T$38
    2542              
    2543              
    2544              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2545                      .dwattr $C$DW$T$39, DW_AT_name("AUXPLLMULT_BITS")
    2546                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2547              $C$DW$141       .dwtag  DW_TAG_member
    2548                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2549                      .dwattr $C$DW$141, DW_AT_name("IMULT")
    2550                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_IMULT")
    2551                      .dwattr $C$DW$141, DW_AT_bit_offset(0x09)
    2552                      .dwattr $C$DW$141, DW_AT_bit_size(0x07)
    2553                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2554                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2555              
    2556              $C$DW$142       .dwtag  DW_TAG_member
    2557                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2558                      .dwattr $C$DW$142, DW_AT_name("rsvd1")
    2559                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd1")
    2560                      .dwattr $C$DW$142, DW_AT_bit_offset(0x08)
    2561                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2562                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2563                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2564              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   51

    2565              $C$DW$143       .dwtag  DW_TAG_member
    2566                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2567                      .dwattr $C$DW$143, DW_AT_name("FMULT")
    2568                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_FMULT")
    2569                      .dwattr $C$DW$143, DW_AT_bit_offset(0x06)
    2570                      .dwattr $C$DW$143, DW_AT_bit_size(0x02)
    2571                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2572                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2573              
    2574              $C$DW$144       .dwtag  DW_TAG_member
    2575                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2576                      .dwattr $C$DW$144, DW_AT_name("rsvd2")
    2577                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd2")
    2578                      .dwattr $C$DW$144, DW_AT_bit_offset(0x00)
    2579                      .dwattr $C$DW$144, DW_AT_bit_size(0x06)
    2580                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2581                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2582              
    2583              $C$DW$145       .dwtag  DW_TAG_member
    2584                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2585                      .dwattr $C$DW$145, DW_AT_name("rsvd3")
    2586                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd3")
    2587                      .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    2588                      .dwattr $C$DW$145, DW_AT_bit_size(0x10)
    2589                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2590                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2591              
    2592                      .dwendtag $C$DW$T$39
    2593              
    2594              
    2595              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2596                      .dwattr $C$DW$T$40, DW_AT_name("AUXPLLMULT_REG")
    2597                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2598              $C$DW$146       .dwtag  DW_TAG_member
    2599                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$27)
    2600                      .dwattr $C$DW$146, DW_AT_name("all")
    2601                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_all")
    2602                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2603                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2604              
    2605              $C$DW$147       .dwtag  DW_TAG_member
    2606                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$39)
    2607                      .dwattr $C$DW$147, DW_AT_name("bit")
    2608                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_bit")
    2609                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2610                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2611              
    2612                      .dwendtag $C$DW$T$40
    2613              
    2614              
    2615              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2616                      .dwattr $C$DW$T$41, DW_AT_name("AUXPLLSTS_BITS")
    2617                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2618              $C$DW$148       .dwtag  DW_TAG_member
    2619                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   52

    2620                      .dwattr $C$DW$148, DW_AT_name("LOCKS")
    2621                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_LOCKS")
    2622                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0f)
    2623                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2624                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2625                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2626              
    2627              $C$DW$149       .dwtag  DW_TAG_member
    2628                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2629                      .dwattr $C$DW$149, DW_AT_name("SLIPS")
    2630                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_SLIPS")
    2631                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0e)
    2632                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2633                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2634                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2635              
    2636              $C$DW$150       .dwtag  DW_TAG_member
    2637                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2638                      .dwattr $C$DW$150, DW_AT_name("rsvd1")
    2639                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd1")
    2640                      .dwattr $C$DW$150, DW_AT_bit_offset(0x00)
    2641                      .dwattr $C$DW$150, DW_AT_bit_size(0x0e)
    2642                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2643                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2644              
    2645              $C$DW$151       .dwtag  DW_TAG_member
    2646                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2647                      .dwattr $C$DW$151, DW_AT_name("rsvd2")
    2648                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd2")
    2649                      .dwattr $C$DW$151, DW_AT_bit_offset(0x00)
    2650                      .dwattr $C$DW$151, DW_AT_bit_size(0x10)
    2651                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2652                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2653              
    2654                      .dwendtag $C$DW$T$41
    2655              
    2656              
    2657              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2658                      .dwattr $C$DW$T$42, DW_AT_name("AUXPLLSTS_REG")
    2659                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2660              $C$DW$152       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$27)
    2662                      .dwattr $C$DW$152, DW_AT_name("all")
    2663                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_all")
    2664                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2665                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2666              
    2667              $C$DW$153       .dwtag  DW_TAG_member
    2668                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$41)
    2669                      .dwattr $C$DW$153, DW_AT_name("bit")
    2670                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_bit")
    2671                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2672                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2673              
    2674                      .dwendtag $C$DW$T$42
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   53

    2675              
    2676              
    2677              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2678                      .dwattr $C$DW$T$43, DW_AT_name("CLKCFGLOCK1_BITS")
    2679                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2680              $C$DW$154       .dwtag  DW_TAG_member
    2681                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2682                      .dwattr $C$DW$154, DW_AT_name("CLKSRCCTL1")
    2683                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    2684                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0f)
    2685                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    2686                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2687                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2688              
    2689              $C$DW$155       .dwtag  DW_TAG_member
    2690                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2691                      .dwattr $C$DW$155, DW_AT_name("CLKSRCCTL2")
    2692                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    2693                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0e)
    2694                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2695                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2696                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2697              
    2698              $C$DW$156       .dwtag  DW_TAG_member
    2699                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2700                      .dwattr $C$DW$156, DW_AT_name("CLKSRCCTL3")
    2701                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    2702                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0d)
    2703                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2704                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2705                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2706              
    2707              $C$DW$157       .dwtag  DW_TAG_member
    2708                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2709                      .dwattr $C$DW$157, DW_AT_name("SYSPLLCTL1")
    2710                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    2711                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0c)
    2712                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2713                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2714                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2715              
    2716              $C$DW$158       .dwtag  DW_TAG_member
    2717                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2718                      .dwattr $C$DW$158, DW_AT_name("SYSPLLCTL2")
    2719                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    2720                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0b)
    2721                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2722                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2723                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2724              
    2725              $C$DW$159       .dwtag  DW_TAG_member
    2726                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2727                      .dwattr $C$DW$159, DW_AT_name("SYSPLLCTL3")
    2728                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    2729                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0a)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   54

    2730                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2731                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2732                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2733              
    2734              $C$DW$160       .dwtag  DW_TAG_member
    2735                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2736                      .dwattr $C$DW$160, DW_AT_name("SYSPLLMULT")
    2737                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_SYSPLLMULT")
    2738                      .dwattr $C$DW$160, DW_AT_bit_offset(0x09)
    2739                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2740                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2741                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2742              
    2743              $C$DW$161       .dwtag  DW_TAG_member
    2744                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2745                      .dwattr $C$DW$161, DW_AT_name("AUXPLLCTL1")
    2746                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    2747                      .dwattr $C$DW$161, DW_AT_bit_offset(0x08)
    2748                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2749                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2750                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2751              
    2752              $C$DW$162       .dwtag  DW_TAG_member
    2753                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2754                      .dwattr $C$DW$162, DW_AT_name("rsvd1")
    2755                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd1")
    2756                      .dwattr $C$DW$162, DW_AT_bit_offset(0x07)
    2757                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2758                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2759                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2760              
    2761              $C$DW$163       .dwtag  DW_TAG_member
    2762                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2763                      .dwattr $C$DW$163, DW_AT_name("rsvd2")
    2764                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd2")
    2765                      .dwattr $C$DW$163, DW_AT_bit_offset(0x06)
    2766                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2767                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2768                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2769              
    2770              $C$DW$164       .dwtag  DW_TAG_member
    2771                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2772                      .dwattr $C$DW$164, DW_AT_name("AUXPLLMULT")
    2773                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_AUXPLLMULT")
    2774                      .dwattr $C$DW$164, DW_AT_bit_offset(0x05)
    2775                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2776                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2777                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2778              
    2779              $C$DW$165       .dwtag  DW_TAG_member
    2780                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2781                      .dwattr $C$DW$165, DW_AT_name("SYSCLKDIVSEL")
    2782                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    2783                      .dwattr $C$DW$165, DW_AT_bit_offset(0x04)
    2784                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   55

    2785                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2786                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2787              
    2788              $C$DW$166       .dwtag  DW_TAG_member
    2789                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2790                      .dwattr $C$DW$166, DW_AT_name("AUXCLKDIVSEL")
    2791                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    2792                      .dwattr $C$DW$166, DW_AT_bit_offset(0x03)
    2793                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2794                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2795                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2796              
    2797              $C$DW$167       .dwtag  DW_TAG_member
    2798                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2799                      .dwattr $C$DW$167, DW_AT_name("PERCLKDIVSEL")
    2800                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    2801                      .dwattr $C$DW$167, DW_AT_bit_offset(0x02)
    2802                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2803                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2804                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2805              
    2806              $C$DW$168       .dwtag  DW_TAG_member
    2807                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2808                      .dwattr $C$DW$168, DW_AT_name("rsvd3")
    2809                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd3")
    2810                      .dwattr $C$DW$168, DW_AT_bit_offset(0x01)
    2811                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2812                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2813                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2814              
    2815              $C$DW$169       .dwtag  DW_TAG_member
    2816                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2817                      .dwattr $C$DW$169, DW_AT_name("LOSPCP")
    2818                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_LOSPCP")
    2819                      .dwattr $C$DW$169, DW_AT_bit_offset(0x00)
    2820                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2821                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2822                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2823              
    2824              $C$DW$170       .dwtag  DW_TAG_member
    2825                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2826                      .dwattr $C$DW$170, DW_AT_name("rsvd4")
    2827                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd4")
    2828                      .dwattr $C$DW$170, DW_AT_bit_offset(0x00)
    2829                      .dwattr $C$DW$170, DW_AT_bit_size(0x10)
    2830                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2831                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2832              
    2833                      .dwendtag $C$DW$T$43
    2834              
    2835              
    2836              $C$DW$T$44      .dwtag  DW_TAG_union_type
    2837                      .dwattr $C$DW$T$44, DW_AT_name("CLKCFGLOCK1_REG")
    2838                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2839              $C$DW$171       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   56

    2840                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$27)
    2841                      .dwattr $C$DW$171, DW_AT_name("all")
    2842                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_all")
    2843                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2844                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2845              
    2846              $C$DW$172       .dwtag  DW_TAG_member
    2847                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$43)
    2848                      .dwattr $C$DW$172, DW_AT_name("bit")
    2849                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_bit")
    2850                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2851                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2852              
    2853                      .dwendtag $C$DW$T$44
    2854              
    2855              
    2856              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2857                      .dwattr $C$DW$T$45, DW_AT_name("CLKSRCCTL1_BITS")
    2858                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2859              $C$DW$173       .dwtag  DW_TAG_member
    2860                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2861                      .dwattr $C$DW$173, DW_AT_name("OSCCLKSRCSEL")
    2862                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    2863                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0e)
    2864                      .dwattr $C$DW$173, DW_AT_bit_size(0x02)
    2865                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2866                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2867              
    2868              $C$DW$174       .dwtag  DW_TAG_member
    2869                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2870                      .dwattr $C$DW$174, DW_AT_name("rsvd1")
    2871                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd1")
    2872                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0d)
    2873                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2874                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2875                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2876              
    2877              $C$DW$175       .dwtag  DW_TAG_member
    2878                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2879                      .dwattr $C$DW$175, DW_AT_name("INTOSC2OFF")
    2880                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_INTOSC2OFF")
    2881                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0c)
    2882                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2883                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2884                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2885              
    2886              $C$DW$176       .dwtag  DW_TAG_member
    2887                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2888                      .dwattr $C$DW$176, DW_AT_name("XTALOFF")
    2889                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_XTALOFF")
    2890                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0b)
    2891                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2892                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2893                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2894              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   57

    2895              $C$DW$177       .dwtag  DW_TAG_member
    2896                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2897                      .dwattr $C$DW$177, DW_AT_name("WDHALTI")
    2898                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_WDHALTI")
    2899                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0a)
    2900                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2901                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2902                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2903              
    2904              $C$DW$178       .dwtag  DW_TAG_member
    2905                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2906                      .dwattr $C$DW$178, DW_AT_name("rsvd2")
    2907                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd2")
    2908                      .dwattr $C$DW$178, DW_AT_bit_offset(0x00)
    2909                      .dwattr $C$DW$178, DW_AT_bit_size(0x0a)
    2910                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2911                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2912              
    2913              $C$DW$179       .dwtag  DW_TAG_member
    2914                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2915                      .dwattr $C$DW$179, DW_AT_name("rsvd3")
    2916                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd3")
    2917                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00)
    2918                      .dwattr $C$DW$179, DW_AT_bit_size(0x10)
    2919                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2920                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2921              
    2922                      .dwendtag $C$DW$T$45
    2923              
    2924              
    2925              $C$DW$T$46      .dwtag  DW_TAG_union_type
    2926                      .dwattr $C$DW$T$46, DW_AT_name("CLKSRCCTL1_REG")
    2927                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2928              $C$DW$180       .dwtag  DW_TAG_member
    2929                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$27)
    2930                      .dwattr $C$DW$180, DW_AT_name("all")
    2931                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_all")
    2932                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2933                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2934              
    2935              $C$DW$181       .dwtag  DW_TAG_member
    2936                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$45)
    2937                      .dwattr $C$DW$181, DW_AT_name("bit")
    2938                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_bit")
    2939                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2940                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2941              
    2942                      .dwendtag $C$DW$T$46
    2943              
    2944              
    2945              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2946                      .dwattr $C$DW$T$47, DW_AT_name("CLKSRCCTL2_BITS")
    2947                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    2948              $C$DW$182       .dwtag  DW_TAG_member
    2949                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   58

    2950                      .dwattr $C$DW$182, DW_AT_name("AUXOSCCLKSRCSEL")
    2951                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    2952                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0e)
    2953                      .dwattr $C$DW$182, DW_AT_bit_size(0x02)
    2954                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2955                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2956              
    2957              $C$DW$183       .dwtag  DW_TAG_member
    2958                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2959                      .dwattr $C$DW$183, DW_AT_name("CANABCLKSEL")
    2960                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_CANABCLKSEL")
    2961                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0c)
    2962                      .dwattr $C$DW$183, DW_AT_bit_size(0x02)
    2963                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2964                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2965              
    2966              $C$DW$184       .dwtag  DW_TAG_member
    2967                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2968                      .dwattr $C$DW$184, DW_AT_name("CANBBCLKSEL")
    2969                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    2970                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0a)
    2971                      .dwattr $C$DW$184, DW_AT_bit_size(0x02)
    2972                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2973                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2974              
    2975              $C$DW$185       .dwtag  DW_TAG_member
    2976                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2977                      .dwattr $C$DW$185, DW_AT_name("rsvd1")
    2978                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd1")
    2979                      .dwattr $C$DW$185, DW_AT_bit_offset(0x08)
    2980                      .dwattr $C$DW$185, DW_AT_bit_size(0x02)
    2981                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2982                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2983              
    2984              $C$DW$186       .dwtag  DW_TAG_member
    2985                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2986                      .dwattr $C$DW$186, DW_AT_name("rsvd2")
    2987                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd2")
    2988                      .dwattr $C$DW$186, DW_AT_bit_offset(0x06)
    2989                      .dwattr $C$DW$186, DW_AT_bit_size(0x02)
    2990                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2991                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2992              
    2993              $C$DW$187       .dwtag  DW_TAG_member
    2994                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2995                      .dwattr $C$DW$187, DW_AT_name("rsvd3")
    2996                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_rsvd3")
    2997                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00)
    2998                      .dwattr $C$DW$187, DW_AT_bit_size(0x06)
    2999                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3000                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3001              
    3002              $C$DW$188       .dwtag  DW_TAG_member
    3003                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    3004                      .dwattr $C$DW$188, DW_AT_name("rsvd4")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   59

    3005                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd4")
    3006                      .dwattr $C$DW$188, DW_AT_bit_offset(0x00)
    3007                      .dwattr $C$DW$188, DW_AT_bit_size(0x10)
    3008                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3009                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3010              
    3011                      .dwendtag $C$DW$T$47
    3012              
    3013              
    3014              $C$DW$T$48      .dwtag  DW_TAG_union_type
    3015                      .dwattr $C$DW$T$48, DW_AT_name("CLKSRCCTL2_REG")
    3016                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    3017              $C$DW$189       .dwtag  DW_TAG_member
    3018                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$27)
    3019                      .dwattr $C$DW$189, DW_AT_name("all")
    3020                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_all")
    3021                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3022                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3023              
    3024              $C$DW$190       .dwtag  DW_TAG_member
    3025                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$47)
    3026                      .dwattr $C$DW$190, DW_AT_name("bit")
    3027                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_bit")
    3028                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3029                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3030              
    3031                      .dwendtag $C$DW$T$48
    3032              
    3033              
    3034              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3035                      .dwattr $C$DW$T$49, DW_AT_name("CLKSRCCTL3_BITS")
    3036                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    3037              $C$DW$191       .dwtag  DW_TAG_member
    3038                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    3039                      .dwattr $C$DW$191, DW_AT_name("XCLKOUTSEL")
    3040                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    3041                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0d)
    3042                      .dwattr $C$DW$191, DW_AT_bit_size(0x03)
    3043                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3044                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3045              
    3046              $C$DW$192       .dwtag  DW_TAG_member
    3047                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    3048                      .dwattr $C$DW$192, DW_AT_name("rsvd1")
    3049                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd1")
    3050                      .dwattr $C$DW$192, DW_AT_bit_offset(0x00)
    3051                      .dwattr $C$DW$192, DW_AT_bit_size(0x0d)
    3052                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3053                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3054              
    3055              $C$DW$193       .dwtag  DW_TAG_member
    3056                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    3057                      .dwattr $C$DW$193, DW_AT_name("rsvd2")
    3058                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd2")
    3059                      .dwattr $C$DW$193, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   60

    3060                      .dwattr $C$DW$193, DW_AT_bit_size(0x10)
    3061                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3062                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3063              
    3064                      .dwendtag $C$DW$T$49
    3065              
    3066              
    3067              $C$DW$T$50      .dwtag  DW_TAG_union_type
    3068                      .dwattr $C$DW$T$50, DW_AT_name("CLKSRCCTL3_REG")
    3069                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    3070              $C$DW$194       .dwtag  DW_TAG_member
    3071                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$27)
    3072                      .dwattr $C$DW$194, DW_AT_name("all")
    3073                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_all")
    3074                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3075                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3076              
    3077              $C$DW$195       .dwtag  DW_TAG_member
    3078                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$49)
    3079                      .dwattr $C$DW$195, DW_AT_name("bit")
    3080                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_bit")
    3081                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3082                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3083              
    3084                      .dwendtag $C$DW$T$50
    3085              
    3086              
    3087              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3088                      .dwattr $C$DW$T$52, DW_AT_name("CLK_CFG_REGS")
    3089                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x32)
    3090              $C$DW$196       .dwtag  DW_TAG_member
    3091                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$21)
    3092                      .dwattr $C$DW$196, DW_AT_name("rsvd1")
    3093                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rsvd1")
    3094                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3095                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3096              
    3097              $C$DW$197       .dwtag  DW_TAG_member
    3098                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$44)
    3099                      .dwattr $C$DW$197, DW_AT_name("CLKCFGLOCK1")
    3100                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    3101                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3102                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3103              
    3104              $C$DW$198       .dwtag  DW_TAG_member
    3105                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$51)
    3106                      .dwattr $C$DW$198, DW_AT_name("rsvd2")
    3107                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_rsvd2")
    3108                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3109                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3110              
    3111              $C$DW$199       .dwtag  DW_TAG_member
    3112                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$46)
    3113                      .dwattr $C$DW$199, DW_AT_name("CLKSRCCTL1")
    3114                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_CLKSRCCTL1")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   61

    3115                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3116                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3117              
    3118              $C$DW$200       .dwtag  DW_TAG_member
    3119                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$48)
    3120                      .dwattr $C$DW$200, DW_AT_name("CLKSRCCTL2")
    3121                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3122                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3123                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3124              
    3125              $C$DW$201       .dwtag  DW_TAG_member
    3126                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$50)
    3127                      .dwattr $C$DW$201, DW_AT_name("CLKSRCCTL3")
    3128                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3129                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3130                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3131              
    3132              $C$DW$202       .dwtag  DW_TAG_member
    3133                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$168)
    3134                      .dwattr $C$DW$202, DW_AT_name("SYSPLLCTL1")
    3135                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    3136                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3137                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3138              
    3139              $C$DW$203       .dwtag  DW_TAG_member
    3140                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$51)
    3141                      .dwattr $C$DW$203, DW_AT_name("rsvd3")
    3142                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd3")
    3143                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3144                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3145              
    3146              $C$DW$204       .dwtag  DW_TAG_member
    3147                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$170)
    3148                      .dwattr $C$DW$204, DW_AT_name("SYSPLLMULT")
    3149                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3150                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3151                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3152              
    3153              $C$DW$205       .dwtag  DW_TAG_member
    3154                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$172)
    3155                      .dwattr $C$DW$205, DW_AT_name("SYSPLLSTS")
    3156                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_SYSPLLSTS")
    3157                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3158                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3159              
    3160              $C$DW$206       .dwtag  DW_TAG_member
    3161                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$38)
    3162                      .dwattr $C$DW$206, DW_AT_name("AUXPLLCTL1")
    3163                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    3164                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3165                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3166              
    3167              $C$DW$207       .dwtag  DW_TAG_member
    3168                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$51)
    3169                      .dwattr $C$DW$207, DW_AT_name("rsvd4")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   62

    3170                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_rsvd4")
    3171                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3172                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3173              
    3174              $C$DW$208       .dwtag  DW_TAG_member
    3175                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$40)
    3176                      .dwattr $C$DW$208, DW_AT_name("AUXPLLMULT")
    3177                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_AUXPLLMULT")
    3178                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3179                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3180              
    3181              $C$DW$209       .dwtag  DW_TAG_member
    3182                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$42)
    3183                      .dwattr $C$DW$209, DW_AT_name("AUXPLLSTS")
    3184                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_AUXPLLSTS")
    3185                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3186                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3187              
    3188              $C$DW$210       .dwtag  DW_TAG_member
    3189                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$166)
    3190                      .dwattr $C$DW$210, DW_AT_name("SYSCLKDIVSEL")
    3191                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    3192                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3193                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3194              
    3195              $C$DW$211       .dwtag  DW_TAG_member
    3196                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$36)
    3197                      .dwattr $C$DW$211, DW_AT_name("AUXCLKDIVSEL")
    3198                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    3199                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3200                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3201              
    3202              $C$DW$212       .dwtag  DW_TAG_member
    3203                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$156)
    3204                      .dwattr $C$DW$212, DW_AT_name("PERCLKDIVSEL")
    3205                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    3206                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3207                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3208              
    3209              $C$DW$213       .dwtag  DW_TAG_member
    3210                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$191)
    3211                      .dwattr $C$DW$213, DW_AT_name("XCLKOUTDIVSEL")
    3212                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    3213                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3214                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3215              
    3216              $C$DW$214       .dwtag  DW_TAG_member
    3217                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$21)
    3218                      .dwattr $C$DW$214, DW_AT_name("rsvd5")
    3219                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_rsvd5")
    3220                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3221                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3222              
    3223              $C$DW$215       .dwtag  DW_TAG_member
    3224                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$120)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   63

    3225                      .dwattr $C$DW$215, DW_AT_name("LOSPCP")
    3226                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_LOSPCP")
    3227                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3228                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3229              
    3230              $C$DW$216       .dwtag  DW_TAG_member
    3231                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$124)
    3232                      .dwattr $C$DW$216, DW_AT_name("MCDCR")
    3233                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_MCDCR")
    3234                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3235                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3236              
    3237              $C$DW$217       .dwtag  DW_TAG_member
    3238                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$189)
    3239                      .dwattr $C$DW$217, DW_AT_name("X1CNT")
    3240                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_X1CNT")
    3241                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3242                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3243              
    3244                      .dwendtag $C$DW$T$52
    3245              
    3246              $C$DW$218       .dwtag  DW_TAG_TI_far_type
    3247                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$52)
    3248              
    3249              $C$DW$T$241     .dwtag  DW_TAG_volatile_type
    3250                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$218)
    3251              
    3252              
    3253              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    3254                      .dwattr $C$DW$T$53, DW_AT_name("CPUSYSLOCK1_BITS")
    3255                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
    3256              $C$DW$219       .dwtag  DW_TAG_member
    3257                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    3258                      .dwattr $C$DW$219, DW_AT_name("HIBBOOTMODE")
    3259                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    3260                      .dwattr $C$DW$219, DW_AT_bit_offset(0x0f)
    3261                      .dwattr $C$DW$219, DW_AT_bit_size(0x01)
    3262                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3263                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3264              
    3265              $C$DW$220       .dwtag  DW_TAG_member
    3266                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    3267                      .dwattr $C$DW$220, DW_AT_name("IORESTOREADDR")
    3268                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_IORESTOREADDR")
    3269                      .dwattr $C$DW$220, DW_AT_bit_offset(0x0e)
    3270                      .dwattr $C$DW$220, DW_AT_bit_size(0x01)
    3271                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3272                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3273              
    3274              $C$DW$221       .dwtag  DW_TAG_member
    3275                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    3276                      .dwattr $C$DW$221, DW_AT_name("PIEVERRADDR")
    3277                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_PIEVERRADDR")
    3278                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0d)
    3279                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   64

    3280                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3281                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3282              
    3283              $C$DW$222       .dwtag  DW_TAG_member
    3284                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    3285                      .dwattr $C$DW$222, DW_AT_name("PCLKCR0")
    3286                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_PCLKCR0")
    3287                      .dwattr $C$DW$222, DW_AT_bit_offset(0x0c)
    3288                      .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    3289                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3290                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3291              
    3292              $C$DW$223       .dwtag  DW_TAG_member
    3293                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    3294                      .dwattr $C$DW$223, DW_AT_name("PCLKCR1")
    3295                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_PCLKCR1")
    3296                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0b)
    3297                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    3298                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3299                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3300              
    3301              $C$DW$224       .dwtag  DW_TAG_member
    3302                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    3303                      .dwattr $C$DW$224, DW_AT_name("PCLKCR2")
    3304                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_PCLKCR2")
    3305                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0a)
    3306                      .dwattr $C$DW$224, DW_AT_bit_size(0x01)
    3307                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3308                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3309              
    3310              $C$DW$225       .dwtag  DW_TAG_member
    3311                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    3312                      .dwattr $C$DW$225, DW_AT_name("PCLKCR3")
    3313                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_PCLKCR3")
    3314                      .dwattr $C$DW$225, DW_AT_bit_offset(0x09)
    3315                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
