TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Fri Jul 31 12:17:34 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Chiaming\CCSworkspace_V10\MonoMtrServo_377s\F2837x_RAM")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("PIE_RESERVED_ISR")

    1545                      .global _EQEP3_ISR
    1546                      .global _SPIA_RX_ISR
    1547                      .global _SPIA_TX_ISR
    1548                      .global _SPIB_RX_ISR
    1549                      .global _SPIB_TX_ISR
    1550                      .global _MCBSPA_RX_ISR
    1551                      .global _MCBSPA_TX_ISR
    1552                      .global _MCBSPB_RX_ISR
    1553                      .global _MCBSPB_TX_ISR
    1554                      .global _DMA_CH1_ISR
    1555                      .global _DMA_CH2_ISR
    1556                      .global _DMA_CH3_ISR
    1557                      .global _DMA_CH4_ISR
    1558                      .global _DMA_CH5_ISR
    1559                      .global _DMA_CH6_ISR
    1560                      .global _I2CA_ISR
    1561                      .global _I2CA_FIFO_ISR
    1562                      .global _I2CB_ISR
    1563                      .global _I2CB_FIFO_ISR
    1564                      .global _SCIC_RX_ISR
    1565                      .global _SCIC_TX_ISR
    1566                      .global _SCID_RX_ISR
    1567                      .global _SCID_TX_ISR
    1568                      .global _SCIA_RX_ISR
    1569                      .global _SCIA_TX_ISR
    1570                      .global _SCIB_RX_ISR
    1571                      .global _SCIB_TX_ISR
    1572                      .global _CANA0_ISR
    1573                      .global _CANA1_ISR
    1574                      .global _CANB0_ISR
    1575                      .global _CANB1_ISR
    1576                      .global _ADCA_EVT_ISR
    1577                      .global _ADCA2_ISR
    1578                      .global _ADCA3_ISR
    1579                      .global _ADCA4_ISR
    1580                      .global _ADCB_EVT_ISR
    1581                      .global _ADCB2_ISR
    1582                      .global _ADCB3_ISR
    1583                      .global _ADCB4_ISR
    1584                      .global _CLA1_1_ISR
    1585                      .global _CLA1_2_ISR
    1586                      .global _CLA1_3_ISR
    1587                      .global _CLA1_4_ISR
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   34

    1588                      .global _CLA1_5_ISR
    1589                      .global _CLA1_6_ISR
    1590                      .global _CLA1_7_ISR
    1591                      .global _CLA1_8_ISR
    1592                      .global _XINT3_ISR
    1593                      .global _XINT4_ISR
    1594                      .global _XINT5_ISR
    1595                      .global _VCU_ISR
    1596                      .global _FPU_OVERFLOW_ISR
    1597                      .global _FPU_UNDERFLOW_ISR
    1598                      .global _IPC0_ISR
    1599                      .global _IPC1_ISR
    1600                      .global _IPC2_ISR
    1601                      .global _IPC3_ISR
    1602                      .global _EPWM9_TZ_ISR
    1603                      .global _EPWM10_TZ_ISR
    1604                      .global _EPWM11_TZ_ISR
    1605                      .global _EPWM12_TZ_ISR
    1606                      .global _EPWM9_ISR
    1607                      .global _EPWM10_ISR
    1608                      .global _EPWM11_ISR
    1609                      .global _EPWM12_ISR
    1610                      .global _SD1_ISR
    1611                      .global _SD2_ISR
    1612                      .global _SPIC_RX_ISR
    1613                      .global _SPIC_TX_ISR
    1614                      .global _UPPA_ISR
    1615                      .global _USBA_ISR
    1616                      .global _ADCC_EVT_ISR
    1617                      .global _ADCC2_ISR
    1618                      .global _ADCC3_ISR
    1619                      .global _ADCC4_ISR
    1620                      .global _ADCD_EVT_ISR
    1621                      .global _ADCD2_ISR
    1622                      .global _ADCD3_ISR
    1623                      .global _ADCD4_ISR
    1624                      .global _EMIF_ERROR_ISR
    1625                      .global _RAM_CORRECTABLE_ERROR_ISR
    1626                      .global _FLASH_CORRECTABLE_ERROR_ISR
    1627                      .global _RAM_ACCESS_VIOLATION_ISR
    1628                      .global _SYS_PLL_SLIP_ISR
    1629                      .global _AUX_PLL_SLIP_ISR
    1630                      .global _CLA_OVERFLOW_ISR
    1631                      .global _CLA_UNDERFLOW_ISR
    1632                      .global _PieCtrlRegs
    1633                      .global _PieVectTable
    1634              
    1635              ;***************************************************************
    1636              ;* TYPE INFORMATION                                            *
    1637              ;***************************************************************
    1638              
    1639              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1640                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
    1641                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1642              $C$DW$148       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   35

    1643                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1644                      .dwattr $C$DW$148, DW_AT_name("ACK1")
    1645                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ACK1")
    1646                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0f)
    1647                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1648                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1649                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1650              
    1651              $C$DW$149       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1653                      .dwattr $C$DW$149, DW_AT_name("ACK2")
    1654                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ACK2")
    1655                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0e)
    1656                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1657                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1658                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1659              
    1660              $C$DW$150       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1662                      .dwattr $C$DW$150, DW_AT_name("ACK3")
    1663                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ACK3")
    1664                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0d)
    1665                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1666                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1667                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1668              
    1669              $C$DW$151       .dwtag  DW_TAG_member
    1670                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1671                      .dwattr $C$DW$151, DW_AT_name("ACK4")
    1672                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ACK4")
    1673                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0c)
    1674                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1675                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1676                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1677              
    1678              $C$DW$152       .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1680                      .dwattr $C$DW$152, DW_AT_name("ACK5")
    1681                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ACK5")
    1682                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0b)
    1683                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1684                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1685                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1686              
    1687              $C$DW$153       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1689                      .dwattr $C$DW$153, DW_AT_name("ACK6")
    1690                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_ACK6")
    1691                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0a)
    1692                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1693                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1694                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1695              
    1696              $C$DW$154       .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   36

    1698                      .dwattr $C$DW$154, DW_AT_name("ACK7")
    1699                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ACK7")
    1700                      .dwattr $C$DW$154, DW_AT_bit_offset(0x09)
    1701                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1702                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1703                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1704              
    1705              $C$DW$155       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1707                      .dwattr $C$DW$155, DW_AT_name("ACK8")
    1708                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ACK8")
    1709                      .dwattr $C$DW$155, DW_AT_bit_offset(0x08)
    1710                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1711                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1712                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1713              
    1714              $C$DW$156       .dwtag  DW_TAG_member
    1715                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1716                      .dwattr $C$DW$156, DW_AT_name("ACK9")
    1717                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ACK9")
    1718                      .dwattr $C$DW$156, DW_AT_bit_offset(0x07)
    1719                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1720                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1721                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1722              
    1723              $C$DW$157       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1725                      .dwattr $C$DW$157, DW_AT_name("ACK10")
    1726                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_ACK10")
    1727                      .dwattr $C$DW$157, DW_AT_bit_offset(0x06)
    1728                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    1729                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1730                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1731              
    1732              $C$DW$158       .dwtag  DW_TAG_member
    1733                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1734                      .dwattr $C$DW$158, DW_AT_name("ACK11")
    1735                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ACK11")
    1736                      .dwattr $C$DW$158, DW_AT_bit_offset(0x05)
    1737                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    1738                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1739                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1740              
    1741              $C$DW$159       .dwtag  DW_TAG_member
    1742                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1743                      .dwattr $C$DW$159, DW_AT_name("ACK12")
    1744                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ACK12")
    1745                      .dwattr $C$DW$159, DW_AT_bit_offset(0x04)
    1746                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    1747                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1748                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1749              
    1750              $C$DW$160       .dwtag  DW_TAG_member
    1751                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1752                      .dwattr $C$DW$160, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   37

    1753                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd1")
    1754                      .dwattr $C$DW$160, DW_AT_bit_offset(0x00)
    1755                      .dwattr $C$DW$160, DW_AT_bit_size(0x04)
    1756                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1757                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1758              
    1759                      .dwendtag $C$DW$T$20
    1760              
    1761              
    1762              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1763                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
    1764                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1765              $C$DW$161       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1767                      .dwattr $C$DW$161, DW_AT_name("all")
    1768                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_all")
    1769                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1770                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1771              
    1772              $C$DW$162       .dwtag  DW_TAG_member
    1773                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    1774                      .dwattr $C$DW$162, DW_AT_name("bit")
    1775                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_bit")
    1776                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1777                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1778              
    1779                      .dwendtag $C$DW$T$21
    1780              
    1781              
    1782              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1783                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
    1784                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1785              $C$DW$163       .dwtag  DW_TAG_member
    1786                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1787                      .dwattr $C$DW$163, DW_AT_name("ENPIE")
    1788                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_ENPIE")
    1789                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0f)
    1790                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    1791                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1792                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1793              
    1794              $C$DW$164       .dwtag  DW_TAG_member
    1795                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1796                      .dwattr $C$DW$164, DW_AT_name("PIEVECT")
    1797                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PIEVECT")
    1798                      .dwattr $C$DW$164, DW_AT_bit_offset(0x00)
    1799                      .dwattr $C$DW$164, DW_AT_bit_size(0x0f)
    1800                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1801                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1802              
    1803                      .dwendtag $C$DW$T$22
    1804              
    1805              
    1806              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1807                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   38

    1808                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1809              $C$DW$165       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1811                      .dwattr $C$DW$165, DW_AT_name("all")
    1812                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_all")
    1813                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1814                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1815              
    1816              $C$DW$166       .dwtag  DW_TAG_member
    1817                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$22)
    1818                      .dwattr $C$DW$166, DW_AT_name("bit")
    1819                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_bit")
    1820                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1821                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1822              
    1823                      .dwendtag $C$DW$T$23
    1824              
    1825              
    1826              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1827                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER10_BITS")
    1828                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1829              $C$DW$167       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1831                      .dwattr $C$DW$167, DW_AT_name("INTx1")
    1832                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_INTx1")
    1833                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0f)
    1834                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    1835                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1836                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1837              
    1838              $C$DW$168       .dwtag  DW_TAG_member
    1839                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1840                      .dwattr $C$DW$168, DW_AT_name("INTx2")
    1841                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_INTx2")
    1842                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0e)
    1843                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    1844                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1845                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1846              
    1847              $C$DW$169       .dwtag  DW_TAG_member
    1848                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1849                      .dwattr $C$DW$169, DW_AT_name("INTx3")
    1850                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_INTx3")
    1851                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0d)
    1852                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    1853                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1854                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1855              
    1856              $C$DW$170       .dwtag  DW_TAG_member
    1857                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1858                      .dwattr $C$DW$170, DW_AT_name("INTx4")
    1859                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_INTx4")
    1860                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0c)
    1861                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    1862                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   39

    1863                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1864              
    1865              $C$DW$171       .dwtag  DW_TAG_member
    1866                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1867                      .dwattr $C$DW$171, DW_AT_name("INTx5")
    1868                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_INTx5")
    1869                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0b)
    1870                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    1871                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1872                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1873              
    1874              $C$DW$172       .dwtag  DW_TAG_member
    1875                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1876                      .dwattr $C$DW$172, DW_AT_name("INTx6")
    1877                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_INTx6")
    1878                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0a)
    1879                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    1880                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1881                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1882              
    1883              $C$DW$173       .dwtag  DW_TAG_member
    1884                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1885                      .dwattr $C$DW$173, DW_AT_name("INTx7")
    1886                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_INTx7")
    1887                      .dwattr $C$DW$173, DW_AT_bit_offset(0x09)
    1888                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    1889                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1890                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1891              
    1892              $C$DW$174       .dwtag  DW_TAG_member
    1893                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1894                      .dwattr $C$DW$174, DW_AT_name("INTx8")
    1895                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_INTx8")
    1896                      .dwattr $C$DW$174, DW_AT_bit_offset(0x08)
    1897                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    1898                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1899                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1900              
    1901              $C$DW$175       .dwtag  DW_TAG_member
    1902                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1903                      .dwattr $C$DW$175, DW_AT_name("INTx9")
    1904                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_INTx9")
    1905                      .dwattr $C$DW$175, DW_AT_bit_offset(0x07)
    1906                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    1907                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1908                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1909              
    1910              $C$DW$176       .dwtag  DW_TAG_member
    1911                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1912                      .dwattr $C$DW$176, DW_AT_name("INTx10")
    1913                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_INTx10")
    1914                      .dwattr $C$DW$176, DW_AT_bit_offset(0x06)
    1915                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    1916                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1917                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   40

    1918              
    1919              $C$DW$177       .dwtag  DW_TAG_member
    1920                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1921                      .dwattr $C$DW$177, DW_AT_name("INTx11")
    1922                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_INTx11")
    1923                      .dwattr $C$DW$177, DW_AT_bit_offset(0x05)
    1924                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    1925                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1926                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1927              
    1928              $C$DW$178       .dwtag  DW_TAG_member
    1929                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1930                      .dwattr $C$DW$178, DW_AT_name("INTx12")
    1931                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_INTx12")
    1932                      .dwattr $C$DW$178, DW_AT_bit_offset(0x04)
    1933                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    1934                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1935                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1936              
    1937              $C$DW$179       .dwtag  DW_TAG_member
    1938                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1939                      .dwattr $C$DW$179, DW_AT_name("INTx13")
    1940                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_INTx13")
    1941                      .dwattr $C$DW$179, DW_AT_bit_offset(0x03)
    1942                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    1943                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1944                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1945              
    1946              $C$DW$180       .dwtag  DW_TAG_member
    1947                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1948                      .dwattr $C$DW$180, DW_AT_name("INTx14")
    1949                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_INTx14")
    1950                      .dwattr $C$DW$180, DW_AT_bit_offset(0x02)
    1951                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    1952                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1953                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1954              
    1955              $C$DW$181       .dwtag  DW_TAG_member
    1956                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1957                      .dwattr $C$DW$181, DW_AT_name("INTx15")
    1958                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_INTx15")
    1959                      .dwattr $C$DW$181, DW_AT_bit_offset(0x01)
    1960                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    1961                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1962                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1963              
    1964              $C$DW$182       .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1966                      .dwattr $C$DW$182, DW_AT_name("INTx16")
    1967                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_INTx16")
    1968                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    1969                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    1970                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1971                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1972              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   41

    1973                      .dwendtag $C$DW$T$24
    1974              
    1975              
    1976              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1977                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER10_REG")
    1978                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1979              $C$DW$183       .dwtag  DW_TAG_member
    1980                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1981                      .dwattr $C$DW$183, DW_AT_name("all")
    1982                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_all")
    1983                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1984                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1985              
    1986              $C$DW$184       .dwtag  DW_TAG_member
    1987                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$24)
    1988                      .dwattr $C$DW$184, DW_AT_name("bit")
    1989                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_bit")
    1990                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1992              
    1993                      .dwendtag $C$DW$T$25
    1994              
    1995              
    1996              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1997                      .dwattr $C$DW$T$26, DW_AT_name("PIEIER11_BITS")
    1998                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1999              $C$DW$185       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2001                      .dwattr $C$DW$185, DW_AT_name("INTx1")
    2002                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_INTx1")
    2003                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0f)
    2004                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2005                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2006                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2007              
    2008              $C$DW$186       .dwtag  DW_TAG_member
    2009                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2010                      .dwattr $C$DW$186, DW_AT_name("INTx2")
    2011                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_INTx2")
    2012                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0e)
    2013                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2014                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2015                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2016              
    2017              $C$DW$187       .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2019                      .dwattr $C$DW$187, DW_AT_name("INTx3")
    2020                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_INTx3")
    2021                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0d)
    2022                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    2023                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2024                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2025              
    2026              $C$DW$188       .dwtag  DW_TAG_member
    2027                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   42

    2028                      .dwattr $C$DW$188, DW_AT_name("INTx4")
    2029                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_INTx4")
    2030                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0c)
    2031                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2032                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2033                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2034              
    2035              $C$DW$189       .dwtag  DW_TAG_member
    2036                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2037                      .dwattr $C$DW$189, DW_AT_name("INTx5")
    2038                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_INTx5")
    2039                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0b)
    2040                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2041                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2042                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2043              
    2044              $C$DW$190       .dwtag  DW_TAG_member
    2045                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2046                      .dwattr $C$DW$190, DW_AT_name("INTx6")
    2047                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_INTx6")
    2048                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0a)
    2049                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2050                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2051                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2052              
    2053              $C$DW$191       .dwtag  DW_TAG_member
    2054                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2055                      .dwattr $C$DW$191, DW_AT_name("INTx7")
    2056                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_INTx7")
    2057                      .dwattr $C$DW$191, DW_AT_bit_offset(0x09)
    2058                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2059                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2060                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2061              
    2062              $C$DW$192       .dwtag  DW_TAG_member
    2063                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2064                      .dwattr $C$DW$192, DW_AT_name("INTx8")
    2065                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_INTx8")
    2066                      .dwattr $C$DW$192, DW_AT_bit_offset(0x08)
    2067                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2068                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2069                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2070              
    2071              $C$DW$193       .dwtag  DW_TAG_member
    2072                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2073                      .dwattr $C$DW$193, DW_AT_name("INTx9")
    2074                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_INTx9")
    2075                      .dwattr $C$DW$193, DW_AT_bit_offset(0x07)
    2076                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2077                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2078                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2079              
    2080              $C$DW$194       .dwtag  DW_TAG_member
    2081                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2082                      .dwattr $C$DW$194, DW_AT_name("INTx10")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   43

    2083                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_INTx10")
    2084                      .dwattr $C$DW$194, DW_AT_bit_offset(0x06)
    2085                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2086                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2087                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2088              
    2089              $C$DW$195       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2091                      .dwattr $C$DW$195, DW_AT_name("INTx11")
    2092                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_INTx11")
    2093                      .dwattr $C$DW$195, DW_AT_bit_offset(0x05)
    2094                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2095                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2096                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2097              
    2098              $C$DW$196       .dwtag  DW_TAG_member
    2099                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2100                      .dwattr $C$DW$196, DW_AT_name("INTx12")
    2101                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_INTx12")
    2102                      .dwattr $C$DW$196, DW_AT_bit_offset(0x04)
    2103                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    2104                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2105                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2106              
    2107              $C$DW$197       .dwtag  DW_TAG_member
    2108                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2109                      .dwattr $C$DW$197, DW_AT_name("INTx13")
    2110                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_INTx13")
    2111                      .dwattr $C$DW$197, DW_AT_bit_offset(0x03)
    2112                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2113                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2114                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2115              
    2116              $C$DW$198       .dwtag  DW_TAG_member
    2117                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2118                      .dwattr $C$DW$198, DW_AT_name("INTx14")
    2119                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_INTx14")
    2120                      .dwattr $C$DW$198, DW_AT_bit_offset(0x02)
    2121                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    2122                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2123                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2124              
    2125              $C$DW$199       .dwtag  DW_TAG_member
    2126                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2127                      .dwattr $C$DW$199, DW_AT_name("INTx15")
    2128                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_INTx15")
    2129                      .dwattr $C$DW$199, DW_AT_bit_offset(0x01)
    2130                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2131                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2132                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2133              
    2134              $C$DW$200       .dwtag  DW_TAG_member
    2135                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2136                      .dwattr $C$DW$200, DW_AT_name("INTx16")
    2137                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_INTx16")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   44

    2138                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00)
    2139                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2140                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2141                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2142              
    2143                      .dwendtag $C$DW$T$26
    2144              
    2145              
    2146              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2147                      .dwattr $C$DW$T$27, DW_AT_name("PIEIER11_REG")
    2148                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2149              $C$DW$201       .dwtag  DW_TAG_member
    2150                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2151                      .dwattr $C$DW$201, DW_AT_name("all")
    2152                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_all")
    2153                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2154                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2155              
    2156              $C$DW$202       .dwtag  DW_TAG_member
    2157                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$26)
    2158                      .dwattr $C$DW$202, DW_AT_name("bit")
    2159                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_bit")
    2160                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2161                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2162              
    2163                      .dwendtag $C$DW$T$27
    2164              
    2165              
    2166              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2167                      .dwattr $C$DW$T$28, DW_AT_name("PIEIER12_BITS")
    2168                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2169              $C$DW$203       .dwtag  DW_TAG_member
    2170                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2171                      .dwattr $C$DW$203, DW_AT_name("INTx1")
    2172                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_INTx1")
    2173                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0f)
    2174                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2175                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2176                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2177              
    2178              $C$DW$204       .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2180                      .dwattr $C$DW$204, DW_AT_name("INTx2")
    2181                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_INTx2")
    2182                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0e)
    2183                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2184                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2185                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2186              
    2187              $C$DW$205       .dwtag  DW_TAG_member
    2188                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2189                      .dwattr $C$DW$205, DW_AT_name("INTx3")
    2190                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_INTx3")
    2191                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0d)
    2192                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   45

    2193                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2194                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2195              
    2196              $C$DW$206       .dwtag  DW_TAG_member
    2197                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2198                      .dwattr $C$DW$206, DW_AT_name("INTx4")
    2199                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_INTx4")
    2200                      .dwattr $C$DW$206, DW_AT_bit_offset(0x0c)
    2201                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    2202                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2203                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2204              
    2205              $C$DW$207       .dwtag  DW_TAG_member
    2206                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2207                      .dwattr $C$DW$207, DW_AT_name("INTx5")
    2208                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_INTx5")
    2209                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0b)
    2210                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2211                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2212                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2213              
    2214              $C$DW$208       .dwtag  DW_TAG_member
    2215                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2216                      .dwattr $C$DW$208, DW_AT_name("INTx6")
    2217                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_INTx6")
    2218                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0a)
    2219                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    2220                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2221                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2222              
    2223              $C$DW$209       .dwtag  DW_TAG_member
    2224                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2225                      .dwattr $C$DW$209, DW_AT_name("INTx7")
    2226                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_INTx7")
    2227                      .dwattr $C$DW$209, DW_AT_bit_offset(0x09)
    2228                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    2229                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2230                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2231              
    2232              $C$DW$210       .dwtag  DW_TAG_member
    2233                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2234                      .dwattr $C$DW$210, DW_AT_name("INTx8")
    2235                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_INTx8")
    2236                      .dwattr $C$DW$210, DW_AT_bit_offset(0x08)
    2237                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2238                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2239                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2240              
    2241              $C$DW$211       .dwtag  DW_TAG_member
    2242                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2243                      .dwattr $C$DW$211, DW_AT_name("INTx9")
    2244                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_INTx9")
    2245                      .dwattr $C$DW$211, DW_AT_bit_offset(0x07)
    2246                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    2247                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   46

    2248                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2249              
    2250              $C$DW$212       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2252                      .dwattr $C$DW$212, DW_AT_name("INTx10")
    2253                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_INTx10")
    2254                      .dwattr $C$DW$212, DW_AT_bit_offset(0x06)
    2255                      .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    2256                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2257                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2258              
    2259              $C$DW$213       .dwtag  DW_TAG_member
    2260                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2261                      .dwattr $C$DW$213, DW_AT_name("INTx11")
    2262                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_INTx11")
    2263                      .dwattr $C$DW$213, DW_AT_bit_offset(0x05)
    2264                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    2265                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2266                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2267              
    2268              $C$DW$214       .dwtag  DW_TAG_member
    2269                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2270                      .dwattr $C$DW$214, DW_AT_name("INTx12")
    2271                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_INTx12")
    2272                      .dwattr $C$DW$214, DW_AT_bit_offset(0x04)
    2273                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    2274                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2275                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2276              
    2277              $C$DW$215       .dwtag  DW_TAG_member
    2278                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2279                      .dwattr $C$DW$215, DW_AT_name("INTx13")
    2280                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_INTx13")
    2281                      .dwattr $C$DW$215, DW_AT_bit_offset(0x03)
    2282                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    2283                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2284                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2285              
    2286              $C$DW$216       .dwtag  DW_TAG_member
    2287                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2288                      .dwattr $C$DW$216, DW_AT_name("INTx14")
    2289                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_INTx14")
    2290                      .dwattr $C$DW$216, DW_AT_bit_offset(0x02)
    2291                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    2292                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2293                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2294              
    2295              $C$DW$217       .dwtag  DW_TAG_member
    2296                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2297                      .dwattr $C$DW$217, DW_AT_name("INTx15")
    2298                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_INTx15")
    2299                      .dwattr $C$DW$217, DW_AT_bit_offset(0x01)
    2300                      .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    2301                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2302                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   47

    2303              
    2304              $C$DW$218       .dwtag  DW_TAG_member
    2305                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2306                      .dwattr $C$DW$218, DW_AT_name("INTx16")
    2307                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_INTx16")
    2308                      .dwattr $C$DW$218, DW_AT_bit_offset(0x00)
    2309                      .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    2310                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2311                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2312              
    2313                      .dwendtag $C$DW$T$28
    2314              
    2315              
    2316              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2317                      .dwattr $C$DW$T$29, DW_AT_name("PIEIER12_REG")
    2318                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2319              $C$DW$219       .dwtag  DW_TAG_member
    2320                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2321                      .dwattr $C$DW$219, DW_AT_name("all")
    2322                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_all")
    2323                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2324                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2325              
    2326              $C$DW$220       .dwtag  DW_TAG_member
    2327                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$28)
    2328                      .dwattr $C$DW$220, DW_AT_name("bit")
    2329                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_bit")
    2330                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2331                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2332              
    2333                      .dwendtag $C$DW$T$29
    2334              
    2335              
    2336              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2337                      .dwattr $C$DW$T$30, DW_AT_name("PIEIER1_BITS")
    2338                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2339              $C$DW$221       .dwtag  DW_TAG_member
    2340                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2341                      .dwattr $C$DW$221, DW_AT_name("INTx1")
    2342                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_INTx1")
    2343                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0f)
    2344                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    2345                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2346                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2347              
    2348              $C$DW$222       .dwtag  DW_TAG_member
    2349                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2350                      .dwattr $C$DW$222, DW_AT_name("INTx2")
    2351                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_INTx2")
    2352                      .dwattr $C$DW$222, DW_AT_bit_offset(0x0e)
    2353                      .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    2354                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2355                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2356              
    2357              $C$DW$223       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   48

    2358                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2359                      .dwattr $C$DW$223, DW_AT_name("INTx3")
    2360                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_INTx3")
    2361                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0d)
    2362                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    2363                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2364                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2365              
    2366              $C$DW$224       .dwtag  DW_TAG_member
    2367                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2368                      .dwattr $C$DW$224, DW_AT_name("INTx4")
    2369                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_INTx4")
    2370                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0c)
    2371                      .dwattr $C$DW$224, DW_AT_bit_size(0x01)
    2372                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2373                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2374              
    2375              $C$DW$225       .dwtag  DW_TAG_member
    2376                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2377                      .dwattr $C$DW$225, DW_AT_name("INTx5")
    2378                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_INTx5")
    2379                      .dwattr $C$DW$225, DW_AT_bit_offset(0x0b)
    2380                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    2381                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2382                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2383              
    2384              $C$DW$226       .dwtag  DW_TAG_member
    2385                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    2386                      .dwattr $C$DW$226, DW_AT_name("INTx6")
    2387                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_INTx6")
    2388                      .dwattr $C$DW$226, DW_AT_bit_offset(0x0a)
    2389                      .dwattr $C$DW$226, DW_AT_bit_size(0x01)
    2390                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2391                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2392              
    2393              $C$DW$227       .dwtag  DW_TAG_member
    2394                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    2395                      .dwattr $C$DW$227, DW_AT_name("INTx7")
    2396                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_INTx7")
    2397                      .dwattr $C$DW$227, DW_AT_bit_offset(0x09)
    2398                      .dwattr $C$DW$227, DW_AT_bit_size(0x01)
    2399                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2400                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2401              
    2402              $C$DW$228       .dwtag  DW_TAG_member
    2403                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    2404                      .dwattr $C$DW$228, DW_AT_name("INTx8")
    2405                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_INTx8")
    2406                      .dwattr $C$DW$228, DW_AT_bit_offset(0x08)
    2407                      .dwattr $C$DW$228, DW_AT_bit_size(0x01)
    2408                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2409                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2410              
    2411              $C$DW$229       .dwtag  DW_TAG_member
    2412                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   49

    2413                      .dwattr $C$DW$229, DW_AT_name("INTx9")
    2414                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_INTx9")
    2415                      .dwattr $C$DW$229, DW_AT_bit_offset(0x07)
    2416                      .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    2417                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2418                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2419              
    2420              $C$DW$230       .dwtag  DW_TAG_member
    2421                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    2422                      .dwattr $C$DW$230, DW_AT_name("INTx10")
    2423                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_INTx10")
    2424                      .dwattr $C$DW$230, DW_AT_bit_offset(0x06)
    2425                      .dwattr $C$DW$230, DW_AT_bit_size(0x01)
    2426                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2427                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2428              
    2429              $C$DW$231       .dwtag  DW_TAG_member
    2430                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    2431                      .dwattr $C$DW$231, DW_AT_name("INTx11")
    2432                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_INTx11")
    2433                      .dwattr $C$DW$231, DW_AT_bit_offset(0x05)
    2434                      .dwattr $C$DW$231, DW_AT_bit_size(0x01)
    2435                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2436                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2437              
    2438              $C$DW$232       .dwtag  DW_TAG_member
    2439                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    2440                      .dwattr $C$DW$232, DW_AT_name("INTx12")
    2441                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_INTx12")
    2442                      .dwattr $C$DW$232, DW_AT_bit_offset(0x04)
    2443                      .dwattr $C$DW$232, DW_AT_bit_size(0x01)
    2444                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2445                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2446              
    2447              $C$DW$233       .dwtag  DW_TAG_member
    2448                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    2449                      .dwattr $C$DW$233, DW_AT_name("INTx13")
    2450                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_INTx13")
    2451                      .dwattr $C$DW$233, DW_AT_bit_offset(0x03)
    2452                      .dwattr $C$DW$233, DW_AT_bit_size(0x01)
    2453                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2454                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2455              
    2456              $C$DW$234       .dwtag  DW_TAG_member
    2457                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    2458                      .dwattr $C$DW$234, DW_AT_name("INTx14")
    2459                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_INTx14")
    2460                      .dwattr $C$DW$234, DW_AT_bit_offset(0x02)
    2461                      .dwattr $C$DW$234, DW_AT_bit_size(0x01)
    2462                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2463                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2464              
    2465              $C$DW$235       .dwtag  DW_TAG_member
    2466                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    2467                      .dwattr $C$DW$235, DW_AT_name("INTx15")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   50

    2468                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_INTx15")
    2469                      .dwattr $C$DW$235, DW_AT_bit_offset(0x01)
    2470                      .dwattr $C$DW$235, DW_AT_bit_size(0x01)
    2471                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2472                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2473              
    2474              $C$DW$236       .dwtag  DW_TAG_member
    2475                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    2476                      .dwattr $C$DW$236, DW_AT_name("INTx16")
    2477                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_INTx16")
    2478                      .dwattr $C$DW$236, DW_AT_bit_offset(0x00)
    2479                      .dwattr $C$DW$236, DW_AT_bit_size(0x01)
    2480                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2481                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2482              
    2483                      .dwendtag $C$DW$T$30
    2484              
    2485              
    2486              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2487                      .dwattr $C$DW$T$31, DW_AT_name("PIEIER1_REG")
    2488                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2489              $C$DW$237       .dwtag  DW_TAG_member
    2490                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    2491                      .dwattr $C$DW$237, DW_AT_name("all")
    2492                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_all")
    2493                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2494                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2495              
    2496              $C$DW$238       .dwtag  DW_TAG_member
    2497                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$30)
    2498                      .dwattr $C$DW$238, DW_AT_name("bit")
    2499                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_bit")
    2500                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2501                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2502              
    2503                      .dwendtag $C$DW$T$31
    2504              
    2505              
    2506              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2507                      .dwattr $C$DW$T$32, DW_AT_name("PIEIER2_BITS")
    2508                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2509              $C$DW$239       .dwtag  DW_TAG_member
    2510                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    2511                      .dwattr $C$DW$239, DW_AT_name("INTx1")
    2512                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_INTx1")
    2513                      .dwattr $C$DW$239, DW_AT_bit_offset(0x0f)
    2514                      .dwattr $C$DW$239, DW_AT_bit_size(0x01)
    2515                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2516                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2517              
    2518              $C$DW$240       .dwtag  DW_TAG_member
    2519                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    2520                      .dwattr $C$DW$240, DW_AT_name("INTx2")
    2521                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_INTx2")
    2522                      .dwattr $C$DW$240, DW_AT_bit_offset(0x0e)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   51

    2523                      .dwattr $C$DW$240, DW_AT_bit_size(0x01)
    2524                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2525                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2526              
    2527              $C$DW$241       .dwtag  DW_TAG_member
    2528                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    2529                      .dwattr $C$DW$241, DW_AT_name("INTx3")
    2530                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_INTx3")
    2531                      .dwattr $C$DW$241, DW_AT_bit_offset(0x0d)
    2532                      .dwattr $C$DW$241, DW_AT_bit_size(0x01)
    2533                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2534                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2535              
    2536              $C$DW$242       .dwtag  DW_TAG_member
    2537                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    2538                      .dwattr $C$DW$242, DW_AT_name("INTx4")
    2539                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_INTx4")
    2540                      .dwattr $C$DW$242, DW_AT_bit_offset(0x0c)
    2541                      .dwattr $C$DW$242, DW_AT_bit_size(0x01)
    2542                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2543                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2544              
    2545              $C$DW$243       .dwtag  DW_TAG_member
    2546                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    2547                      .dwattr $C$DW$243, DW_AT_name("INTx5")
    2548                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_INTx5")
    2549                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0b)
    2550                      .dwattr $C$DW$243, DW_AT_bit_size(0x01)
    2551                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2552                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2553              
    2554              $C$DW$244       .dwtag  DW_TAG_member
    2555                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    2556                      .dwattr $C$DW$244, DW_AT_name("INTx6")
    2557                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_INTx6")
    2558                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0a)
    2559                      .dwattr $C$DW$244, DW_AT_bit_size(0x01)
    2560                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2561                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2562              
    2563              $C$DW$245       .dwtag  DW_TAG_member
    2564                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    2565                      .dwattr $C$DW$245, DW_AT_name("INTx7")
    2566                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_INTx7")
    2567                      .dwattr $C$DW$245, DW_AT_bit_offset(0x09)
    2568                      .dwattr $C$DW$245, DW_AT_bit_size(0x01)
    2569                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2570                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2571              
    2572              $C$DW$246       .dwtag  DW_TAG_member
    2573                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    2574                      .dwattr $C$DW$246, DW_AT_name("INTx8")
    2575                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_INTx8")
    2576                      .dwattr $C$DW$246, DW_AT_bit_offset(0x08)
    2577                      .dwattr $C$DW$246, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   52

    2578                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2579                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2580              
    2581              $C$DW$247       .dwtag  DW_TAG_member
    2582                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    2583                      .dwattr $C$DW$247, DW_AT_name("INTx9")
    2584                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_INTx9")
    2585                      .dwattr $C$DW$247, DW_AT_bit_offset(0x07)
    2586                      .dwattr $C$DW$247, DW_AT_bit_size(0x01)
    2587                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2588                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2589              
    2590              $C$DW$248       .dwtag  DW_TAG_member
    2591                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    2592                      .dwattr $C$DW$248, DW_AT_name("INTx10")
    2593                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_INTx10")
    2594                      .dwattr $C$DW$248, DW_AT_bit_offset(0x06)
    2595                      .dwattr $C$DW$248, DW_AT_bit_size(0x01)
    2596                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2597                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2598              
    2599              $C$DW$249       .dwtag  DW_TAG_member
    2600                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    2601                      .dwattr $C$DW$249, DW_AT_name("INTx11")
    2602                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_INTx11")
    2603                      .dwattr $C$DW$249, DW_AT_bit_offset(0x05)
    2604                      .dwattr $C$DW$249, DW_AT_bit_size(0x01)
    2605                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2606                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2607              
    2608              $C$DW$250       .dwtag  DW_TAG_member
    2609                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    2610                      .dwattr $C$DW$250, DW_AT_name("INTx12")
    2611                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_INTx12")
    2612                      .dwattr $C$DW$250, DW_AT_bit_offset(0x04)
    2613                      .dwattr $C$DW$250, DW_AT_bit_size(0x01)
    2614                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2615                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2616              
    2617              $C$DW$251       .dwtag  DW_TAG_member
    2618                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    2619                      .dwattr $C$DW$251, DW_AT_name("INTx13")
    2620                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_INTx13")
    2621                      .dwattr $C$DW$251, DW_AT_bit_offset(0x03)
    2622                      .dwattr $C$DW$251, DW_AT_bit_size(0x01)
    2623                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2624                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2625              
    2626              $C$DW$252       .dwtag  DW_TAG_member
    2627                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    2628                      .dwattr $C$DW$252, DW_AT_name("INTx14")
    2629                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_INTx14")
    2630                      .dwattr $C$DW$252, DW_AT_bit_offset(0x02)
    2631                      .dwattr $C$DW$252, DW_AT_bit_size(0x01)
    2632                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   53

    2633                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2634              
    2635              $C$DW$253       .dwtag  DW_TAG_member
    2636                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    2637                      .dwattr $C$DW$253, DW_AT_name("INTx15")
    2638                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_INTx15")
    2639                      .dwattr $C$DW$253, DW_AT_bit_offset(0x01)
    2640                      .dwattr $C$DW$253, DW_AT_bit_size(0x01)
    2641                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2642                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2643              
    2644              $C$DW$254       .dwtag  DW_TAG_member
    2645                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    2646                      .dwattr $C$DW$254, DW_AT_name("INTx16")
    2647                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_INTx16")
    2648                      .dwattr $C$DW$254, DW_AT_bit_offset(0x00)
    2649                      .dwattr $C$DW$254, DW_AT_bit_size(0x01)
    2650                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2651                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2652              
    2653                      .dwendtag $C$DW$T$32
    2654              
    2655              
    2656              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2657                      .dwattr $C$DW$T$33, DW_AT_name("PIEIER2_REG")
    2658                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2659              $C$DW$255       .dwtag  DW_TAG_member
    2660                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    2661                      .dwattr $C$DW$255, DW_AT_name("all")
    2662                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_all")
    2663                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2664                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2665              
    2666              $C$DW$256       .dwtag  DW_TAG_member
    2667                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$32)
    2668                      .dwattr $C$DW$256, DW_AT_name("bit")
    2669                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_bit")
    2670                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2671                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2672              
    2673                      .dwendtag $C$DW$T$33
    2674              
    2675              
    2676              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2677                      .dwattr $C$DW$T$34, DW_AT_name("PIEIER3_BITS")
    2678                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2679              $C$DW$257       .dwtag  DW_TAG_member
    2680                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    2681                      .dwattr $C$DW$257, DW_AT_name("INTx1")
    2682                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_INTx1")
    2683                      .dwattr $C$DW$257, DW_AT_bit_offset(0x0f)
    2684                      .dwattr $C$DW$257, DW_AT_bit_size(0x01)
    2685                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2686                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2687              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   54

    2688              $C$DW$258       .dwtag  DW_TAG_member
    2689                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    2690                      .dwattr $C$DW$258, DW_AT_name("INTx2")
    2691                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_INTx2")
    2692                      .dwattr $C$DW$258, DW_AT_bit_offset(0x0e)
    2693                      .dwattr $C$DW$258, DW_AT_bit_size(0x01)
    2694                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2695                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2696              
    2697              $C$DW$259       .dwtag  DW_TAG_member
    2698                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    2699                      .dwattr $C$DW$259, DW_AT_name("INTx3")
    2700                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_INTx3")
    2701                      .dwattr $C$DW$259, DW_AT_bit_offset(0x0d)
    2702                      .dwattr $C$DW$259, DW_AT_bit_size(0x01)
    2703                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2704                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2705              
    2706              $C$DW$260       .dwtag  DW_TAG_member
    2707                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    2708                      .dwattr $C$DW$260, DW_AT_name("INTx4")
    2709                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_INTx4")
    2710                      .dwattr $C$DW$260, DW_AT_bit_offset(0x0c)
    2711                      .dwattr $C$DW$260, DW_AT_bit_size(0x01)
    2712                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2713                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2714              
    2715              $C$DW$261       .dwtag  DW_TAG_member
    2716                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    2717                      .dwattr $C$DW$261, DW_AT_name("INTx5")
    2718                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_INTx5")
    2719                      .dwattr $C$DW$261, DW_AT_bit_offset(0x0b)
    2720                      .dwattr $C$DW$261, DW_AT_bit_size(0x01)
    2721                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2722                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2723              
    2724              $C$DW$262       .dwtag  DW_TAG_member
    2725                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    2726                      .dwattr $C$DW$262, DW_AT_name("INTx6")
    2727                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_INTx6")
    2728                      .dwattr $C$DW$262, DW_AT_bit_offset(0x0a)
    2729                      .dwattr $C$DW$262, DW_AT_bit_size(0x01)
    2730                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2731                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2732              
    2733              $C$DW$263       .dwtag  DW_TAG_member
    2734                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    2735                      .dwattr $C$DW$263, DW_AT_name("INTx7")
    2736                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_INTx7")
    2737                      .dwattr $C$DW$263, DW_AT_bit_offset(0x09)
    2738                      .dwattr $C$DW$263, DW_AT_bit_size(0x01)
    2739                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2740                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2741              
    2742              $C$DW$264       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   55

    2743                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    2744                      .dwattr $C$DW$264, DW_AT_name("INTx8")
    2745                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_INTx8")
    2746                      .dwattr $C$DW$264, DW_AT_bit_offset(0x08)
    2747                      .dwattr $C$DW$264, DW_AT_bit_size(0x01)
    2748                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2749                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2750              
    2751              $C$DW$265       .dwtag  DW_TAG_member
    2752                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    2753                      .dwattr $C$DW$265, DW_AT_name("INTx9")
    2754                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_INTx9")
    2755                      .dwattr $C$DW$265, DW_AT_bit_offset(0x07)
    2756                      .dwattr $C$DW$265, DW_AT_bit_size(0x01)
    2757                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2758                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2759              
    2760              $C$DW$266       .dwtag  DW_TAG_member
    2761                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    2762                      .dwattr $C$DW$266, DW_AT_name("INTx10")
    2763                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_INTx10")
    2764                      .dwattr $C$DW$266, DW_AT_bit_offset(0x06)
    2765                      .dwattr $C$DW$266, DW_AT_bit_size(0x01)
    2766                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2767                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2768              
    2769              $C$DW$267       .dwtag  DW_TAG_member
    2770                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    2771                      .dwattr $C$DW$267, DW_AT_name("INTx11")
    2772                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_INTx11")
    2773                      .dwattr $C$DW$267, DW_AT_bit_offset(0x05)
    2774                      .dwattr $C$DW$267, DW_AT_bit_size(0x01)
    2775                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2776                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2777              
    2778              $C$DW$268       .dwtag  DW_TAG_member
    2779                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    2780                      .dwattr $C$DW$268, DW_AT_name("INTx12")
    2781                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_INTx12")
    2782                      .dwattr $C$DW$268, DW_AT_bit_offset(0x04)
    2783                      .dwattr $C$DW$268, DW_AT_bit_size(0x01)
    2784                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2785                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2786              
    2787              $C$DW$269       .dwtag  DW_TAG_member
    2788                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    2789                      .dwattr $C$DW$269, DW_AT_name("INTx13")
    2790                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_INTx13")
    2791                      .dwattr $C$DW$269, DW_AT_bit_offset(0x03)
    2792                      .dwattr $C$DW$269, DW_AT_bit_size(0x01)
    2793                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2794                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2795              
    2796              $C$DW$270       .dwtag  DW_TAG_member
    2797                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   56

    2798                      .dwattr $C$DW$270, DW_AT_name("INTx14")
    2799                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_INTx14")
    2800                      .dwattr $C$DW$270, DW_AT_bit_offset(0x02)
    2801                      .dwattr $C$DW$270, DW_AT_bit_size(0x01)
    2802                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2803                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2804              
    2805              $C$DW$271       .dwtag  DW_TAG_member
    2806                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    2807                      .dwattr $C$DW$271, DW_AT_name("INTx15")
    2808                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_INTx15")
    2809                      .dwattr $C$DW$271, DW_AT_bit_offset(0x01)
    2810                      .dwattr $C$DW$271, DW_AT_bit_size(0x01)
    2811                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2812                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2813              
    2814              $C$DW$272       .dwtag  DW_TAG_member
    2815                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    2816                      .dwattr $C$DW$272, DW_AT_name("INTx16")
    2817                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_INTx16")
    2818                      .dwattr $C$DW$272, DW_AT_bit_offset(0x00)
    2819                      .dwattr $C$DW$272, DW_AT_bit_size(0x01)
    2820                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2821                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2822              
    2823                      .dwendtag $C$DW$T$34
    2824              
    2825              
    2826              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2827                      .dwattr $C$DW$T$35, DW_AT_name("PIEIER3_REG")
    2828                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2829              $C$DW$273       .dwtag  DW_TAG_member
    2830                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    2831                      .dwattr $C$DW$273, DW_AT_name("all")
    2832                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_all")
    2833                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2834                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2835              
    2836              $C$DW$274       .dwtag  DW_TAG_member
    2837                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$34)
    2838                      .dwattr $C$DW$274, DW_AT_name("bit")
    2839                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_bit")
    2840                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2841                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2842              
    2843                      .dwendtag $C$DW$T$35
    2844              
    2845              
    2846              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2847                      .dwattr $C$DW$T$36, DW_AT_name("PIEIER4_BITS")
    2848                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2849              $C$DW$275       .dwtag  DW_TAG_member
    2850                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    2851                      .dwattr $C$DW$275, DW_AT_name("INTx1")
    2852                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_INTx1")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   57

    2853                      .dwattr $C$DW$275, DW_AT_bit_offset(0x0f)
    2854                      .dwattr $C$DW$275, DW_AT_bit_size(0x01)
    2855                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2856                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2857              
    2858              $C$DW$276       .dwtag  DW_TAG_member
    2859                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    2860                      .dwattr $C$DW$276, DW_AT_name("INTx2")
    2861                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_INTx2")
    2862                      .dwattr $C$DW$276, DW_AT_bit_offset(0x0e)
    2863                      .dwattr $C$DW$276, DW_AT_bit_size(0x01)
    2864                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2865                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2866              
    2867              $C$DW$277       .dwtag  DW_TAG_member
    2868                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    2869                      .dwattr $C$DW$277, DW_AT_name("INTx3")
    2870                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_INTx3")
    2871                      .dwattr $C$DW$277, DW_AT_bit_offset(0x0d)
    2872                      .dwattr $C$DW$277, DW_AT_bit_size(0x01)
    2873                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2874                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2875              
    2876              $C$DW$278       .dwtag  DW_TAG_member
    2877                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    2878                      .dwattr $C$DW$278, DW_AT_name("INTx4")
    2879                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_INTx4")
    2880                      .dwattr $C$DW$278, DW_AT_bit_offset(0x0c)
    2881                      .dwattr $C$DW$278, DW_AT_bit_size(0x01)
    2882                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2883                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2884              
    2885              $C$DW$279       .dwtag  DW_TAG_member
    2886                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    2887                      .dwattr $C$DW$279, DW_AT_name("INTx5")
    2888                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_INTx5")
    2889                      .dwattr $C$DW$279, DW_AT_bit_offset(0x0b)
    2890                      .dwattr $C$DW$279, DW_AT_bit_size(0x01)
    2891                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2892                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2893              
    2894              $C$DW$280       .dwtag  DW_TAG_member
    2895                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    2896                      .dwattr $C$DW$280, DW_AT_name("INTx6")
    2897                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_INTx6")
    2898                      .dwattr $C$DW$280, DW_AT_bit_offset(0x0a)
    2899                      .dwattr $C$DW$280, DW_AT_bit_size(0x01)
    2900                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2901                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2902              
    2903              $C$DW$281       .dwtag  DW_TAG_member
    2904                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    2905                      .dwattr $C$DW$281, DW_AT_name("INTx7")
    2906                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_INTx7")
    2907                      .dwattr $C$DW$281, DW_AT_bit_offset(0x09)
