TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Fri Jul 31 12:17:32 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Chiaming\CCSworkspace_V10\MonoMtrServo_377s\F2837x_RAM")
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("AdcaRegs")

     462                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Adc.c",lin
     463 000000d7 76C7          MOVL      XAR7,#CALL(459696)    ; [CPU_ARAU] |126| 
         000000d8 03B0 
     464              $C$DW$22        .dwtag  DW_TAG_TI_branch
     465                      .dwattr $C$DW$22, DW_AT_low_pc(0x00)
     466                      .dwattr $C$DW$22, DW_AT_TI_call
     467                      .dwattr $C$DW$22, DW_AT_TI_indirect
     468              
     469 000000d9 3E67          LCR       *XAR7                 ; [CPU_ALU] |126| 
     470                      ; call occurs [XAR7] ; [] |126| 
     471 000000da 6F15          B         $C$L13,UNC            ; [CPU_ALU] 
     472                      ; branch occurs ; [] 
     473 000000db       $C$L11:    
     474                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Adc.c",lin
     475 000000db 8F07          MOVL      XAR4,#459694          ; [CPU_ARAU] |133| 
         000000dc 03AE 
     476 000000dd 0EC4          MOVU      ACC,*+XAR4[0]         ; [CPU_ALU] |133| 
     477 000000de 8F00          MOVL      XAR4,#65535           ; [CPU_ARAU] |133| 
         000000df FFFF 
     478 000000e0 0FA4          CMPL      ACC,XAR4              ; [CPU_ALU] |133| 
     479 000000e1 610E          B         $C$L13,EQ             ; [CPU_ALU] |133| 
     480                      ; branchcc occurs ; [] |133| 
     481                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Adc.c",lin
     482 000000e2 76C7          MOVL      XAR7,#CALL(459694)    ; [CPU_ARAU] |135| 
         000000e3 03AE 
     483              $C$DW$23        .dwtag  DW_TAG_TI_branch
     484                      .dwattr $C$DW$23, DW_AT_low_pc(0x00)
     485                      .dwattr $C$DW$23, DW_AT_TI_call
     486                      .dwattr $C$DW$23, DW_AT_TI_indirect
     487              
     488 000000e4 3E67          LCR       *XAR7                 ; [CPU_ALU] |135| 
     489                      ; call occurs [XAR7] ; [] |135| 
     490 000000e5 6F0A          B         $C$L13,UNC            ; [CPU_ALU] 
     491                      ; branch occurs ; [] 
     492 000000e6       $C$L12:    
     493                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Adc.c",lin
     494 000000e6 5200          CMPB      AL,#0                 ; [CPU_ALU] |104| 
     495 000000e7 61D3          B         $C$L8,EQ              ; [CPU_ALU] |104| 
     496                      ; branchcc occurs ; [] |104| 
     497 000000e8 5201          CMPB      AL,#1                 ; [CPU_ALU] |104| 
     498 000000e9 61DC          B         $C$L9,EQ              ; [CPU_ALU] |104| 
     499                      ; branchcc occurs ; [] |104| 
     500 000000ea 5202          CMPB      AL,#2                 ; [CPU_ALU] |104| 
     501 000000eb 61E5          B         $C$L10,EQ             ; [CPU_ALU] |104| 
     502                      ; branchcc occurs ; [] |104| 
     503 000000ec 5203          CMPB      AL,#3                 ; [CPU_ALU] |104| 
     504 000000ed 61EE          B         $C$L11,EQ             ; [CPU_ALU] |104| 
     505                      ; branchcc occurs ; [] |104| 
     506 000000ee 6F01          B         $C$L13,UNC            ; [CPU_ALU] |104| 
     507                      ; branch occurs ; [] |104| 
     508 000000ef       $C$L13:    
     509 000000ef FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
     510                      .dwcfi  cfa_offset, -2
     511              $C$DW$24        .dwtag  DW_TAG_TI_branch
     512                      .dwattr $C$DW$24, DW_AT_low_pc(0x00)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   11

     513                      .dwattr $C$DW$24, DW_AT_TI_return
     514              
     515 000000f0 0006          LRETR     ; [CPU_ALU] 
     516                      ; return occurs ; [] 
     517                      .dwattr $C$DW$17, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/so
     518                      .dwattr $C$DW$17, DW_AT_TI_end_line(0x8e)
     519                      .dwattr $C$DW$17, DW_AT_TI_end_column(0x01)
     520                      .dwendentry
     521                      .dwendtag $C$DW$17
     522              
     523              ;**************************************************************
     524              ;* UNDEFINED EXTERNAL REFERENCES                              *
     525              ;**************************************************************
     526                      .global _AdcaRegs
     527                      .global _AdcbRegs
     528                      .global _AdccRegs
     529                      .global _AdcdRegs
     530              
     531              ;***************************************************************
     532              ;* TYPE INFORMATION                                            *
     533              ;***************************************************************
     534              
     535              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     536                      .dwattr $C$DW$T$20, DW_AT_name("ADCBURSTCTL_BITS")
     537                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     538              $C$DW$25        .dwtag  DW_TAG_member
     539                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     540                      .dwattr $C$DW$25, DW_AT_name("BURSTTRIGSEL")
     541                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
     542                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0a)
     543                      .dwattr $C$DW$25, DW_AT_bit_size(0x06)
     544                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     545                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     546              
     547              $C$DW$26        .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     549                      .dwattr $C$DW$26, DW_AT_name("rsvd1")
     550                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd1")
     551                      .dwattr $C$DW$26, DW_AT_bit_offset(0x08)
     552                      .dwattr $C$DW$26, DW_AT_bit_size(0x02)
     553                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     554                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     555              
     556              $C$DW$27        .dwtag  DW_TAG_member
     557                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     558                      .dwattr $C$DW$27, DW_AT_name("BURSTSIZE")
     559                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_BURSTSIZE")
     560                      .dwattr $C$DW$27, DW_AT_bit_offset(0x04)
     561                      .dwattr $C$DW$27, DW_AT_bit_size(0x04)
     562                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     563                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     564              
     565              $C$DW$28        .dwtag  DW_TAG_member
     566                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     567                      .dwattr $C$DW$28, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   12

     568                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd2")
     569                      .dwattr $C$DW$28, DW_AT_bit_offset(0x01)
     570                      .dwattr $C$DW$28, DW_AT_bit_size(0x03)
     571                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     572                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     573              
     574              $C$DW$29        .dwtag  DW_TAG_member
     575                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     576                      .dwattr $C$DW$29, DW_AT_name("BURSTEN")
     577                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_BURSTEN")
     578                      .dwattr $C$DW$29, DW_AT_bit_offset(0x00)
     579                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     580                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     581                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     582              
     583                      .dwendtag $C$DW$T$20
     584              
     585              
     586              $C$DW$T$21      .dwtag  DW_TAG_union_type
     587                      .dwattr $C$DW$T$21, DW_AT_name("ADCBURSTCTL_REG")
     588                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     589              $C$DW$30        .dwtag  DW_TAG_member
     590                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     591                      .dwattr $C$DW$30, DW_AT_name("all")
     592                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_all")
     593                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     594                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     595              
     596              $C$DW$31        .dwtag  DW_TAG_member
     597                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$20)
     598                      .dwattr $C$DW$31, DW_AT_name("bit")
     599                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_bit")
     600                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     601                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     602              
     603                      .dwendtag $C$DW$T$21
     604              
     605              
     606              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     607                      .dwattr $C$DW$T$22, DW_AT_name("ADCCOUNTER_BITS")
     608                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     609              $C$DW$32        .dwtag  DW_TAG_member
     610                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     611                      .dwattr $C$DW$32, DW_AT_name("FREECOUNT")
     612                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_FREECOUNT")
     613                      .dwattr $C$DW$32, DW_AT_bit_offset(0x04)
     614                      .dwattr $C$DW$32, DW_AT_bit_size(0x0c)
     615                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     616                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     617              
     618              $C$DW$33        .dwtag  DW_TAG_member
     619                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     620                      .dwattr $C$DW$33, DW_AT_name("rsvd1")
     621                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd1")
     622                      .dwattr $C$DW$33, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   13

     623                      .dwattr $C$DW$33, DW_AT_bit_size(0x04)
     624                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     625                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     626              
     627                      .dwendtag $C$DW$T$22
     628              
     629              
     630              $C$DW$T$23      .dwtag  DW_TAG_union_type
     631                      .dwattr $C$DW$T$23, DW_AT_name("ADCCOUNTER_REG")
     632                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     633              $C$DW$34        .dwtag  DW_TAG_member
     634                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     635                      .dwattr $C$DW$34, DW_AT_name("all")
     636                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_all")
     637                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     638                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     639              
     640              $C$DW$35        .dwtag  DW_TAG_member
     641                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$22)
     642                      .dwattr $C$DW$35, DW_AT_name("bit")
     643                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_bit")
     644                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     645                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     646              
     647                      .dwendtag $C$DW$T$23
     648              
     649              
     650              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     651                      .dwattr $C$DW$T$24, DW_AT_name("ADCCTL1_BITS")
     652                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     653              $C$DW$36        .dwtag  DW_TAG_member
     654                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     655                      .dwattr $C$DW$36, DW_AT_name("rsvd1")
     656                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd1")
     657                      .dwattr $C$DW$36, DW_AT_bit_offset(0x0e)
     658                      .dwattr $C$DW$36, DW_AT_bit_size(0x02)
     659                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     660                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     661              
     662              $C$DW$37        .dwtag  DW_TAG_member
     663                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     664                      .dwattr $C$DW$37, DW_AT_name("INTPULSEPOS")
     665                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_INTPULSEPOS")
     666                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0d)
     667                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     668                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     669                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     670              
     671              $C$DW$38        .dwtag  DW_TAG_member
     672                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     673                      .dwattr $C$DW$38, DW_AT_name("rsvd2")
     674                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd2")
     675                      .dwattr $C$DW$38, DW_AT_bit_offset(0x09)
     676                      .dwattr $C$DW$38, DW_AT_bit_size(0x04)
     677                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   14

     678                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     679              
     680              $C$DW$39        .dwtag  DW_TAG_member
     681                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     682                      .dwattr $C$DW$39, DW_AT_name("ADCPWDNZ")
     683                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_ADCPWDNZ")
     684                      .dwattr $C$DW$39, DW_AT_bit_offset(0x08)
     685                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     686                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     687                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     688              
     689              $C$DW$40        .dwtag  DW_TAG_member
     690                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     691                      .dwattr $C$DW$40, DW_AT_name("ADCBSYCHN")
     692                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_ADCBSYCHN")
     693                      .dwattr $C$DW$40, DW_AT_bit_offset(0x04)
     694                      .dwattr $C$DW$40, DW_AT_bit_size(0x04)
     695                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     696                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     697              
     698              $C$DW$41        .dwtag  DW_TAG_member
     699                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     700                      .dwattr $C$DW$41, DW_AT_name("rsvd3")
     701                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_rsvd3")
     702                      .dwattr $C$DW$41, DW_AT_bit_offset(0x03)
     703                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     704                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     705                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     706              
     707              $C$DW$42        .dwtag  DW_TAG_member
     708                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     709                      .dwattr $C$DW$42, DW_AT_name("ADCBSY")
     710                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_ADCBSY")
     711                      .dwattr $C$DW$42, DW_AT_bit_offset(0x02)
     712                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     713                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     714                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     715              
     716              $C$DW$43        .dwtag  DW_TAG_member
     717                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     718                      .dwattr $C$DW$43, DW_AT_name("rsvd4")
     719                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_rsvd4")
     720                      .dwattr $C$DW$43, DW_AT_bit_offset(0x00)
     721                      .dwattr $C$DW$43, DW_AT_bit_size(0x02)
     722                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     723                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     724              
     725                      .dwendtag $C$DW$T$24
     726              
     727              
     728              $C$DW$T$25      .dwtag  DW_TAG_union_type
     729                      .dwattr $C$DW$T$25, DW_AT_name("ADCCTL1_REG")
     730                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     731              $C$DW$44        .dwtag  DW_TAG_member
     732                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   15

     733                      .dwattr $C$DW$44, DW_AT_name("all")
     734                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_all")
     735                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     736                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     737              
     738              $C$DW$45        .dwtag  DW_TAG_member
     739                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$24)
     740                      .dwattr $C$DW$45, DW_AT_name("bit")
     741                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_bit")
     742                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     743                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     744              
     745                      .dwendtag $C$DW$T$25
     746              
     747              
     748              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     749                      .dwattr $C$DW$T$26, DW_AT_name("ADCCTL2_BITS")
     750                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     751              $C$DW$46        .dwtag  DW_TAG_member
     752                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     753                      .dwattr $C$DW$46, DW_AT_name("PRESCALE")
     754                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_PRESCALE")
     755                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0c)
     756                      .dwattr $C$DW$46, DW_AT_bit_size(0x04)
     757                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     758                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     759              
     760              $C$DW$47        .dwtag  DW_TAG_member
     761                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     762                      .dwattr $C$DW$47, DW_AT_name("rsvd1")
     763                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_rsvd1")
     764                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0a)
     765                      .dwattr $C$DW$47, DW_AT_bit_size(0x02)
     766                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     767                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     768              
     769              $C$DW$48        .dwtag  DW_TAG_member
     770                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     771                      .dwattr $C$DW$48, DW_AT_name("RESOLUTION")
     772                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_RESOLUTION")
     773                      .dwattr $C$DW$48, DW_AT_bit_offset(0x09)
     774                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     775                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     776                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     777              
     778              $C$DW$49        .dwtag  DW_TAG_member
     779                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     780                      .dwattr $C$DW$49, DW_AT_name("SIGNALMODE")
     781                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_SIGNALMODE")
     782                      .dwattr $C$DW$49, DW_AT_bit_offset(0x08)
     783                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     784                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     785                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     786              
     787              $C$DW$50        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   16

     788                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     789                      .dwattr $C$DW$50, DW_AT_name("rsvd2")
     790                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_rsvd2")
     791                      .dwattr $C$DW$50, DW_AT_bit_offset(0x03)
     792                      .dwattr $C$DW$50, DW_AT_bit_size(0x05)
     793                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     794                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     795              
     796              $C$DW$51        .dwtag  DW_TAG_member
     797                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     798                      .dwattr $C$DW$51, DW_AT_name("rsvd3")
     799                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_rsvd3")
     800                      .dwattr $C$DW$51, DW_AT_bit_offset(0x00)
     801                      .dwattr $C$DW$51, DW_AT_bit_size(0x03)
     802                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     803                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     804              
     805                      .dwendtag $C$DW$T$26
     806              
     807              
     808              $C$DW$T$27      .dwtag  DW_TAG_union_type
     809                      .dwattr $C$DW$T$27, DW_AT_name("ADCCTL2_REG")
     810                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     811              $C$DW$52        .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     813                      .dwattr $C$DW$52, DW_AT_name("all")
     814                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_all")
     815                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     816                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     817              
     818              $C$DW$53        .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$26)
     820                      .dwattr $C$DW$53, DW_AT_name("bit")
     821                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_bit")
     822                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     823                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     824              
     825                      .dwendtag $C$DW$T$27
     826              
     827              
     828              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     829                      .dwattr $C$DW$T$28, DW_AT_name("ADCEVTCLR_BITS")
     830                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     831              $C$DW$54        .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     833                      .dwattr $C$DW$54, DW_AT_name("PPB1TRIPHI")
     834                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_PPB1TRIPHI")
     835                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0f)
     836                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     837                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     838                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     839              
     840              $C$DW$55        .dwtag  DW_TAG_member
     841                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     842                      .dwattr $C$DW$55, DW_AT_name("PPB1TRIPLO")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   17

     843                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_PPB1TRIPLO")
     844                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0e)
     845                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     846                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     847                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     848              
     849              $C$DW$56        .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     851                      .dwattr $C$DW$56, DW_AT_name("PPB1ZERO")
     852                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_PPB1ZERO")
     853                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0d)
     854                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     855                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     856                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     857              
     858              $C$DW$57        .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     860                      .dwattr $C$DW$57, DW_AT_name("rsvd1")
     861                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rsvd1")
     862                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0c)
     863                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     864                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     865                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     866              
     867              $C$DW$58        .dwtag  DW_TAG_member
     868                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     869                      .dwattr $C$DW$58, DW_AT_name("PPB2TRIPHI")
     870                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_PPB2TRIPHI")
     871                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0b)
     872                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     873                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     874                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     875              
     876              $C$DW$59        .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     878                      .dwattr $C$DW$59, DW_AT_name("PPB2TRIPLO")
     879                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_PPB2TRIPLO")
     880                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0a)
     881                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     882                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     883                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     884              
     885              $C$DW$60        .dwtag  DW_TAG_member
     886                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     887                      .dwattr $C$DW$60, DW_AT_name("PPB2ZERO")
     888                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_PPB2ZERO")
     889                      .dwattr $C$DW$60, DW_AT_bit_offset(0x09)
     890                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     891                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     892                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     893              
     894              $C$DW$61        .dwtag  DW_TAG_member
     895                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     896                      .dwattr $C$DW$61, DW_AT_name("rsvd2")
     897                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   18

     898                      .dwattr $C$DW$61, DW_AT_bit_offset(0x08)
     899                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     900                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     901                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     902              
     903              $C$DW$62        .dwtag  DW_TAG_member
     904                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     905                      .dwattr $C$DW$62, DW_AT_name("PPB3TRIPHI")
     906                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_PPB3TRIPHI")
     907                      .dwattr $C$DW$62, DW_AT_bit_offset(0x07)
     908                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     909                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     910                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     911              
     912              $C$DW$63        .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     914                      .dwattr $C$DW$63, DW_AT_name("PPB3TRIPLO")
     915                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_PPB3TRIPLO")
     916                      .dwattr $C$DW$63, DW_AT_bit_offset(0x06)
     917                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     918                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     919                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     920              
     921              $C$DW$64        .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     923                      .dwattr $C$DW$64, DW_AT_name("PPB3ZERO")
     924                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_PPB3ZERO")
     925                      .dwattr $C$DW$64, DW_AT_bit_offset(0x05)
     926                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     927                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     928                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     929              
     930              $C$DW$65        .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     932                      .dwattr $C$DW$65, DW_AT_name("rsvd3")
     933                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_rsvd3")
     934                      .dwattr $C$DW$65, DW_AT_bit_offset(0x04)
     935                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     936                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     937                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     938              
     939              $C$DW$66        .dwtag  DW_TAG_member
     940                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     941                      .dwattr $C$DW$66, DW_AT_name("PPB4TRIPHI")
     942                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_PPB4TRIPHI")
     943                      .dwattr $C$DW$66, DW_AT_bit_offset(0x03)
     944                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     945                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     946                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     947              
     948              $C$DW$67        .dwtag  DW_TAG_member
     949                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     950                      .dwattr $C$DW$67, DW_AT_name("PPB4TRIPLO")
     951                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_PPB4TRIPLO")
     952                      .dwattr $C$DW$67, DW_AT_bit_offset(0x02)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   19

     953                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     954                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     955                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     956              
     957              $C$DW$68        .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     959                      .dwattr $C$DW$68, DW_AT_name("PPB4ZERO")
     960                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_PPB4ZERO")
     961                      .dwattr $C$DW$68, DW_AT_bit_offset(0x01)
     962                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
     963                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     964                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     965              
     966              $C$DW$69        .dwtag  DW_TAG_member
     967                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     968                      .dwattr $C$DW$69, DW_AT_name("rsvd4")
     969                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_rsvd4")
     970                      .dwattr $C$DW$69, DW_AT_bit_offset(0x00)
     971                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     972                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     973                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     974              
     975                      .dwendtag $C$DW$T$28
     976              
     977              
     978              $C$DW$T$29      .dwtag  DW_TAG_union_type
     979                      .dwattr $C$DW$T$29, DW_AT_name("ADCEVTCLR_REG")
     980                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     981              $C$DW$70        .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     983                      .dwattr $C$DW$70, DW_AT_name("all")
     984                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_all")
     985                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     986                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     987              
     988              $C$DW$71        .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$28)
     990                      .dwattr $C$DW$71, DW_AT_name("bit")
     991                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_bit")
     992                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     994              
     995                      .dwendtag $C$DW$T$29
     996              
     997              
     998              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     999                      .dwattr $C$DW$T$30, DW_AT_name("ADCEVTINTSEL_BITS")
    1000                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1001              $C$DW$72        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1003                      .dwattr $C$DW$72, DW_AT_name("PPB1TRIPHI")
    1004                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1005                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0f)
    1006                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
    1007                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   20

    1008                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1009              
    1010              $C$DW$73        .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1012                      .dwattr $C$DW$73, DW_AT_name("PPB1TRIPLO")
    1013                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1014                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0e)
    1015                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
    1016                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1018              
    1019              $C$DW$74        .dwtag  DW_TAG_member
    1020                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1021                      .dwattr $C$DW$74, DW_AT_name("PPB1ZERO")
    1022                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_PPB1ZERO")
    1023                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0d)
    1024                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    1025                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1026                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1027              
    1028              $C$DW$75        .dwtag  DW_TAG_member
    1029                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1030                      .dwattr $C$DW$75, DW_AT_name("rsvd1")
    1031                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd1")
    1032                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0c)
    1033                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1034                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1035                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1036              
    1037              $C$DW$76        .dwtag  DW_TAG_member
    1038                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1039                      .dwattr $C$DW$76, DW_AT_name("PPB2TRIPHI")
    1040                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1041                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0b)
    1042                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1043                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1044                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1045              
    1046              $C$DW$77        .dwtag  DW_TAG_member
    1047                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1048                      .dwattr $C$DW$77, DW_AT_name("PPB2TRIPLO")
    1049                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1050                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0a)
    1051                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    1052                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1053                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1054              
    1055              $C$DW$78        .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1057                      .dwattr $C$DW$78, DW_AT_name("PPB2ZERO")
    1058                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_PPB2ZERO")
    1059                      .dwattr $C$DW$78, DW_AT_bit_offset(0x09)
    1060                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1061                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1062                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   21

    1063              
    1064              $C$DW$79        .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1066                      .dwattr $C$DW$79, DW_AT_name("rsvd2")
    1067                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rsvd2")
    1068                      .dwattr $C$DW$79, DW_AT_bit_offset(0x08)
    1069                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1070                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1071                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1072              
    1073              $C$DW$80        .dwtag  DW_TAG_member
    1074                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1075                      .dwattr $C$DW$80, DW_AT_name("PPB3TRIPHI")
    1076                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1077                      .dwattr $C$DW$80, DW_AT_bit_offset(0x07)
    1078                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1079                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1080                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1081              
    1082              $C$DW$81        .dwtag  DW_TAG_member
    1083                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1084                      .dwattr $C$DW$81, DW_AT_name("PPB3TRIPLO")
    1085                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1086                      .dwattr $C$DW$81, DW_AT_bit_offset(0x06)
    1087                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1088                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1090              
    1091              $C$DW$82        .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1093                      .dwattr $C$DW$82, DW_AT_name("PPB3ZERO")
    1094                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_PPB3ZERO")
    1095                      .dwattr $C$DW$82, DW_AT_bit_offset(0x05)
    1096                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1097                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1099              
    1100              $C$DW$83        .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1102                      .dwattr $C$DW$83, DW_AT_name("rsvd3")
    1103                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd3")
    1104                      .dwattr $C$DW$83, DW_AT_bit_offset(0x04)
    1105                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1106                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1107                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1108              
    1109              $C$DW$84        .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1111                      .dwattr $C$DW$84, DW_AT_name("PPB4TRIPHI")
    1112                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1113                      .dwattr $C$DW$84, DW_AT_bit_offset(0x03)
    1114                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1115                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1116                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1117              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   22

    1118              $C$DW$85        .dwtag  DW_TAG_member
    1119                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1120                      .dwattr $C$DW$85, DW_AT_name("PPB4TRIPLO")
    1121                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1122                      .dwattr $C$DW$85, DW_AT_bit_offset(0x02)
    1123                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    1124                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1125                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1126              
    1127              $C$DW$86        .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1129                      .dwattr $C$DW$86, DW_AT_name("PPB4ZERO")
    1130                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_PPB4ZERO")
    1131                      .dwattr $C$DW$86, DW_AT_bit_offset(0x01)
    1132                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1133                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1134                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1135              
    1136              $C$DW$87        .dwtag  DW_TAG_member
    1137                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1138                      .dwattr $C$DW$87, DW_AT_name("rsvd4")
    1139                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd4")
    1140                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00)
    1141                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1142                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1143                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1144              
    1145                      .dwendtag $C$DW$T$30
    1146              
    1147              
    1148              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1149                      .dwattr $C$DW$T$31, DW_AT_name("ADCEVTINTSEL_REG")
    1150                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1151              $C$DW$88        .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1153                      .dwattr $C$DW$88, DW_AT_name("all")
    1154                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_all")
    1155                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1156                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1157              
    1158              $C$DW$89        .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$30)
    1160                      .dwattr $C$DW$89, DW_AT_name("bit")
    1161                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_bit")
    1162                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1163                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1164              
    1165                      .dwendtag $C$DW$T$31
    1166              
    1167              
    1168              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1169                      .dwattr $C$DW$T$32, DW_AT_name("ADCEVTSEL_BITS")
    1170                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1171              $C$DW$90        .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   23

    1173                      .dwattr $C$DW$90, DW_AT_name("PPB1TRIPHI")
    1174                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1175                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0f)
    1176                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1177                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1179              
    1180              $C$DW$91        .dwtag  DW_TAG_member
    1181                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1182                      .dwattr $C$DW$91, DW_AT_name("PPB1TRIPLO")
    1183                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1184                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0e)
    1185                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1186                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1187                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1188              
    1189              $C$DW$92        .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1191                      .dwattr $C$DW$92, DW_AT_name("PPB1ZERO")
    1192                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_PPB1ZERO")
    1193                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0d)
    1194                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1195                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1196                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1197              
    1198              $C$DW$93        .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1200                      .dwattr $C$DW$93, DW_AT_name("rsvd1")
    1201                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd1")
    1202                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0c)
    1203                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1204                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1205                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1206              
    1207              $C$DW$94        .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1209                      .dwattr $C$DW$94, DW_AT_name("PPB2TRIPHI")
    1210                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1211                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0b)
    1212                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1213                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1214                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1215              
    1216              $C$DW$95        .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1218                      .dwattr $C$DW$95, DW_AT_name("PPB2TRIPLO")
    1219                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1220                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0a)
    1221                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1222                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1223                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1224              
    1225              $C$DW$96        .dwtag  DW_TAG_member
    1226                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1227                      .dwattr $C$DW$96, DW_AT_name("PPB2ZERO")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   24

    1228                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_PPB2ZERO")
    1229                      .dwattr $C$DW$96, DW_AT_bit_offset(0x09)
    1230                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1231                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1232                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1233              
    1234              $C$DW$97        .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1236                      .dwattr $C$DW$97, DW_AT_name("rsvd2")
    1237                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd2")
    1238                      .dwattr $C$DW$97, DW_AT_bit_offset(0x08)
    1239                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1240                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1241                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1242              
    1243              $C$DW$98        .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1245                      .dwattr $C$DW$98, DW_AT_name("PPB3TRIPHI")
    1246                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1247                      .dwattr $C$DW$98, DW_AT_bit_offset(0x07)
    1248                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1249                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1250                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1251              
    1252              $C$DW$99        .dwtag  DW_TAG_member
    1253                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1254                      .dwattr $C$DW$99, DW_AT_name("PPB3TRIPLO")
    1255                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1256                      .dwattr $C$DW$99, DW_AT_bit_offset(0x06)
    1257                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1258                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1259                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1260              
    1261              $C$DW$100       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1263                      .dwattr $C$DW$100, DW_AT_name("PPB3ZERO")
    1264                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_PPB3ZERO")
    1265                      .dwattr $C$DW$100, DW_AT_bit_offset(0x05)
    1266                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1267                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1268                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1269              
    1270              $C$DW$101       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1272                      .dwattr $C$DW$101, DW_AT_name("rsvd3")
    1273                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd3")
    1274                      .dwattr $C$DW$101, DW_AT_bit_offset(0x04)
    1275                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1276                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1277                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1278              
    1279              $C$DW$102       .dwtag  DW_TAG_member
    1280                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1281                      .dwattr $C$DW$102, DW_AT_name("PPB4TRIPHI")
    1282                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_PPB4TRIPHI")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   25

    1283                      .dwattr $C$DW$102, DW_AT_bit_offset(0x03)
    1284                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1285                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1287              
    1288              $C$DW$103       .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1290                      .dwattr $C$DW$103, DW_AT_name("PPB4TRIPLO")
    1291                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1292                      .dwattr $C$DW$103, DW_AT_bit_offset(0x02)
    1293                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1294                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1295                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1296              
    1297              $C$DW$104       .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1299                      .dwattr $C$DW$104, DW_AT_name("PPB4ZERO")
    1300                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_PPB4ZERO")
    1301                      .dwattr $C$DW$104, DW_AT_bit_offset(0x01)
    1302                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1303                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1305              
    1306              $C$DW$105       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1308                      .dwattr $C$DW$105, DW_AT_name("rsvd4")
    1309                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd4")
    1310                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    1311                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1312                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1313                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1314              
    1315                      .dwendtag $C$DW$T$32
    1316              
    1317              
    1318              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1319                      .dwattr $C$DW$T$33, DW_AT_name("ADCEVTSEL_REG")
    1320                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1321              $C$DW$106       .dwtag  DW_TAG_member
    1322                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1323                      .dwattr $C$DW$106, DW_AT_name("all")
    1324                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    1325                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1326                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1327              
    1328              $C$DW$107       .dwtag  DW_TAG_member
    1329                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$32)
    1330                      .dwattr $C$DW$107, DW_AT_name("bit")
    1331                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    1332                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1333                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1334              
    1335                      .dwendtag $C$DW$T$33
    1336              
    1337              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   26

    1338              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1339                      .dwattr $C$DW$T$34, DW_AT_name("ADCEVTSTAT_BITS")
    1340                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1341              $C$DW$108       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$108, DW_AT_name("PPB1TRIPHI")
    1344                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1345                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0f)
    1346                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1347                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1348                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1349              
    1350              $C$DW$109       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1352                      .dwattr $C$DW$109, DW_AT_name("PPB1TRIPLO")
    1353                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1354                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0e)
    1355                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1356                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1357                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1358              
    1359              $C$DW$110       .dwtag  DW_TAG_member
    1360                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1361                      .dwattr $C$DW$110, DW_AT_name("PPB1ZERO")
    1362                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_PPB1ZERO")
    1363                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0d)
    1364                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1365                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1367              
    1368              $C$DW$111       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1370                      .dwattr $C$DW$111, DW_AT_name("rsvd1")
    1371                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd1")
    1372                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0c)
    1373                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1374                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1376              
    1377              $C$DW$112       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1379                      .dwattr $C$DW$112, DW_AT_name("PPB2TRIPHI")
    1380                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1381                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0b)
    1382                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1383                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1385              
    1386              $C$DW$113       .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1388                      .dwattr $C$DW$113, DW_AT_name("PPB2TRIPLO")
    1389                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1390                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0a)
    1391                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1392                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   27

    1393                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1394              
    1395              $C$DW$114       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1397                      .dwattr $C$DW$114, DW_AT_name("PPB2ZERO")
    1398                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_PPB2ZERO")
    1399                      .dwattr $C$DW$114, DW_AT_bit_offset(0x09)
    1400                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1401                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1402                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1403              
    1404              $C$DW$115       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1406                      .dwattr $C$DW$115, DW_AT_name("rsvd2")
    1407                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd2")
    1408                      .dwattr $C$DW$115, DW_AT_bit_offset(0x08)
    1409                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1410                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1411                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1412              
    1413              $C$DW$116       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1415                      .dwattr $C$DW$116, DW_AT_name("PPB3TRIPHI")
    1416                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1417                      .dwattr $C$DW$116, DW_AT_bit_offset(0x07)
    1418                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1419                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1420                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1421              
    1422              $C$DW$117       .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1424                      .dwattr $C$DW$117, DW_AT_name("PPB3TRIPLO")
    1425                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1426                      .dwattr $C$DW$117, DW_AT_bit_offset(0x06)
    1427                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1428                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1429                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1430              
    1431              $C$DW$118       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1433                      .dwattr $C$DW$118, DW_AT_name("PPB3ZERO")
    1434                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_PPB3ZERO")
    1435                      .dwattr $C$DW$118, DW_AT_bit_offset(0x05)
    1436                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1437                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1439              
    1440              $C$DW$119       .dwtag  DW_TAG_member
    1441                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1442                      .dwattr $C$DW$119, DW_AT_name("rsvd3")
    1443                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd3")
    1444                      .dwattr $C$DW$119, DW_AT_bit_offset(0x04)
    1445                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1446                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1447                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   28

    1448              
    1449              $C$DW$120       .dwtag  DW_TAG_member
    1450                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1451                      .dwattr $C$DW$120, DW_AT_name("PPB4TRIPHI")
    1452                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1453                      .dwattr $C$DW$120, DW_AT_bit_offset(0x03)
    1454                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1455                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1456                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1457              
    1458              $C$DW$121       .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1460                      .dwattr $C$DW$121, DW_AT_name("PPB4TRIPLO")
    1461                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1462                      .dwattr $C$DW$121, DW_AT_bit_offset(0x02)
    1463                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1464                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1465                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1466              
    1467              $C$DW$122       .dwtag  DW_TAG_member
    1468                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1469                      .dwattr $C$DW$122, DW_AT_name("PPB4ZERO")
    1470                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_PPB4ZERO")
    1471                      .dwattr $C$DW$122, DW_AT_bit_offset(0x01)
    1472                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1473                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1474                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1475              
    1476              $C$DW$123       .dwtag  DW_TAG_member
    1477                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1478                      .dwattr $C$DW$123, DW_AT_name("rsvd4")
    1479                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd4")
    1480                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    1481                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1482                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1483                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1484              
    1485                      .dwendtag $C$DW$T$34
    1486              
    1487              
    1488              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1489                      .dwattr $C$DW$T$35, DW_AT_name("ADCEVTSTAT_REG")
    1490                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1491              $C$DW$124       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1493                      .dwattr $C$DW$124, DW_AT_name("all")
    1494                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_all")
    1495                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1496                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1497              
    1498              $C$DW$125       .dwtag  DW_TAG_member
    1499                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$34)
    1500                      .dwattr $C$DW$125, DW_AT_name("bit")
    1501                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_bit")
    1502                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   29

    1503                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1504              
    1505                      .dwendtag $C$DW$T$35
    1506              
    1507              
    1508              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1509                      .dwattr $C$DW$T$36, DW_AT_name("ADCINTFLGCLR_BITS")
    1510                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1511              $C$DW$126       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1513                      .dwattr $C$DW$126, DW_AT_name("ADCINT1")
    1514                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_ADCINT1")
    1515                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0f)
    1516                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1517                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1519              
    1520              $C$DW$127       .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1522                      .dwattr $C$DW$127, DW_AT_name("ADCINT2")
    1523                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_ADCINT2")
    1524                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0e)
    1525                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1526                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1527                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1528              
    1529              $C$DW$128       .dwtag  DW_TAG_member
    1530                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1531                      .dwattr $C$DW$128, DW_AT_name("ADCINT3")
    1532                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_ADCINT3")
    1533                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0d)
    1534                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1535                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1536                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1537              
    1538              $C$DW$129       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1540                      .dwattr $C$DW$129, DW_AT_name("ADCINT4")
    1541                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_ADCINT4")
    1542                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0c)
    1543                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1544                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1545                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1546              
    1547              $C$DW$130       .dwtag  DW_TAG_member
    1548                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1549                      .dwattr $C$DW$130, DW_AT_name("rsvd1")
    1550                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd1")
    1551                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    1552                      .dwattr $C$DW$130, DW_AT_bit_size(0x0c)
    1553                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1554                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1555              
    1556                      .dwendtag $C$DW$T$36
    1557              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   30

    1558              
    1559              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1560                      .dwattr $C$DW$T$37, DW_AT_name("ADCINTFLGCLR_REG")
    1561                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1562              $C$DW$131       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1564                      .dwattr $C$DW$131, DW_AT_name("all")
    1565                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_all")
    1566                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1567                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1568              
    1569              $C$DW$132       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$36)
    1571                      .dwattr $C$DW$132, DW_AT_name("bit")
    1572                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_bit")
    1573                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1574                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1575              
    1576                      .dwendtag $C$DW$T$37
    1577              
    1578              
    1579              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1580                      .dwattr $C$DW$T$38, DW_AT_name("ADCINTFLG_BITS")
    1581                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1582              $C$DW$133       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1584                      .dwattr $C$DW$133, DW_AT_name("ADCINT1")
    1585                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ADCINT1")
    1586                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0f)
    1587                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1588                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1590              
    1591              $C$DW$134       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1593                      .dwattr $C$DW$134, DW_AT_name("ADCINT2")
    1594                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_ADCINT2")
    1595                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0e)
    1596                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1597                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1599              
    1600              $C$DW$135       .dwtag  DW_TAG_member
    1601                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1602                      .dwattr $C$DW$135, DW_AT_name("ADCINT3")
    1603                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_ADCINT3")
    1604                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0d)
    1605                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1606                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1607                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1608              
    1609              $C$DW$136       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1611                      .dwattr $C$DW$136, DW_AT_name("ADCINT4")
    1612                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ADCINT4")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   31

    1613                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0c)
    1614                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1615                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1616                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1617              
    1618              $C$DW$137       .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1620                      .dwattr $C$DW$137, DW_AT_name("rsvd1")
    1621                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd1")
    1622                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    1623                      .dwattr $C$DW$137, DW_AT_bit_size(0x0c)
    1624                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1625                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1626              
    1627                      .dwendtag $C$DW$T$38
    1628              
    1629              
    1630              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1631                      .dwattr $C$DW$T$39, DW_AT_name("ADCINTFLG_REG")
    1632                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1633              $C$DW$138       .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1635                      .dwattr $C$DW$138, DW_AT_name("all")
    1636                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    1637                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1638                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1639              
    1640              $C$DW$139       .dwtag  DW_TAG_member
    1641                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$38)
    1642                      .dwattr $C$DW$139, DW_AT_name("bit")
    1643                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    1644                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1645                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1646              
    1647                      .dwendtag $C$DW$T$39
    1648              
    1649              
    1650              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1651                      .dwattr $C$DW$T$40, DW_AT_name("ADCINTOVFCLR_BITS")
    1652                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1653              $C$DW$140       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1655                      .dwattr $C$DW$140, DW_AT_name("ADCINT1")
    1656                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ADCINT1")
    1657                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0f)
    1658                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1659                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1661              
    1662              $C$DW$141       .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1664                      .dwattr $C$DW$141, DW_AT_name("ADCINT2")
    1665                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ADCINT2")
    1666                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0e)
    1667                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   32

    1668                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1669                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1670              
    1671              $C$DW$142       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1673                      .dwattr $C$DW$142, DW_AT_name("ADCINT3")
    1674                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ADCINT3")
    1675                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0d)
    1676                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1677                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1678                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1679              
    1680              $C$DW$143       .dwtag  DW_TAG_member
    1681                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1682                      .dwattr $C$DW$143, DW_AT_name("ADCINT4")
    1683                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_ADCINT4")
    1684                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0c)
    1685                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1686                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1687                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1688              
    1689              $C$DW$144       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1691                      .dwattr $C$DW$144, DW_AT_name("rsvd1")
    1692                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd1")
    1693                      .dwattr $C$DW$144, DW_AT_bit_offset(0x00)
    1694                      .dwattr $C$DW$144, DW_AT_bit_size(0x0c)
    1695                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1696                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1697              
    1698                      .dwendtag $C$DW$T$40
    1699              
    1700              
    1701              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1702                      .dwattr $C$DW$T$41, DW_AT_name("ADCINTOVFCLR_REG")
    1703                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1704              $C$DW$145       .dwtag  DW_TAG_member
    1705                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1706                      .dwattr $C$DW$145, DW_AT_name("all")
    1707                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_all")
    1708                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1709                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1710              
    1711              $C$DW$146       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$40)
    1713                      .dwattr $C$DW$146, DW_AT_name("bit")
    1714                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_bit")
    1715                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1716                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1717              
    1718                      .dwendtag $C$DW$T$41
    1719              
    1720              
    1721              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1722                      .dwattr $C$DW$T$42, DW_AT_name("ADCINTOVF_BITS")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   33

    1723                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1724              $C$DW$147       .dwtag  DW_TAG_member
    1725                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1726                      .dwattr $C$DW$147, DW_AT_name("ADCINT1")
    1727                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCINT1")
    1728                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0f)
    1729                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1730                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1731                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1732              
    1733              $C$DW$148       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1735                      .dwattr $C$DW$148, DW_AT_name("ADCINT2")
    1736                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ADCINT2")
    1737                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0e)
    1738                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1739                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1740                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1741              
    1742              $C$DW$149       .dwtag  DW_TAG_member
    1743                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1744                      .dwattr $C$DW$149, DW_AT_name("ADCINT3")
    1745                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ADCINT3")
    1746                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0d)
    1747                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1748                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1750              
    1751              $C$DW$150       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1753                      .dwattr $C$DW$150, DW_AT_name("ADCINT4")
    1754                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ADCINT4")
    1755                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0c)
    1756                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1757                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1758                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1759              
    1760              $C$DW$151       .dwtag  DW_TAG_member
    1761                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1762                      .dwattr $C$DW$151, DW_AT_name("rsvd1")
    1763                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd1")
    1764                      .dwattr $C$DW$151, DW_AT_bit_offset(0x00)
    1765                      .dwattr $C$DW$151, DW_AT_bit_size(0x0c)
    1766                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1767                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1768              
    1769                      .dwendtag $C$DW$T$42
    1770              
    1771              
    1772              $C$DW$T$43      .dwtag  DW_TAG_union_type
    1773                      .dwattr $C$DW$T$43, DW_AT_name("ADCINTOVF_REG")
    1774                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1775              $C$DW$152       .dwtag  DW_TAG_member
    1776                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1777                      .dwattr $C$DW$152, DW_AT_name("all")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:32 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   34

    1778                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_all")
    1779                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1780                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1781              
    1782              $C$DW$153       .dwtag  DW_TAG_member
    1783                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$42)
    1784                      .dwattr $C$DW$153, DW_AT_name("bit")
    1785                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_bit")
    1786                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1787                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1788              
    1789                      .dwendtag $C$DW$T$43
    1790              
    1791              
    1792              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1793                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTSEL1N2_BITS")
    1794                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1795              $C$DW$154       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1797                      .dwattr $C$DW$154, DW_AT_name("INT1SEL")
    1798                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_INT1SEL")
    1799                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0c)
    1800                      .dwattr $C$DW$154, DW_AT_bit_size(0x04)
    1801                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1802                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1803              
    1804              $C$DW$155       .dwtag  DW_TAG_member
    1805                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1806                      .dwattr $C$DW$155, DW_AT_name("rsvd1")
    1807                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd1")
    1808                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0b)
    1809                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1810                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1811                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1812              
