TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Fri Jul 31 12:17:33 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Chiaming\CCSworkspace_V10\MonoMtrServo_377s\F2837x_RAM")
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("InputXbarRegs")

    1656              $C$DW$93        .dwtag  DW_TAG_variable
    1657                      .dwattr $C$DW$93, DW_AT_name("outVal")
    1658                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_outVal")
    1659                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1660                      .dwattr $C$DW$93, DW_AT_location[DW_OP_breg20 -6]
    1661              
    1662 00000227 9746          MOV       *-SP[6],AH            ; [CPU_ALU] |354| 
    1663 00000228 9645          MOV       *-SP[5],AL            ; [CPU_ALU] |354| 
    1664                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Gpio.c",li
    1665 00000229 FFC4          LSR       AL,5                  ; [CPU_ALU] |358| 
    1666 0000022a 2901          CLRC      SXM                   ; [CPU_FPU] 
    1667 0000022b 8F00!         MOVL      XAR4,#_GpioDataRegs   ; [CPU_ARAU] |358| 
         0000022c 0000 
    1668 0000022d FF81          LSL       AL,2                  ; [CPU_ALU] |358| 
    1669 0000022e 5603          MOV       ACC,AL << 1           ; [CPU_ALU] |358| 
         0000022f 01A9 
    1670 00000230 5601          ADDL      XAR4,ACC              ; [CPU_ALU] |358| 
         00000231 00A4 
    1671 00000232 A842          MOVL      *-SP[2],XAR4          ; [CPU_ALU] |358| 
    1672                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Gpio.c",li
    1673 00000233 0201          MOVB      ACC,#1                ; [CPU_ALU] |359| 
    1674 00000234 1EA6          MOVL      XAR6,ACC              ; [CPU_ALU] |359| 
    1675 00000235 9245          MOV       AL,*-SP[5]            ; [CPU_ALU] |359| 
    1676 00000236 901F          ANDB      AL,#0x1f              ; [CPU_ALU] |359| 
    1677 00000237 2DA9          MOV       T,AL                  ; [CPU_ALU] |359| 
    1678 00000238 06A6          MOVL      ACC,XAR6              ; [CPU_ALU] |359| 
    1679 00000239 563B          LSLL      ACC,T                 ; [CPU_ALU] |359| 
    1680 0000023a 1E44          MOVL      *-SP[4],ACC           ; [CPU_ALU] |359| 
    1681                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Gpio.c",li
    1682 0000023b 9246          MOV       AL,*-SP[6]            ; [CPU_ALU] |361| 
    1683 0000023c 6004          B         $C$L21,NEQ            ; [CPU_ALU] |361| 
    1684                      ; branchcc occurs ; [] |361| 
    1685                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Gpio.c",li
    1686 0000023d 0644          MOVL      ACC,*-SP[4]           ; [CPU_ALU] |362| 
    1687 0000023e 1EE4          MOVL      *+XAR4[4],ACC         ; [CPU_ALU] |362| 
    1688 0000023f 6F03          B         $C$L22,UNC            ; [CPU_ALU] 
    1689                      ; branch occurs ; [] 
    1690 00000240       $C$L21:    
    1691                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Gpio.c",li
    1692 00000240 0644          MOVL      ACC,*-SP[4]           ; [CPU_ALU] |364| 
    1693 00000241 1ED4          MOVL      *+XAR4[2],ACC         ; [CPU_ALU] |364| 
    1694                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Gpio.c",li
    1695 00000242       $C$L22:    
    1696 00000242 FE86          SUBB      SP,#6                 ; [CPU_ARAU] 
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   33

    1697                      .dwcfi  cfa_offset, -2
    1698              $C$DW$94        .dwtag  DW_TAG_TI_branch
    1699                      .dwattr $C$DW$94, DW_AT_low_pc(0x00)
    1700                      .dwattr $C$DW$94, DW_AT_TI_return
    1701              
    1702 00000243 0006          LRETR     ; [CPU_ALU] 
    1703                      ; return occurs ; [] 
    1704                      .dwattr $C$DW$87, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/so
    1705                      .dwattr $C$DW$87, DW_AT_TI_end_line(0x16d)
    1706                      .dwattr $C$DW$87, DW_AT_TI_end_column(0x01)
    1707                      .dwendentry
    1708                      .dwendtag $C$DW$87
    1709              
    1710              ;**************************************************************
    1711              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1712              ;**************************************************************
    1713                      .global _InputXbarRegs
    1714                      .global _GpioDataRegs
    1715                      .global _DevCfgRegs
    1716                      .global _GpioCtrlRegs
    1717              
    1718              ;***************************************************************
    1719              ;* TYPE INFORMATION                                            *
    1720              ;***************************************************************
    1721              
    1722              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1723                      .dwattr $C$DW$T$20, DW_AT_name("DC0_BITS")
    1724                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1725              $C$DW$95        .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1727                      .dwattr $C$DW$95, DW_AT_name("SINGLE_CORE")
    1728                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_SINGLE_CORE")
    1729                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0f)
    1730                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1731                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1733              
    1734              $C$DW$96        .dwtag  DW_TAG_member
    1735                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1736                      .dwattr $C$DW$96, DW_AT_name("rsvd1")
    1737                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd1")
    1738                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00)
    1739                      .dwattr $C$DW$96, DW_AT_bit_size(0x0f)
    1740                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1741                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1742              
    1743              $C$DW$97        .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$97, DW_AT_name("rsvd2")
    1746                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd2")
    1747                      .dwattr $C$DW$97, DW_AT_bit_offset(0x00)
    1748                      .dwattr $C$DW$97, DW_AT_bit_size(0x10)
    1749                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1750                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1751              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   34

    1752                      .dwendtag $C$DW$T$20
    1753              
    1754              
    1755              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1756                      .dwattr $C$DW$T$22, DW_AT_name("DC0_REG")
    1757                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1758              $C$DW$98        .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$21)
    1760                      .dwattr $C$DW$98, DW_AT_name("all")
    1761                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_all")
    1762                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1763                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1764              
    1765              $C$DW$99        .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    1767                      .dwattr $C$DW$99, DW_AT_name("bit")
    1768                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_bit")
    1769                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1770                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1771              
    1772                      .dwendtag $C$DW$T$22
    1773              
    1774              
    1775              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1776                      .dwattr $C$DW$T$23, DW_AT_name("DC10_BITS")
    1777                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1778              $C$DW$100       .dwtag  DW_TAG_member
    1779                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1780                      .dwattr $C$DW$100, DW_AT_name("I2C_A")
    1781                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_I2C_A")
    1782                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0f)
    1783                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1784                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1786              
    1787              $C$DW$101       .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1789                      .dwattr $C$DW$101, DW_AT_name("I2C_B")
    1790                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_I2C_B")
    1791                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0e)
    1792                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1793                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1794                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1795              
    1796              $C$DW$102       .dwtag  DW_TAG_member
    1797                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1798                      .dwattr $C$DW$102, DW_AT_name("rsvd1")
    1799                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd1")
    1800                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    1801                      .dwattr $C$DW$102, DW_AT_bit_size(0x0e)
    1802                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1803                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1804              
    1805              $C$DW$103       .dwtag  DW_TAG_member
    1806                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   35

    1807                      .dwattr $C$DW$103, DW_AT_name("rsvd2")
    1808                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd2")
    1809                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0f)
    1810                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1811                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1812                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1813              
    1814              $C$DW$104       .dwtag  DW_TAG_member
    1815                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1816                      .dwattr $C$DW$104, DW_AT_name("rsvd3")
    1817                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd3")
    1818                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0e)
    1819                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1820                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1821                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1822              
    1823              $C$DW$105       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1825                      .dwattr $C$DW$105, DW_AT_name("rsvd4")
    1826                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd4")
    1827                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    1828                      .dwattr $C$DW$105, DW_AT_bit_size(0x0e)
    1829                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1830                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1831              
    1832                      .dwendtag $C$DW$T$23
    1833              
    1834              
    1835              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1836                      .dwattr $C$DW$T$24, DW_AT_name("DC10_REG")
    1837                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1838              $C$DW$106       .dwtag  DW_TAG_member
    1839                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
    1840                      .dwattr $C$DW$106, DW_AT_name("all")
    1841                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    1842                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1843                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1844              
    1845              $C$DW$107       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$23)
    1847                      .dwattr $C$DW$107, DW_AT_name("bit")
    1848                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    1849                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1850                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1851              
    1852                      .dwendtag $C$DW$T$24
    1853              
    1854              
    1855              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1856                      .dwattr $C$DW$T$25, DW_AT_name("DC11_BITS")
    1857                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1858              $C$DW$108       .dwtag  DW_TAG_member
    1859                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1860                      .dwattr $C$DW$108, DW_AT_name("CAN_A")
    1861                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_CAN_A")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   36

    1862                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0f)
    1863                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1864                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1865                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1866              
    1867              $C$DW$109       .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1869                      .dwattr $C$DW$109, DW_AT_name("CAN_B")
    1870                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_CAN_B")
    1871                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0e)
    1872                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1873                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1874                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1875              
    1876              $C$DW$110       .dwtag  DW_TAG_member
    1877                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1878                      .dwattr $C$DW$110, DW_AT_name("rsvd1")
    1879                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd1")
    1880                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0d)
    1881                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1882                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1883                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1884              
    1885              $C$DW$111       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1887                      .dwattr $C$DW$111, DW_AT_name("rsvd2")
    1888                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd2")
    1889                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0c)
    1890                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1891                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1892                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1893              
    1894              $C$DW$112       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1896                      .dwattr $C$DW$112, DW_AT_name("rsvd3")
    1897                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd3")
    1898                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00)
    1899                      .dwattr $C$DW$112, DW_AT_bit_size(0x0c)
    1900                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1901                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1902              
    1903              $C$DW$113       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1905                      .dwattr $C$DW$113, DW_AT_name("rsvd4")
    1906                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd4")
    1907                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00)
    1908                      .dwattr $C$DW$113, DW_AT_bit_size(0x10)
    1909                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1910                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1911              
    1912                      .dwendtag $C$DW$T$25
    1913              
    1914              
    1915              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1916                      .dwattr $C$DW$T$26, DW_AT_name("DC11_REG")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   37

    1917                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1918              $C$DW$114       .dwtag  DW_TAG_member
    1919                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$21)
    1920                      .dwattr $C$DW$114, DW_AT_name("all")
    1921                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_all")
    1922                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1923                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1924              
    1925              $C$DW$115       .dwtag  DW_TAG_member
    1926                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$25)
    1927                      .dwattr $C$DW$115, DW_AT_name("bit")
    1928                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_bit")
    1929                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1930                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1931              
    1932                      .dwendtag $C$DW$T$26
    1933              
    1934              
    1935              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1936                      .dwattr $C$DW$T$27, DW_AT_name("DC12_BITS")
    1937                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1938              $C$DW$116       .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1940                      .dwattr $C$DW$116, DW_AT_name("McBSP_A")
    1941                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_McBSP_A")
    1942                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0f)
    1943                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1944                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1945                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1946              
    1947              $C$DW$117       .dwtag  DW_TAG_member
    1948                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1949                      .dwattr $C$DW$117, DW_AT_name("McBSP_B")
    1950                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_McBSP_B")
    1951                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0e)
    1952                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1953                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1954                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1955              
    1956              $C$DW$118       .dwtag  DW_TAG_member
    1957                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1958                      .dwattr $C$DW$118, DW_AT_name("rsvd1")
    1959                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd1")
    1960                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    1961                      .dwattr $C$DW$118, DW_AT_bit_size(0x0e)
    1962                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1963                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1964              
    1965              $C$DW$119       .dwtag  DW_TAG_member
    1966                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1967                      .dwattr $C$DW$119, DW_AT_name("USB_A")
    1968                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_USB_A")
    1969                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0e)
    1970                      .dwattr $C$DW$119, DW_AT_bit_size(0x02)
    1971                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   38

    1972                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1973              
    1974              $C$DW$120       .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1976                      .dwattr $C$DW$120, DW_AT_name("rsvd2")
    1977                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd2")
    1978                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0c)
    1979                      .dwattr $C$DW$120, DW_AT_bit_size(0x02)
    1980                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1981                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1982              
    1983              $C$DW$121       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1985                      .dwattr $C$DW$121, DW_AT_name("rsvd3")
    1986                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd3")
    1987                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    1988                      .dwattr $C$DW$121, DW_AT_bit_size(0x0c)
    1989                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1990                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1991              
    1992                      .dwendtag $C$DW$T$27
    1993              
    1994              
    1995              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1996                      .dwattr $C$DW$T$28, DW_AT_name("DC12_REG")
    1997                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1998              $C$DW$122       .dwtag  DW_TAG_member
    1999                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
    2000                      .dwattr $C$DW$122, DW_AT_name("all")
    2001                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    2002                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2003                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2004              
    2005              $C$DW$123       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$27)
    2007                      .dwattr $C$DW$123, DW_AT_name("bit")
    2008                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    2009                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2010                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2011              
    2012                      .dwendtag $C$DW$T$28
    2013              
    2014              
    2015              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2016                      .dwattr $C$DW$T$29, DW_AT_name("DC13_BITS")
    2017                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2018              $C$DW$124       .dwtag  DW_TAG_member
    2019                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2020                      .dwattr $C$DW$124, DW_AT_name("uPP_A")
    2021                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_uPP_A")
    2022                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0f)
    2023                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    2024                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2025                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2026              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   39

    2027              $C$DW$125       .dwtag  DW_TAG_member
    2028                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2029                      .dwattr $C$DW$125, DW_AT_name("rsvd1")
    2030                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd1")
    2031                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e)
    2032                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    2033                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2034                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2035              
    2036              $C$DW$126       .dwtag  DW_TAG_member
    2037                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2038                      .dwattr $C$DW$126, DW_AT_name("rsvd2")
    2039                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd2")
    2040                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00)
    2041                      .dwattr $C$DW$126, DW_AT_bit_size(0x0e)
    2042                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2043                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2044              
    2045              $C$DW$127       .dwtag  DW_TAG_member
    2046                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2047                      .dwattr $C$DW$127, DW_AT_name("rsvd3")
    2048                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd3")
    2049                      .dwattr $C$DW$127, DW_AT_bit_offset(0x00)
    2050                      .dwattr $C$DW$127, DW_AT_bit_size(0x10)
    2051                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2052                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2053              
    2054                      .dwendtag $C$DW$T$29
    2055              
    2056              
    2057              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2058                      .dwattr $C$DW$T$30, DW_AT_name("DC13_REG")
    2059                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2060              $C$DW$128       .dwtag  DW_TAG_member
    2061                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$21)
    2062                      .dwattr $C$DW$128, DW_AT_name("all")
    2063                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_all")
    2064                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2065                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2066              
    2067              $C$DW$129       .dwtag  DW_TAG_member
    2068                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$29)
    2069                      .dwattr $C$DW$129, DW_AT_name("bit")
    2070                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_bit")
    2071                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2072                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2073              
    2074                      .dwendtag $C$DW$T$30
    2075              
    2076              
    2077              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2078                      .dwattr $C$DW$T$31, DW_AT_name("DC14_BITS")
    2079                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2080              $C$DW$130       .dwtag  DW_TAG_member
    2081                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   40

    2082                      .dwattr $C$DW$130, DW_AT_name("ADC_A")
    2083                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_ADC_A")
    2084                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0f)
    2085                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    2086                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2087                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2088              
    2089              $C$DW$131       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2091                      .dwattr $C$DW$131, DW_AT_name("ADC_B")
    2092                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ADC_B")
    2093                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0e)
    2094                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2095                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2096                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2097              
    2098              $C$DW$132       .dwtag  DW_TAG_member
    2099                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2100                      .dwattr $C$DW$132, DW_AT_name("ADC_C")
    2101                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ADC_C")
    2102                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0d)
    2103                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    2104                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2105                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2106              
    2107              $C$DW$133       .dwtag  DW_TAG_member
    2108                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2109                      .dwattr $C$DW$133, DW_AT_name("ADC_D")
    2110                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ADC_D")
    2111                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0c)
    2112                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    2113                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2114                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2115              
    2116              $C$DW$134       .dwtag  DW_TAG_member
    2117                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2118                      .dwattr $C$DW$134, DW_AT_name("rsvd1")
    2119                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd1")
    2120                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00)
    2121                      .dwattr $C$DW$134, DW_AT_bit_size(0x0c)
    2122                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2123                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2124              
    2125              $C$DW$135       .dwtag  DW_TAG_member
    2126                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2127                      .dwattr $C$DW$135, DW_AT_name("rsvd2")
    2128                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd2")
    2129                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    2130                      .dwattr $C$DW$135, DW_AT_bit_size(0x10)
    2131                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2132                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2133              
    2134                      .dwendtag $C$DW$T$31
    2135              
    2136              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   41

    2137              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2138                      .dwattr $C$DW$T$32, DW_AT_name("DC14_REG")
    2139                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2140              $C$DW$136       .dwtag  DW_TAG_member
    2141                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    2142                      .dwattr $C$DW$136, DW_AT_name("all")
    2143                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_all")
    2144                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2145                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2146              
    2147              $C$DW$137       .dwtag  DW_TAG_member
    2148                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$31)
    2149                      .dwattr $C$DW$137, DW_AT_name("bit")
    2150                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_bit")
    2151                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2152                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2153              
    2154                      .dwendtag $C$DW$T$32
    2155              
    2156              
    2157              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2158                      .dwattr $C$DW$T$33, DW_AT_name("DC15_BITS")
    2159                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2160              $C$DW$138       .dwtag  DW_TAG_member
    2161                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2162                      .dwattr $C$DW$138, DW_AT_name("CMPSS1")
    2163                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_CMPSS1")
    2164                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0f)
    2165                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    2166                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2167                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2168              
    2169              $C$DW$139       .dwtag  DW_TAG_member
    2170                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2171                      .dwattr $C$DW$139, DW_AT_name("CMPSS2")
    2172                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_CMPSS2")
    2173                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0e)
    2174                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2175                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2176                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2177              
    2178              $C$DW$140       .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2180                      .dwattr $C$DW$140, DW_AT_name("CMPSS3")
    2181                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_CMPSS3")
    2182                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0d)
    2183                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2184                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2185                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2186              
    2187              $C$DW$141       .dwtag  DW_TAG_member
    2188                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2189                      .dwattr $C$DW$141, DW_AT_name("CMPSS4")
    2190                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_CMPSS4")
    2191                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   42

    2192                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2193                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2194                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2195              
    2196              $C$DW$142       .dwtag  DW_TAG_member
    2197                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2198                      .dwattr $C$DW$142, DW_AT_name("CMPSS5")
    2199                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_CMPSS5")
    2200                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0b)
    2201                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2202                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2203                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2204              
    2205              $C$DW$143       .dwtag  DW_TAG_member
    2206                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2207                      .dwattr $C$DW$143, DW_AT_name("CMPSS6")
    2208                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_CMPSS6")
    2209                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0a)
    2210                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2211                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2212                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2213              
    2214              $C$DW$144       .dwtag  DW_TAG_member
    2215                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2216                      .dwattr $C$DW$144, DW_AT_name("CMPSS7")
    2217                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_CMPSS7")
    2218                      .dwattr $C$DW$144, DW_AT_bit_offset(0x09)
    2219                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    2220                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2221                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2222              
    2223              $C$DW$145       .dwtag  DW_TAG_member
    2224                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2225                      .dwattr $C$DW$145, DW_AT_name("CMPSS8")
    2226                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_CMPSS8")
    2227                      .dwattr $C$DW$145, DW_AT_bit_offset(0x08)
    2228                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2229                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2230                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2231              
    2232              $C$DW$146       .dwtag  DW_TAG_member
    2233                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2234                      .dwattr $C$DW$146, DW_AT_name("rsvd1")
    2235                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd1")
    2236                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00)
    2237                      .dwattr $C$DW$146, DW_AT_bit_size(0x08)
    2238                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2239                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2240              
    2241              $C$DW$147       .dwtag  DW_TAG_member
    2242                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2243                      .dwattr $C$DW$147, DW_AT_name("rsvd2")
    2244                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_rsvd2")
    2245                      .dwattr $C$DW$147, DW_AT_bit_offset(0x00)
    2246                      .dwattr $C$DW$147, DW_AT_bit_size(0x10)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   43

    2247                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2248                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2249              
    2250                      .dwendtag $C$DW$T$33
    2251              
    2252              
    2253              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2254                      .dwattr $C$DW$T$34, DW_AT_name("DC15_REG")
    2255                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2256              $C$DW$148       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$21)
    2258                      .dwattr $C$DW$148, DW_AT_name("all")
    2259                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_all")
    2260                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2261                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2262              
    2263              $C$DW$149       .dwtag  DW_TAG_member
    2264                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$33)
    2265                      .dwattr $C$DW$149, DW_AT_name("bit")
    2266                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_bit")
    2267                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2268                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2269              
    2270                      .dwendtag $C$DW$T$34
    2271              
    2272              
    2273              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2274                      .dwattr $C$DW$T$35, DW_AT_name("DC17_BITS")
    2275                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2276              $C$DW$150       .dwtag  DW_TAG_member
    2277                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2278                      .dwattr $C$DW$150, DW_AT_name("rsvd1")
    2279                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd1")
    2280                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0f)
    2281                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2282                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2283                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2284              
    2285              $C$DW$151       .dwtag  DW_TAG_member
    2286                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2287                      .dwattr $C$DW$151, DW_AT_name("rsvd2")
    2288                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd2")
    2289                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0e)
    2290                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2291                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2292                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2293              
    2294              $C$DW$152       .dwtag  DW_TAG_member
    2295                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2296                      .dwattr $C$DW$152, DW_AT_name("rsvd3")
    2297                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd3")
    2298                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0d)
    2299                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2300                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2301                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   44

    2302              
    2303              $C$DW$153       .dwtag  DW_TAG_member
    2304                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2305                      .dwattr $C$DW$153, DW_AT_name("rsvd4")
    2306                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd4")
    2307                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0c)
    2308                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2309                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2310                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2311              
    2312              $C$DW$154       .dwtag  DW_TAG_member
    2313                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2314                      .dwattr $C$DW$154, DW_AT_name("rsvd5")
    2315                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd5")
    2316                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00)
    2317                      .dwattr $C$DW$154, DW_AT_bit_size(0x0c)
    2318                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2319                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2320              
    2321              $C$DW$155       .dwtag  DW_TAG_member
    2322                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2323                      .dwattr $C$DW$155, DW_AT_name("DAC_A")
    2324                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_DAC_A")
    2325                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0f)
    2326                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2327                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2328                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2329              
    2330              $C$DW$156       .dwtag  DW_TAG_member
    2331                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2332                      .dwattr $C$DW$156, DW_AT_name("DAC_B")
    2333                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_DAC_B")
    2334                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0e)
    2335                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2336                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2337                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2338              
    2339              $C$DW$157       .dwtag  DW_TAG_member
    2340                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2341                      .dwattr $C$DW$157, DW_AT_name("DAC_C")
    2342                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_DAC_C")
    2343                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0d)
    2344                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2345                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2346                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2347              
    2348              $C$DW$158       .dwtag  DW_TAG_member
    2349                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2350                      .dwattr $C$DW$158, DW_AT_name("rsvd6")
    2351                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd6")
    2352                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0c)
    2353                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2354                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2355                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2356              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   45

    2357              $C$DW$159       .dwtag  DW_TAG_member
    2358                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2359                      .dwattr $C$DW$159, DW_AT_name("rsvd7")
    2360                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd7")
    2361                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00)
    2362                      .dwattr $C$DW$159, DW_AT_bit_size(0x0c)
    2363                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2364                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2365              
    2366                      .dwendtag $C$DW$T$35
    2367              
    2368              
    2369              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2370                      .dwattr $C$DW$T$36, DW_AT_name("DC17_REG")
    2371                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2372              $C$DW$160       .dwtag  DW_TAG_member
    2373                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$21)
    2374                      .dwattr $C$DW$160, DW_AT_name("all")
    2375                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_all")
    2376                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2377                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2378              
    2379              $C$DW$161       .dwtag  DW_TAG_member
    2380                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$35)
    2381                      .dwattr $C$DW$161, DW_AT_name("bit")
    2382                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_bit")
    2383                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2384                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2385              
    2386                      .dwendtag $C$DW$T$36
    2387              
    2388              
    2389              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2390                      .dwattr $C$DW$T$37, DW_AT_name("DC18_BITS")
    2391                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2392              $C$DW$162       .dwtag  DW_TAG_member
    2393                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2394                      .dwattr $C$DW$162, DW_AT_name("LS0_1")
    2395                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_LS0_1")
    2396                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0f)
    2397                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2398                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2399                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2400              
    2401              $C$DW$163       .dwtag  DW_TAG_member
    2402                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2403                      .dwattr $C$DW$163, DW_AT_name("LS1_1")
    2404                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_LS1_1")
    2405                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0e)
    2406                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2407                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2408                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2409              
    2410              $C$DW$164       .dwtag  DW_TAG_member
    2411                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   46

    2412                      .dwattr $C$DW$164, DW_AT_name("LS2_1")
    2413                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_LS2_1")
    2414                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0d)
    2415                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2416                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2417                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2418              
    2419              $C$DW$165       .dwtag  DW_TAG_member
    2420                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2421                      .dwattr $C$DW$165, DW_AT_name("LS3_1")
    2422                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_LS3_1")
    2423                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0c)
    2424                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2425                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2426                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2427              
    2428              $C$DW$166       .dwtag  DW_TAG_member
    2429                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2430                      .dwattr $C$DW$166, DW_AT_name("LS4_1")
    2431                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_LS4_1")
    2432                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0b)
    2433                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2434                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2435                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2436              
    2437              $C$DW$167       .dwtag  DW_TAG_member
    2438                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2439                      .dwattr $C$DW$167, DW_AT_name("LS5_1")
    2440                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_LS5_1")
    2441                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0a)
    2442                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2443                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2444                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2445              
    2446              $C$DW$168       .dwtag  DW_TAG_member
    2447                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2448                      .dwattr $C$DW$168, DW_AT_name("rsvd1")
    2449                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd1")
    2450                      .dwattr $C$DW$168, DW_AT_bit_offset(0x00)
    2451                      .dwattr $C$DW$168, DW_AT_bit_size(0x0a)
    2452                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2453                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2454              
    2455              $C$DW$169       .dwtag  DW_TAG_member
    2456                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2457                      .dwattr $C$DW$169, DW_AT_name("rsvd2")
    2458                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd2")
    2459                      .dwattr $C$DW$169, DW_AT_bit_offset(0x00)
    2460                      .dwattr $C$DW$169, DW_AT_bit_size(0x10)
    2461                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2462                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2463              
    2464                      .dwendtag $C$DW$T$37
    2465              
    2466              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   47

    2467              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2468                      .dwattr $C$DW$T$38, DW_AT_name("DC18_REG")
    2469                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2470              $C$DW$170       .dwtag  DW_TAG_member
    2471                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$21)
    2472                      .dwattr $C$DW$170, DW_AT_name("all")
    2473                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_all")
    2474                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2475                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2476              
    2477              $C$DW$171       .dwtag  DW_TAG_member
    2478                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$37)
    2479                      .dwattr $C$DW$171, DW_AT_name("bit")
    2480                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_bit")
    2481                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2482                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2483              
    2484                      .dwendtag $C$DW$T$38
    2485              
    2486              
    2487              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2488                      .dwattr $C$DW$T$39, DW_AT_name("DC1_BITS")
    2489                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2490              $C$DW$172       .dwtag  DW_TAG_member
    2491                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2492                      .dwattr $C$DW$172, DW_AT_name("CPU1_FPU_TMU")
    2493                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_CPU1_FPU_TMU")
    2494                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0f)
    2495                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2496                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2497                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2498              
    2499              $C$DW$173       .dwtag  DW_TAG_member
    2500                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2501                      .dwattr $C$DW$173, DW_AT_name("rsvd1")
    2502                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd1")
    2503                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0e)
    2504                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2505                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2506                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2507              
    2508              $C$DW$174       .dwtag  DW_TAG_member
    2509                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2510                      .dwattr $C$DW$174, DW_AT_name("CPU1_VCU")
    2511                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_CPU1_VCU")
    2512                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0d)
    2513                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2514                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2515                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2516              
    2517              $C$DW$175       .dwtag  DW_TAG_member
    2518                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2519                      .dwattr $C$DW$175, DW_AT_name("rsvd2")
    2520                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd2")
    2521                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   48

    2522                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2523                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2524                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2525              
    2526              $C$DW$176       .dwtag  DW_TAG_member
    2527                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2528                      .dwattr $C$DW$176, DW_AT_name("rsvd3")
    2529                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd3")
    2530                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0a)
    2531                      .dwattr $C$DW$176, DW_AT_bit_size(0x02)
    2532                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2533                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2534              
    2535              $C$DW$177       .dwtag  DW_TAG_member
    2536                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2537                      .dwattr $C$DW$177, DW_AT_name("CPU1_CLA1")
    2538                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_CPU1_CLA1")
    2539                      .dwattr $C$DW$177, DW_AT_bit_offset(0x09)
    2540                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2541                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2542                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2543              
    2544              $C$DW$178       .dwtag  DW_TAG_member
    2545                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2546                      .dwattr $C$DW$178, DW_AT_name("rsvd4")
    2547                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd4")
    2548                      .dwattr $C$DW$178, DW_AT_bit_offset(0x08)
    2549                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    2550                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2551                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2552              
    2553              $C$DW$179       .dwtag  DW_TAG_member
    2554                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2555                      .dwattr $C$DW$179, DW_AT_name("rsvd5")
    2556                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd5")
    2557                      .dwattr $C$DW$179, DW_AT_bit_offset(0x07)
    2558                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2559                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2560                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2561              
    2562              $C$DW$180       .dwtag  DW_TAG_member
    2563                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2564                      .dwattr $C$DW$180, DW_AT_name("rsvd6")
    2565                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd6")
    2566                      .dwattr $C$DW$180, DW_AT_bit_offset(0x06)
    2567                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2568                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2569                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2570              
    2571              $C$DW$181       .dwtag  DW_TAG_member
    2572                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2573                      .dwattr $C$DW$181, DW_AT_name("rsvd7")
    2574                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd7")
    2575                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00)
    2576                      .dwattr $C$DW$181, DW_AT_bit_size(0x06)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   49

    2577                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2578                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2579              
    2580              $C$DW$182       .dwtag  DW_TAG_member
    2581                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2582                      .dwattr $C$DW$182, DW_AT_name("rsvd8")
    2583                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd8")
    2584                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    2585                      .dwattr $C$DW$182, DW_AT_bit_size(0x10)
    2586                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2587                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2588              
    2589                      .dwendtag $C$DW$T$39
    2590              
    2591              
    2592              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2593                      .dwattr $C$DW$T$40, DW_AT_name("DC1_REG")
    2594                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2595              $C$DW$183       .dwtag  DW_TAG_member
    2596                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$21)
    2597                      .dwattr $C$DW$183, DW_AT_name("all")
    2598                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_all")
    2599                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2600                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2601              
    2602              $C$DW$184       .dwtag  DW_TAG_member
    2603                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$39)
    2604                      .dwattr $C$DW$184, DW_AT_name("bit")
    2605                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_bit")
    2606                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2607                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2608              
    2609                      .dwendtag $C$DW$T$40
    2610              
    2611              
    2612              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2613                      .dwattr $C$DW$T$41, DW_AT_name("DC20_BITS")
    2614                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2615              $C$DW$185       .dwtag  DW_TAG_member
    2616                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2617                      .dwattr $C$DW$185, DW_AT_name("GS0")
    2618                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_GS0")
    2619                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0f)
    2620                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2621                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2622                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2623              
    2624              $C$DW$186       .dwtag  DW_TAG_member
    2625                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2626                      .dwattr $C$DW$186, DW_AT_name("GS1")
    2627                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_GS1")
    2628                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0e)
    2629                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2630                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2631                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   50

    2632              
    2633              $C$DW$187       .dwtag  DW_TAG_member
    2634                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2635                      .dwattr $C$DW$187, DW_AT_name("GS2")
    2636                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_GS2")
    2637                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0d)
    2638                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    2639                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2640                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2641              
    2642              $C$DW$188       .dwtag  DW_TAG_member
    2643                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2644                      .dwattr $C$DW$188, DW_AT_name("GS3")
    2645                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_GS3")
    2646                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0c)
    2647                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2648                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2649                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2650              
    2651              $C$DW$189       .dwtag  DW_TAG_member
    2652                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2653                      .dwattr $C$DW$189, DW_AT_name("GS4")
    2654                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_GS4")
    2655                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0b)
    2656                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2657                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2658                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2659              
    2660              $C$DW$190       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2662                      .dwattr $C$DW$190, DW_AT_name("GS5")
    2663                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_GS5")
    2664                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0a)
    2665                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2666                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2667                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2668              
    2669              $C$DW$191       .dwtag  DW_TAG_member
    2670                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2671                      .dwattr $C$DW$191, DW_AT_name("GS6")
    2672                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_GS6")
    2673                      .dwattr $C$DW$191, DW_AT_bit_offset(0x09)
    2674                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2675                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2676                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2677              
    2678              $C$DW$192       .dwtag  DW_TAG_member
    2679                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2680                      .dwattr $C$DW$192, DW_AT_name("GS7")
    2681                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_GS7")
    2682                      .dwattr $C$DW$192, DW_AT_bit_offset(0x08)
    2683                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2684                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2685                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2686              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   51

    2687              $C$DW$193       .dwtag  DW_TAG_member
    2688                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2689                      .dwattr $C$DW$193, DW_AT_name("GS8")
    2690                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_GS8")
    2691                      .dwattr $C$DW$193, DW_AT_bit_offset(0x07)
    2692                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2693                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2694                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2695              
    2696              $C$DW$194       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2698                      .dwattr $C$DW$194, DW_AT_name("GS9")
    2699                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_GS9")
    2700                      .dwattr $C$DW$194, DW_AT_bit_offset(0x06)
    2701                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2702                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2703                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2704              
    2705              $C$DW$195       .dwtag  DW_TAG_member
    2706                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2707                      .dwattr $C$DW$195, DW_AT_name("GS10")
    2708                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_GS10")
    2709                      .dwattr $C$DW$195, DW_AT_bit_offset(0x05)
    2710                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2711                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2712                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2713              
    2714              $C$DW$196       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2716                      .dwattr $C$DW$196, DW_AT_name("GS11")
    2717                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_GS11")
    2718                      .dwattr $C$DW$196, DW_AT_bit_offset(0x04)
    2719                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    2720                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2721                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2722              
    2723              $C$DW$197       .dwtag  DW_TAG_member
    2724                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2725                      .dwattr $C$DW$197, DW_AT_name("GS12")
    2726                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_GS12")
    2727                      .dwattr $C$DW$197, DW_AT_bit_offset(0x03)
    2728                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2729                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2730                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2731              
    2732              $C$DW$198       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2734                      .dwattr $C$DW$198, DW_AT_name("GS13")
    2735                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_GS13")
    2736                      .dwattr $C$DW$198, DW_AT_bit_offset(0x02)
    2737                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    2738                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2739                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2740              
    2741              $C$DW$199       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   52

    2742                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2743                      .dwattr $C$DW$199, DW_AT_name("GS14")
    2744                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_GS14")
    2745                      .dwattr $C$DW$199, DW_AT_bit_offset(0x01)
    2746                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2747                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2748                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2749              
    2750              $C$DW$200       .dwtag  DW_TAG_member
    2751                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2752                      .dwattr $C$DW$200, DW_AT_name("GS15")
    2753                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_GS15")
    2754                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00)
    2755                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2756                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2757                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2758              
    2759              $C$DW$201       .dwtag  DW_TAG_member
    2760                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2761                      .dwattr $C$DW$201, DW_AT_name("rsvd1")
    2762                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd1")
    2763                      .dwattr $C$DW$201, DW_AT_bit_offset(0x00)
    2764                      .dwattr $C$DW$201, DW_AT_bit_size(0x10)
    2765                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2766                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2767              
    2768                      .dwendtag $C$DW$T$41
    2769              
    2770              
    2771              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2772                      .dwattr $C$DW$T$42, DW_AT_name("DC20_REG")
    2773                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2774              $C$DW$202       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    2776                      .dwattr $C$DW$202, DW_AT_name("all")
    2777                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_all")
    2778                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2779                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2780              
    2781              $C$DW$203       .dwtag  DW_TAG_member
    2782                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$41)
    2783                      .dwattr $C$DW$203, DW_AT_name("bit")
    2784                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_bit")
    2785                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2786                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2787              
    2788                      .dwendtag $C$DW$T$42
    2789              
    2790              
    2791              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2792                      .dwattr $C$DW$T$43, DW_AT_name("DC2_BITS")
    2793                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2794              $C$DW$204       .dwtag  DW_TAG_member
    2795                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2796                      .dwattr $C$DW$204, DW_AT_name("EMIF1")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   53

    2797                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_EMIF1")
    2798                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0f)
    2799                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2800                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2801                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2802              
    2803              $C$DW$205       .dwtag  DW_TAG_member
    2804                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2805                      .dwattr $C$DW$205, DW_AT_name("EMIF2")
    2806                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_EMIF2")
    2807                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0e)
    2808                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    2809                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2810                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2811              
    2812              $C$DW$206       .dwtag  DW_TAG_member
    2813                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2814                      .dwattr $C$DW$206, DW_AT_name("rsvd1")
    2815                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_rsvd1")
    2816                      .dwattr $C$DW$206, DW_AT_bit_offset(0x00)
    2817                      .dwattr $C$DW$206, DW_AT_bit_size(0x0e)
    2818                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2819                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2820              
    2821              $C$DW$207       .dwtag  DW_TAG_member
    2822                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2823                      .dwattr $C$DW$207, DW_AT_name("rsvd2")
    2824                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_rsvd2")
    2825                      .dwattr $C$DW$207, DW_AT_bit_offset(0x00)
    2826                      .dwattr $C$DW$207, DW_AT_bit_size(0x10)
    2827                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2828                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2829              
    2830                      .dwendtag $C$DW$T$43
    2831              
    2832              
    2833              $C$DW$T$44      .dwtag  DW_TAG_union_type
    2834                      .dwattr $C$DW$T$44, DW_AT_name("DC2_REG")
    2835                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2836              $C$DW$208       .dwtag  DW_TAG_member
    2837                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$21)
    2838                      .dwattr $C$DW$208, DW_AT_name("all")
    2839                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_all")
    2840                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2841                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2842              
    2843              $C$DW$209       .dwtag  DW_TAG_member
    2844                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$43)
    2845                      .dwattr $C$DW$209, DW_AT_name("bit")
    2846                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_bit")
    2847                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2848                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2849              
    2850                      .dwendtag $C$DW$T$44
    2851              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   54

    2852              
    2853              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2854                      .dwattr $C$DW$T$45, DW_AT_name("DC3_BITS")
    2855                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2856              $C$DW$210       .dwtag  DW_TAG_member
    2857                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2858                      .dwattr $C$DW$210, DW_AT_name("EPWM1")
    2859                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_EPWM1")
    2860                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0f)
    2861                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2862                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2863                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2864              
    2865              $C$DW$211       .dwtag  DW_TAG_member
    2866                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2867                      .dwattr $C$DW$211, DW_AT_name("EPWM2")
    2868                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_EPWM2")
    2869                      .dwattr $C$DW$211, DW_AT_bit_offset(0x0e)
    2870                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    2871                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2872                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2873              
    2874              $C$DW$212       .dwtag  DW_TAG_member
    2875                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2876                      .dwattr $C$DW$212, DW_AT_name("EPWM3")
    2877                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_EPWM3")
    2878                      .dwattr $C$DW$212, DW_AT_bit_offset(0x0d)
    2879                      .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    2880                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2881                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2882              
    2883              $C$DW$213       .dwtag  DW_TAG_member
    2884                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2885                      .dwattr $C$DW$213, DW_AT_name("EPWM4")
    2886                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_EPWM4")
    2887                      .dwattr $C$DW$213, DW_AT_bit_offset(0x0c)
    2888                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    2889                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2890                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2891              
    2892              $C$DW$214       .dwtag  DW_TAG_member
    2893                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2894                      .dwattr $C$DW$214, DW_AT_name("EPWM5")
    2895                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_EPWM5")
    2896                      .dwattr $C$DW$214, DW_AT_bit_offset(0x0b)
    2897                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    2898                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2899                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2900              
    2901              $C$DW$215       .dwtag  DW_TAG_member
    2902                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2903                      .dwattr $C$DW$215, DW_AT_name("EPWM6")
    2904                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_EPWM6")
    2905                      .dwattr $C$DW$215, DW_AT_bit_offset(0x0a)
    2906                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   55

    2907                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2908                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2909              
    2910              $C$DW$216       .dwtag  DW_TAG_member
    2911                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2912                      .dwattr $C$DW$216, DW_AT_name("EPWM7")
    2913                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_EPWM7")
    2914                      .dwattr $C$DW$216, DW_AT_bit_offset(0x09)
    2915                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    2916                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2917                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2918              
    2919              $C$DW$217       .dwtag  DW_TAG_member
    2920                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2921                      .dwattr $C$DW$217, DW_AT_name("EPWM8")
    2922                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_EPWM8")
    2923                      .dwattr $C$DW$217, DW_AT_bit_offset(0x08)
    2924                      .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    2925                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2926                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2927              
    2928              $C$DW$218       .dwtag  DW_TAG_member
    2929                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2930                      .dwattr $C$DW$218, DW_AT_name("EPWM9")
    2931                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_EPWM9")
    2932                      .dwattr $C$DW$218, DW_AT_bit_offset(0x07)
    2933                      .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    2934                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2935                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2936              
    2937              $C$DW$219       .dwtag  DW_TAG_member
    2938                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2939                      .dwattr $C$DW$219, DW_AT_name("EPWM10")
    2940                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_EPWM10")
    2941                      .dwattr $C$DW$219, DW_AT_bit_offset(0x06)
    2942                      .dwattr $C$DW$219, DW_AT_bit_size(0x01)
    2943                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2944                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2945              
    2946              $C$DW$220       .dwtag  DW_TAG_member
    2947                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2948                      .dwattr $C$DW$220, DW_AT_name("EPWM11")
    2949                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_EPWM11")
    2950                      .dwattr $C$DW$220, DW_AT_bit_offset(0x05)
    2951                      .dwattr $C$DW$220, DW_AT_bit_size(0x01)
    2952                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2953                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2954              
    2955              $C$DW$221       .dwtag  DW_TAG_member
    2956                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2957                      .dwattr $C$DW$221, DW_AT_name("EPWM12")
    2958                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_EPWM12")
    2959                      .dwattr $C$DW$221, DW_AT_bit_offset(0x04)
    2960                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    2961                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:34 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   56

    2962                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2963              
    2964              $C$DW$222       .dwtag  DW_TAG_member
    2965                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2966                      .dwattr $C$DW$222, DW_AT_name("rsvd1")
    2967                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_rsvd1")
    2968                      .dwattr $C$DW$222, DW_AT_bit_offset(0x03)
    2969                      .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    2970                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2971                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2972              
    2973              $C$DW$223       .dwtag  DW_TAG_member
    2974                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2975                      .dwattr $C$DW$223, DW_AT_name("rsvd2")
    2976                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_rsvd2")
    2977                      .dwattr $C$DW$223, DW_AT_bit_offset(0x02)
    2978                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    2979                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2980                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2981              
    2982              $C$DW$224       .dwtag  DW_TAG_member
    2983                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2984                      .dwattr $C$DW$224, DW_AT_name("rsvd3")
    2985                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_rsvd3")
    2986                      .dwattr $C$DW$224, DW_AT_bit_offset(0x01)
    2987                      .dwattr $C$DW$224, DW_AT_bit_size(0x01)
    2988                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2989                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2990              
    2991              $C$DW$225       .dwtag  DW_TAG_member
    2992                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2993                      .dwattr $C$DW$225, DW_AT_name("rsvd4")
    2994                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_rsvd4")
    2995                      .dwattr $C$DW$225, DW_AT_bit_offset(0x00)
    2996                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    2997                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2998                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2999              
    3000              $C$DW$226       .dwtag  DW_TAG_member
    3001                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    3002                      .dwattr $C$DW$226, DW_AT_name("rsvd5")
    3003                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_rsvd5")
    3004                      .dwattr $C$DW$226, DW_AT_bit_offset(0x00)
