TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Tue May 11 14:30:51 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../MonoMtrServo.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Chiaming\CCSworkspace_V10\MonoMtrServo_377s\F2837x_RAM")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    7604 0000011b 761F!         MOVW      DP,#_PieCtrlRegs+1    ; [CPU_ARAU] 
         0000011c 0000 
    7605 0000011d 56BF!         MOVB      @$BLOCKED(_PieCtrlRegs)+1,#4,UNC ; [CPU_ALU] |2973| 
         0000011e 0401 
    7606                      .dwpsn  file "../MonoMtrServo.c",line 2976,column 1,is_stmt,isa 0
    7607 0000011f E562          RESTORE   ; [CPU_FPU] 
    7608 00000120 FFF1          POP       RB                    ; [CPU_FPU] 
    7609                      .dwcfi  cfa_offset, -14
    7610                      .dwcfi  restore_reg, 74
    7611 00000121 C5BE          MOVL      XAR7,*--SP            ; [CPU_ALU] 
    7612                      .dwcfi  cfa_offset, -12
    7613                      .dwcfi  restore_reg, 18
    7614 00000122 C4BE          MOVL      XAR6,*--SP            ; [CPU_ALU] 
    7615                      .dwcfi  cfa_offset, -10
    7616                      .dwcfi  restore_reg, 16
    7617 00000123 83BE          MOVL      XAR5,*--SP            ; [CPU_ALU] 
    7618                      .dwcfi  cfa_offset, -8
    7619                      .dwcfi  restore_reg, 14
    7620 00000124 8ABE          MOVL      XAR4,*--SP            ; [CPU_ALU] 
    7621                      .dwcfi  cfa_offset, -6
    7622                      .dwcfi  restore_reg, 12
    7623 00000125 87BE          MOVL      XT,*--SP              ; [CPU_ALU] 
    7624                      .dwcfi  cfa_offset, -4
    7625                      .dwcfi  restore_reg, 22
    7626                      .dwcfi  restore_reg, 21
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  171

    7627 00000126 0003          POP       AR1H:AR0H             ; [CPU_ALU] 
    7628                      .dwcfi  cfa_offset, -2
    7629                      .dwcfi  restore_reg, 5
    7630                      .dwcfi  restore_reg, 7
    7631 00000127 7617          NASP      ; [CPU_ALU] 
    7632              $C$DW$340       .dwtag  DW_TAG_TI_branch
    7633                      .dwattr $C$DW$340, DW_AT_low_pc(0x00)
    7634                      .dwattr $C$DW$340, DW_AT_TI_return
    7635              
    7636 00000128 7602          IRET      ; [CPU_ALU] 
    7637                      ; return occurs ; [] 
    7638                      .dwattr $C$DW$337, DW_AT_TI_end_file("../MonoMtrServo.c")
    7639                      .dwattr $C$DW$337, DW_AT_TI_end_line(0xba0)
    7640                      .dwattr $C$DW$337, DW_AT_TI_end_column(0x01)
    7641                      .dwendentry
    7642                      .dwendtag $C$DW$337
    7643              
    7644              ;**************************************************************
    7645              ;* UNDEFINED EXTERNAL REFERENCES                              *
    7646              ;**************************************************************
    7647                      .global _InitSysCtrl1
    7648                      .global _InitPieCtrl
    7649                      .global _InitPieVectTable
    7650                      .global _GPIO_SetupPinOptions
    7651                      .global _GPIO_SetupPinMux
    7652                      .global _PWM_1ch_UpDwnCnt_CNF
    7653                      .global _InitMotor1EPwmGpio
    7654                      .global _ConfigureADC
    7655                      .global _InitMotor1EQepGpio
    7656                      .global _InitMotor1SpiGpio
    7657                      .global _InitSpiRegs_DRV830x
    7658                      .global _GPIO_WritePin
    7659                      .global _F28x_usDelay
    7660                      .global _DLOG_4CH_F_init
    7661                      .global _floor
    7662                      .global _exp
    7663                      .global _CpuTimer0Regs
    7664                      .global _CpuTimer1Regs
    7665                      .global _CpuTimer2Regs
    7666                      .global _SpiaRegs
    7667                      .global _AdcaResultRegs
    7668                      .global _AdcbResultRegs
    7669                      .global _AdccResultRegs
    7670                      .global _AdcdResultRegs
    7671                      .global _PieCtrlRegs
    7672                      .global _EQep1Regs
    7673                      .global _GpioDataRegs
    7674                      .global _EPwmXbarRegs
    7675                      .global _AdcaRegs
    7676                      .global _AdcbRegs
    7677                      .global _AdccRegs
    7678                      .global _AdcdRegs
    7679                      .global _CpuSysRegs
    7680                      .global _EPwm1Regs
    7681                      .global _EPwm4Regs
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  172

    7682                      .global _EPwm5Regs
    7683                      .global _EPwm6Regs
    7684                      .global _EPwm7Regs
    7685                      .global _PieVectTable
    7686              
    7687              ;***************************************************************
    7688              ;* TYPE INFORMATION                                            *
    7689              ;***************************************************************
    7690              
    7691              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7692                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    7693              $C$DW$341       .dwtag  DW_TAG_member
    7694                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
    7695                      .dwattr $C$DW$341, DW_AT_name("real")
    7696                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_real")
    7697                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7698                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    7699              
    7700              $C$DW$342       .dwtag  DW_TAG_member
    7701                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
    7702                      .dwattr $C$DW$342, DW_AT_name("img")
    7703                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_img")
    7704                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7705                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    7706              
    7707                      .dwendtag $C$DW$T$20
    7708              
    7709              $C$DW$T$85      .dwtag  DW_TAG_typedef
    7710                      .dwattr $C$DW$T$85, DW_AT_name("complex")
    7711                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$20)
    7712                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    7713              
    7714              $C$DW$T$641     .dwtag  DW_TAG_pointer_type
    7715                      .dwattr $C$DW$T$641, DW_AT_type(*$C$DW$T$85)
    7716                      .dwattr $C$DW$T$641, DW_AT_address_class(0x20)
    7717              
    7718              
    7719              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    7720                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x1a)
    7721              $C$DW$343       .dwtag  DW_TAG_member
    7722                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$22)
    7723                      .dwattr $C$DW$343, DW_AT_name("input_ptr1")
    7724                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_input_ptr1")
    7725                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7726                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    7727              
    7728              $C$DW$344       .dwtag  DW_TAG_member
    7729                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$22)
    7730                      .dwattr $C$DW$344, DW_AT_name("input_ptr2")
    7731                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_input_ptr2")
    7732                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7733                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    7734              
    7735              $C$DW$345       .dwtag  DW_TAG_member
    7736                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  173

    7737                      .dwattr $C$DW$345, DW_AT_name("input_ptr3")
    7738                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_input_ptr3")
    7739                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7740                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    7741              
    7742              $C$DW$346       .dwtag  DW_TAG_member
    7743                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$22)
    7744                      .dwattr $C$DW$346, DW_AT_name("input_ptr4")
    7745                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_input_ptr4")
    7746                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7747                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    7748              
    7749              $C$DW$347       .dwtag  DW_TAG_member
    7750                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$22)
    7751                      .dwattr $C$DW$347, DW_AT_name("output_ptr1")
    7752                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_output_ptr1")
    7753                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7754                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    7755              
    7756              $C$DW$348       .dwtag  DW_TAG_member
    7757                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$22)
    7758                      .dwattr $C$DW$348, DW_AT_name("output_ptr2")
    7759                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_output_ptr2")
    7760                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7761                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    7762              
    7763              $C$DW$349       .dwtag  DW_TAG_member
    7764                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$22)
    7765                      .dwattr $C$DW$349, DW_AT_name("output_ptr3")
    7766                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_output_ptr3")
    7767                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7768                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    7769              
    7770              $C$DW$350       .dwtag  DW_TAG_member
    7771                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$22)
    7772                      .dwattr $C$DW$350, DW_AT_name("output_ptr4")
    7773                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_output_ptr4")
    7774                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7775                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    7776              
    7777              $C$DW$351       .dwtag  DW_TAG_member
    7778                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$21)
    7779                      .dwattr $C$DW$351, DW_AT_name("prev_value")
    7780                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_prev_value")
    7781                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7782                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    7783              
    7784              $C$DW$352       .dwtag  DW_TAG_member
    7785                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$21)
    7786                      .dwattr $C$DW$352, DW_AT_name("trig_value")
    7787                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_trig_value")
    7788                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7789                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    7790              
    7791              $C$DW$353       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  174

    7792                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$23)
    7793                      .dwattr $C$DW$353, DW_AT_name("status")
    7794                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_status")
    7795                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7796                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    7797              
    7798              $C$DW$354       .dwtag  DW_TAG_member
    7799                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$23)
    7800                      .dwattr $C$DW$354, DW_AT_name("pre_scalar")
    7801                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_pre_scalar")
    7802                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    7803                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    7804              
    7805              $C$DW$355       .dwtag  DW_TAG_member
    7806                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$23)
    7807                      .dwattr $C$DW$355, DW_AT_name("skip_count")
    7808                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_skip_count")
    7809                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7810                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    7811              
    7812              $C$DW$356       .dwtag  DW_TAG_member
    7813                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$23)
    7814                      .dwattr $C$DW$356, DW_AT_name("size")
    7815                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_size")
    7816                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    7817                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    7818              
    7819              $C$DW$357       .dwtag  DW_TAG_member
    7820                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$23)
    7821                      .dwattr $C$DW$357, DW_AT_name("count")
    7822                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_count")
    7823                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7824                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    7825              
    7826                      .dwendtag $C$DW$T$24
    7827              
    7828              $C$DW$T$642     .dwtag  DW_TAG_typedef
    7829                      .dwattr $C$DW$T$642, DW_AT_name("DLOG_4CH_F")
    7830                      .dwattr $C$DW$T$642, DW_AT_type(*$C$DW$T$24)
    7831                      .dwattr $C$DW$T$642, DW_AT_language(DW_LANG_C)
    7832              
    7833              $C$DW$T$643     .dwtag  DW_TAG_pointer_type
    7834                      .dwattr $C$DW$T$643, DW_AT_type(*$C$DW$T$642)
    7835                      .dwattr $C$DW$T$643, DW_AT_address_class(0x20)
    7836              
    7837              
    7838              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    7839                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
    7840              $C$DW$358       .dwtag  DW_TAG_member
    7841                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$19)
    7842                      .dwattr $C$DW$358, DW_AT_name("As")
    7843                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_As")
    7844                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7845                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    7846              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  175

    7847              $C$DW$359       .dwtag  DW_TAG_member
    7848                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$19)
    7849                      .dwattr $C$DW$359, DW_AT_name("Bs")
    7850                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_Bs")
    7851                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7852                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    7853              
    7854              $C$DW$360       .dwtag  DW_TAG_member
    7855                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$19)
    7856                      .dwattr $C$DW$360, DW_AT_name("Cs")
    7857                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_Cs")
    7858                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7859                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    7860              
    7861              $C$DW$361       .dwtag  DW_TAG_member
    7862                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$19)
    7863                      .dwattr $C$DW$361, DW_AT_name("Alpha")
    7864                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_Alpha")
    7865                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7866                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    7867              
    7868              $C$DW$362       .dwtag  DW_TAG_member
    7869                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$19)
    7870                      .dwattr $C$DW$362, DW_AT_name("Beta")
    7871                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_Beta")
    7872                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7873                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    7874              
    7875                      .dwendtag $C$DW$T$25
    7876              
    7877              $C$DW$T$70      .dwtag  DW_TAG_typedef
    7878                      .dwattr $C$DW$T$70, DW_AT_name("CLARKE")
    7879                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$25)
    7880                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    7881              
    7882              
    7883              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    7884                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0e)
    7885              $C$DW$363       .dwtag  DW_TAG_member
    7886                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
    7887                      .dwattr $C$DW$363, DW_AT_name("Alpha")
    7888                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_Alpha")
    7889                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7890                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    7891              
    7892              $C$DW$364       .dwtag  DW_TAG_member
    7893                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$19)
    7894                      .dwattr $C$DW$364, DW_AT_name("Beta")
    7895                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_Beta")
    7896                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7897                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    7898              
    7899              $C$DW$365       .dwtag  DW_TAG_member
    7900                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$19)
    7901                      .dwattr $C$DW$365, DW_AT_name("Angle")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  176

    7902                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_Angle")
    7903                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7904                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    7905              
    7906              $C$DW$366       .dwtag  DW_TAG_member
    7907                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$19)
    7908                      .dwattr $C$DW$366, DW_AT_name("Ds")
    7909                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_Ds")
    7910                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7911                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    7912              
    7913              $C$DW$367       .dwtag  DW_TAG_member
    7914                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$19)
    7915                      .dwattr $C$DW$367, DW_AT_name("Qs")
    7916                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_Qs")
    7917                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7918                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    7919              
    7920              $C$DW$368       .dwtag  DW_TAG_member
    7921                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$19)
    7922                      .dwattr $C$DW$368, DW_AT_name("Sine")
    7923                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_Sine")
    7924                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7925                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    7926              
    7927              $C$DW$369       .dwtag  DW_TAG_member
    7928                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$19)
    7929                      .dwattr $C$DW$369, DW_AT_name("Cosine")
    7930                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_Cosine")
    7931                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7932                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    7933              
    7934                      .dwendtag $C$DW$T$26
    7935              
    7936              $C$DW$T$71      .dwtag  DW_TAG_typedef
    7937                      .dwattr $C$DW$T$71, DW_AT_name("PARK")
    7938                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$26)
    7939                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    7940              
    7941              
    7942              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    7943                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0e)
    7944              $C$DW$370       .dwtag  DW_TAG_member
    7945                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$19)
    7946                      .dwattr $C$DW$370, DW_AT_name("Alpha")
    7947                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_Alpha")
    7948                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7949                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    7950              
    7951              $C$DW$371       .dwtag  DW_TAG_member
    7952                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$19)
    7953                      .dwattr $C$DW$371, DW_AT_name("Beta")
    7954                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_Beta")
    7955                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7956                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  177

    7957              
    7958              $C$DW$372       .dwtag  DW_TAG_member
    7959                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$19)
    7960                      .dwattr $C$DW$372, DW_AT_name("Angle")
    7961                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_Angle")
    7962                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7963                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    7964              
    7965              $C$DW$373       .dwtag  DW_TAG_member
    7966                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$19)
    7967                      .dwattr $C$DW$373, DW_AT_name("Ds")
    7968                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_Ds")
    7969                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7970                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    7971              
    7972              $C$DW$374       .dwtag  DW_TAG_member
    7973                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$19)
    7974                      .dwattr $C$DW$374, DW_AT_name("Qs")
    7975                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_Qs")
    7976                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7977                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    7978              
    7979              $C$DW$375       .dwtag  DW_TAG_member
    7980                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$19)
    7981                      .dwattr $C$DW$375, DW_AT_name("Sine")
    7982                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_Sine")
    7983                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7984                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    7985              
    7986              $C$DW$376       .dwtag  DW_TAG_member
    7987                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$19)
    7988                      .dwattr $C$DW$376, DW_AT_name("Cosine")
    7989                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_Cosine")
    7990                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7991                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    7992              
    7993                      .dwendtag $C$DW$T$27
    7994              
    7995              $C$DW$T$72      .dwtag  DW_TAG_typedef
    7996                      .dwattr $C$DW$T$72, DW_AT_name("IPARK")
    7997                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$27)
    7998                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    7999              
    8000              
    8001              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    8002                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
    8003              $C$DW$377       .dwtag  DW_TAG_member
    8004                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$19)
    8005                      .dwattr $C$DW$377, DW_AT_name("Alpha")
    8006                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_Alpha")
    8007                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8008                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    8009              
    8010              $C$DW$378       .dwtag  DW_TAG_member
    8011                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  178

    8012                      .dwattr $C$DW$378, DW_AT_name("Beta")
    8013                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_Beta")
    8014                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8015                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    8016              
    8017              $C$DW$379       .dwtag  DW_TAG_member
    8018                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$19)
    8019                      .dwattr $C$DW$379, DW_AT_name("As")
    8020                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_As")
    8021                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8022                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    8023              
    8024              $C$DW$380       .dwtag  DW_TAG_member
    8025                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$19)
    8026                      .dwattr $C$DW$380, DW_AT_name("Bs")
    8027                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_Bs")
    8028                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8029                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    8030              
    8031              $C$DW$381       .dwtag  DW_TAG_member
    8032                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$19)
    8033                      .dwattr $C$DW$381, DW_AT_name("Cs")
    8034                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_Cs")
    8035                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8036                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    8037              
    8038                      .dwendtag $C$DW$T$28
    8039              
    8040              $C$DW$T$73      .dwtag  DW_TAG_typedef
    8041                      .dwattr $C$DW$T$73, DW_AT_name("ICLARKE")
    8042                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$28)
    8043                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    8044              
    8045              
    8046              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    8047                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    8048              $C$DW$382       .dwtag  DW_TAG_member
    8049                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$19)
    8050                      .dwattr $C$DW$382, DW_AT_name("Vc_AB")
    8051                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_Vc_AB")
    8052                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8053                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    8054              
    8055              $C$DW$383       .dwtag  DW_TAG_member
    8056                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
    8057                      .dwattr $C$DW$383, DW_AT_name("Vc_BC")
    8058                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_Vc_BC")
    8059                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8060                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    8061              
    8062              $C$DW$384       .dwtag  DW_TAG_member
    8063                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$19)
    8064                      .dwattr $C$DW$384, DW_AT_name("Vc_A")
    8065                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_Vc_A")
    8066                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  179

    8067                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    8068              
    8069              $C$DW$385       .dwtag  DW_TAG_member
    8070                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$19)
    8071                      .dwattr $C$DW$385, DW_AT_name("Vc_B")
    8072                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_Vc_B")
    8073                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8074                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    8075              
    8076                      .dwendtag $C$DW$T$29
    8077              
    8078              $C$DW$T$74      .dwtag  DW_TAG_typedef
    8079                      .dwattr $C$DW$T$74, DW_AT_name("VCMEAS")
    8080                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$29)
    8081                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    8082              
    8083              
    8084              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    8085                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x10)
    8086              $C$DW$386       .dwtag  DW_TAG_member
    8087                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$19)
    8088                      .dwattr $C$DW$386, DW_AT_name("Ref")
    8089                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_Ref")
    8090                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8091                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    8092              
    8093              $C$DW$387       .dwtag  DW_TAG_member
    8094                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$19)
    8095                      .dwattr $C$DW$387, DW_AT_name("Fbk")
    8096                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_Fbk")
    8097                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8098                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    8099              
    8100              $C$DW$388       .dwtag  DW_TAG_member
    8101                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$19)
    8102                      .dwattr $C$DW$388, DW_AT_name("Out")
    8103                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_Out")
    8104                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8105                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    8106              
    8107              $C$DW$389       .dwtag  DW_TAG_member
    8108                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$19)
    8109                      .dwattr $C$DW$389, DW_AT_name("c1")
    8110                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_c1")
    8111                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8112                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    8113              
    8114              $C$DW$390       .dwtag  DW_TAG_member
    8115                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$19)
    8116                      .dwattr $C$DW$390, DW_AT_name("c2")
    8117                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_c2")
    8118                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8119                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    8120              
    8121              $C$DW$391       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  180

    8122                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$19)
    8123                      .dwattr $C$DW$391, DW_AT_name("Ref1")
    8124                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_Ref1")
    8125                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8126                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    8127              
    8128              $C$DW$392       .dwtag  DW_TAG_member
    8129                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$19)
    8130                      .dwattr $C$DW$392, DW_AT_name("Fbk1")
    8131                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_Fbk1")
    8132                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8133                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    8134              
    8135              $C$DW$393       .dwtag  DW_TAG_member
    8136                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$19)
    8137                      .dwattr $C$DW$393, DW_AT_name("We")
    8138                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_We")
    8139                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8140                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    8141              
    8142                      .dwendtag $C$DW$T$30
    8143              
    8144              $C$DW$T$33      .dwtag  DW_TAG_typedef
    8145                      .dwattr $C$DW$T$33, DW_AT_name("PID_GRANDO_TERMINALS")
    8146                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$30)
    8147                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    8148              
    8149              
    8150              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    8151                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x14)
    8152              $C$DW$394       .dwtag  DW_TAG_member
    8153                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$19)
    8154                      .dwattr $C$DW$394, DW_AT_name("Kr")
    8155                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_Kr")
    8156                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8157                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    8158              
    8159              $C$DW$395       .dwtag  DW_TAG_member
    8160                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
    8161                      .dwattr $C$DW$395, DW_AT_name("Bw")
    8162                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_Bw")
    8163                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8164                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    8165              
    8166              $C$DW$396       .dwtag  DW_TAG_member
    8167                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$19)
    8168                      .dwattr $C$DW$396, DW_AT_name("Kp")
    8169                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_Kp")
    8170                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8171                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    8172              
    8173              $C$DW$397       .dwtag  DW_TAG_member
    8174                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$19)
    8175                      .dwattr $C$DW$397, DW_AT_name("Ki")
    8176                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_Ki")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  181

    8177                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8178                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    8179              
    8180              $C$DW$398       .dwtag  DW_TAG_member
    8181                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$19)
    8182                      .dwattr $C$DW$398, DW_AT_name("Kd")
    8183                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_Kd")
    8184                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8185                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    8186              
    8187              $C$DW$399       .dwtag  DW_TAG_member
    8188                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$19)
    8189                      .dwattr $C$DW$399, DW_AT_name("Km")
    8190                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_Km")
    8191                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8192                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    8193              
    8194              $C$DW$400       .dwtag  DW_TAG_member
    8195                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$19)
    8196                      .dwattr $C$DW$400, DW_AT_name("Umax")
    8197                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_Umax")
    8198                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8199                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    8200              
    8201              $C$DW$401       .dwtag  DW_TAG_member
    8202                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$19)
    8203                      .dwattr $C$DW$401, DW_AT_name("Umin")
    8204                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_Umin")
    8205                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8206                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    8207              
    8208              $C$DW$402       .dwtag  DW_TAG_member
    8209                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$19)
    8210                      .dwattr $C$DW$402, DW_AT_name("sig")
    8211                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_sig")
    8212                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8213                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    8214              
    8215              $C$DW$403       .dwtag  DW_TAG_member
    8216                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$19)
    8217                      .dwattr $C$DW$403, DW_AT_name("La")
    8218                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_La")
    8219                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8220                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    8221              
    8222                      .dwendtag $C$DW$T$31
    8223              
    8224              $C$DW$T$34      .dwtag  DW_TAG_typedef
    8225                      .dwattr $C$DW$T$34, DW_AT_name("PID_GRANDO_PARAMETERS")
    8226                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$31)
    8227                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    8228              
    8229              
    8230              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    8231                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x18)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  182

    8232              $C$DW$404       .dwtag  DW_TAG_member
    8233                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$19)
    8234                      .dwattr $C$DW$404, DW_AT_name("up")
    8235                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_up")
    8236                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8237                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    8238              
    8239              $C$DW$405       .dwtag  DW_TAG_member
    8240                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$19)
    8241                      .dwattr $C$DW$405, DW_AT_name("ui")
    8242                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_ui")
    8243                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8244                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    8245              
    8246              $C$DW$406       .dwtag  DW_TAG_member
    8247                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$19)
    8248                      .dwattr $C$DW$406, DW_AT_name("ud")
    8249                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_ud")
    8250                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8251                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    8252              
    8253              $C$DW$407       .dwtag  DW_TAG_member
    8254                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$19)
    8255                      .dwattr $C$DW$407, DW_AT_name("p1")
    8256                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_p1")
    8257                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8258                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    8259              
    8260              $C$DW$408       .dwtag  DW_TAG_member
    8261                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
    8262                      .dwattr $C$DW$408, DW_AT_name("v1")
    8263                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_v1")
    8264                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8265                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    8266              
    8267              $C$DW$409       .dwtag  DW_TAG_member
    8268                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$19)
    8269                      .dwattr $C$DW$409, DW_AT_name("i1")
    8270                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_i1")
    8271                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8272                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    8273              
    8274              $C$DW$410       .dwtag  DW_TAG_member
    8275                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$19)
    8276                      .dwattr $C$DW$410, DW_AT_name("d1")
    8277                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_d1")
    8278                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8279                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    8280              
    8281              $C$DW$411       .dwtag  DW_TAG_member
    8282                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$19)
    8283                      .dwattr $C$DW$411, DW_AT_name("d2")
    8284                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_d2")
    8285                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8286                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  183

    8287              
    8288              $C$DW$412       .dwtag  DW_TAG_member
    8289                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
    8290                      .dwattr $C$DW$412, DW_AT_name("w1")
    8291                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_w1")
    8292                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8293                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    8294              
    8295              $C$DW$413       .dwtag  DW_TAG_member
    8296                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$19)
    8297                      .dwattr $C$DW$413, DW_AT_name("uc")
    8298                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_uc")
    8299                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8300                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    8301              
    8302              $C$DW$414       .dwtag  DW_TAG_member
    8303                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$19)
    8304                      .dwattr $C$DW$414, DW_AT_name("p2")
    8305                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_p2")
    8306                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8307                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    8308              
    8309              $C$DW$415       .dwtag  DW_TAG_member
    8310                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$19)
    8311                      .dwattr $C$DW$415, DW_AT_name("i2")
    8312                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_i2")
    8313                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8314                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    8315              
    8316                      .dwendtag $C$DW$T$32
    8317              
    8318              $C$DW$T$35      .dwtag  DW_TAG_typedef
    8319                      .dwattr $C$DW$T$35, DW_AT_name("PID_GRANDO_DATA")
    8320                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$32)
    8321                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    8322              
    8323              
    8324              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    8325                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x3c)
    8326              $C$DW$416       .dwtag  DW_TAG_member
    8327                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$33)
    8328                      .dwattr $C$DW$416, DW_AT_name("term")
    8329                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_term")
    8330                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8331                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    8332              
    8333              $C$DW$417       .dwtag  DW_TAG_member
    8334                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$34)
    8335                      .dwattr $C$DW$417, DW_AT_name("param")
    8336                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_param")
    8337                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8338                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    8339              
    8340              $C$DW$418       .dwtag  DW_TAG_member
    8341                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  184

    8342                      .dwattr $C$DW$418, DW_AT_name("data")
    8343                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_data")
    8344                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8345                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    8346              
    8347                      .dwendtag $C$DW$T$36
    8348              
    8349              $C$DW$T$75      .dwtag  DW_TAG_typedef
    8350                      .dwattr $C$DW$T$75, DW_AT_name("PID_GRANDO_CONTROLLER")
    8351                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$36)
    8352                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    8353              
    8354              
    8355              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8356                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x12)
    8357              $C$DW$419       .dwtag  DW_TAG_member
    8358                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$19)
    8359                      .dwattr $C$DW$419, DW_AT_name("Ualpha")
    8360                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_Ualpha")
    8361                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8362                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    8363              
    8364              $C$DW$420       .dwtag  DW_TAG_member
    8365                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$19)
    8366                      .dwattr $C$DW$420, DW_AT_name("Ubeta")
    8367                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_Ubeta")
    8368                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8369                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    8370              
    8371              $C$DW$421       .dwtag  DW_TAG_member
    8372                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$19)
    8373                      .dwattr $C$DW$421, DW_AT_name("Ta")
    8374                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_Ta")
    8375                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8376                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    8377              
    8378              $C$DW$422       .dwtag  DW_TAG_member
    8379                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$19)
    8380                      .dwattr $C$DW$422, DW_AT_name("Tb")
    8381                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_Tb")
    8382                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8383                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    8384              
    8385              $C$DW$423       .dwtag  DW_TAG_member
    8386                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$19)
    8387                      .dwattr $C$DW$423, DW_AT_name("Tc")
    8388                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_Tc")
    8389                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8390                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    8391              
    8392              $C$DW$424       .dwtag  DW_TAG_member
    8393                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$19)
    8394                      .dwattr $C$DW$424, DW_AT_name("tmp1")
    8395                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_tmp1")
    8396                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  185

    8397                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    8398              
    8399              $C$DW$425       .dwtag  DW_TAG_member
    8400                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$19)
    8401                      .dwattr $C$DW$425, DW_AT_name("tmp2")
    8402                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_tmp2")
    8403                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8404                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    8405              
    8406              $C$DW$426       .dwtag  DW_TAG_member
    8407                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$19)
    8408                      .dwattr $C$DW$426, DW_AT_name("tmp3")
    8409                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_tmp3")
    8410                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8411                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    8412              
    8413              $C$DW$427       .dwtag  DW_TAG_member
    8414                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$37)
    8415                      .dwattr $C$DW$427, DW_AT_name("VecSector")
    8416                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_VecSector")
    8417                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8418                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    8419              
    8420                      .dwendtag $C$DW$T$38
    8421              
    8422              $C$DW$T$76      .dwtag  DW_TAG_typedef
    8423                      .dwattr $C$DW$T$76, DW_AT_name("SVGEN")
    8424                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$38)
    8425                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    8426              
    8427              
    8428              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    8429                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x14)
    8430              $C$DW$428       .dwtag  DW_TAG_member
    8431                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$19)
    8432                      .dwattr $C$DW$428, DW_AT_name("TargetValue")
    8433                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_TargetValue")
    8434                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8435                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    8436              
    8437              $C$DW$429       .dwtag  DW_TAG_member
    8438                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$39)
    8439                      .dwattr $C$DW$429, DW_AT_name("RampDelayCount")
    8440                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_RampDelayCount")
    8441                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8442                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    8443              
    8444              $C$DW$430       .dwtag  DW_TAG_member
    8445                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$19)
    8446                      .dwattr $C$DW$430, DW_AT_name("Acceleration")
    8447                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_Acceleration")
    8448                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8449                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    8450              
    8451              $C$DW$431       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  186

    8452                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$19)
    8453                      .dwattr $C$DW$431, DW_AT_name("T")
    8454                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_T")
    8455                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8456                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    8457              
    8458              $C$DW$432       .dwtag  DW_TAG_member
    8459                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$19)
    8460                      .dwattr $C$DW$432, DW_AT_name("Max_RPM")
    8461                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_Max_RPM")
    8462                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8463                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    8464              
    8465              $C$DW$433       .dwtag  DW_TAG_member
    8466                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$19)
    8467                      .dwattr $C$DW$433, DW_AT_name("SetpointRpm")
    8468                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_SetpointRpm")
    8469                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8470                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    8471              
    8472              $C$DW$434       .dwtag  DW_TAG_member
    8473                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$19)
    8474                      .dwattr $C$DW$434, DW_AT_name("SetpointValue")
    8475                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_SetpointValue")
    8476                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8477                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    8478              
    8479              $C$DW$435       .dwtag  DW_TAG_member
    8480                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$39)
    8481                      .dwattr $C$DW$435, DW_AT_name("EqualFlag")
    8482                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_EqualFlag")
    8483                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8484                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    8485              
    8486              $C$DW$436       .dwtag  DW_TAG_member
    8487                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$19)
    8488                      .dwattr $C$DW$436, DW_AT_name("rmp_tmp")
    8489                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_rmp_tmp")
    8490                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8491                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    8492              
    8493              $C$DW$437       .dwtag  DW_TAG_member
    8494                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$19)
    8495                      .dwattr $C$DW$437, DW_AT_name("rc_err")
    8496                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_rc_err")
    8497                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8498                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    8499              
    8500                      .dwendtag $C$DW$T$40
    8501              
    8502              $C$DW$T$77      .dwtag  DW_TAG_typedef
    8503                      .dwattr $C$DW$T$77, DW_AT_name("RMPCELE")
    8504                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$40)
    8505                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    8506              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  187

    8507              
    8508              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    8509                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    8510              $C$DW$438       .dwtag  DW_TAG_member
    8511                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$19)
    8512                      .dwattr $C$DW$438, DW_AT_name("Freq")
    8513                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_Freq")
    8514                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8515                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    8516              
    8517              $C$DW$439       .dwtag  DW_TAG_member
    8518                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$19)
    8519                      .dwattr $C$DW$439, DW_AT_name("StepAngleMax")
    8520                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_StepAngleMax")
    8521                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8522                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    8523              
    8524              $C$DW$440       .dwtag  DW_TAG_member
    8525                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$19)
    8526                      .dwattr $C$DW$440, DW_AT_name("Angle")
    8527                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_Angle")
    8528                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8529                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    8530              
    8531              $C$DW$441       .dwtag  DW_TAG_member
    8532                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$19)
    8533                      .dwattr $C$DW$441, DW_AT_name("Gain")
    8534                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_Gain")
    8535                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8536                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    8537              
    8538              $C$DW$442       .dwtag  DW_TAG_member
    8539                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$19)
    8540                      .dwattr $C$DW$442, DW_AT_name("Out")
    8541                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_Out")
    8542                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8543                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    8544              
    8545              $C$DW$443       .dwtag  DW_TAG_member
    8546                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$19)
    8547                      .dwattr $C$DW$443, DW_AT_name("Offset")
    8548                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_Offset")
    8549                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8550                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    8551              
    8552                      .dwendtag $C$DW$T$41
    8553              
    8554              $C$DW$T$78      .dwtag  DW_TAG_typedef
    8555                      .dwattr $C$DW$T$78, DW_AT_name("RAMPGEN")
    8556                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$41)
    8557                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    8558              
    8559              
    8560              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    8561                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x16)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  188

    8562              $C$DW$444       .dwtag  DW_TAG_member
    8563                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$19)
    8564                      .dwattr $C$DW$444, DW_AT_name("DcBusVolt")
    8565                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_DcBusVolt")
    8566                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8567                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    8568              
    8569              $C$DW$445       .dwtag  DW_TAG_member
    8570                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$19)
    8571                      .dwattr $C$DW$445, DW_AT_name("MfuncV1")
    8572                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_MfuncV1")
    8573                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8574                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    8575              
    8576              $C$DW$446       .dwtag  DW_TAG_member
    8577                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$19)
    8578                      .dwattr $C$DW$446, DW_AT_name("MfuncV2")
    8579                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_MfuncV2")
    8580                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8581                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    8582              
    8583              $C$DW$447       .dwtag  DW_TAG_member
    8584                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$19)
    8585                      .dwattr $C$DW$447, DW_AT_name("MfuncV3")
    8586                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_MfuncV3")
    8587                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8588                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    8589              
    8590              $C$DW$448       .dwtag  DW_TAG_member
    8591                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$37)
    8592                      .dwattr $C$DW$448, DW_AT_name("OutOfPhase")
    8593                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_OutOfPhase")
    8594                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8595                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    8596              
    8597              $C$DW$449       .dwtag  DW_TAG_member
    8598                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$19)
    8599                      .dwattr $C$DW$449, DW_AT_name("VphaseA")
    8600                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_VphaseA")
    8601                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8602                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    8603              
    8604              $C$DW$450       .dwtag  DW_TAG_member
    8605                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$19)
    8606                      .dwattr $C$DW$450, DW_AT_name("VphaseB")
    8607                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_VphaseB")
    8608                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8609                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    8610              
    8611              $C$DW$451       .dwtag  DW_TAG_member
    8612                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$19)
    8613                      .dwattr $C$DW$451, DW_AT_name("VphaseC")
    8614                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_VphaseC")
    8615                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8616                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  189

    8617              
    8618              $C$DW$452       .dwtag  DW_TAG_member
    8619                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$19)
    8620                      .dwattr $C$DW$452, DW_AT_name("Valpha")
    8621                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_Valpha")
    8622                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8623                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    8624              
    8625              $C$DW$453       .dwtag  DW_TAG_member
    8626                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$19)
    8627                      .dwattr $C$DW$453, DW_AT_name("Vbeta")
    8628                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_Vbeta")
    8629                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8630                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    8631              
    8632              $C$DW$454       .dwtag  DW_TAG_member
    8633                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$19)
    8634                      .dwattr $C$DW$454, DW_AT_name("temp")
    8635                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_temp")
    8636                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8637                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    8638              
    8639                      .dwendtag $C$DW$T$42
    8640              
    8641              $C$DW$T$79      .dwtag  DW_TAG_typedef
    8642                      .dwattr $C$DW$T$79, DW_AT_name("PHASEVOLTAGE")
    8643                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$42)
    8644                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    8645              
    8646              
    8647              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    8648                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x14)
    8649              $C$DW$455       .dwtag  DW_TAG_member
    8650                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$19)
    8651                      .dwattr $C$DW$455, DW_AT_name("ElecTheta")
    8652                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_ElecTheta")
    8653                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8654                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    8655              
    8656              $C$DW$456       .dwtag  DW_TAG_member
    8657                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$39)
    8658                      .dwattr $C$DW$456, DW_AT_name("DirectionQep")
    8659                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_DirectionQep")
    8660                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8661                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    8662              
    8663              $C$DW$457       .dwtag  DW_TAG_member
    8664                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$19)
    8665                      .dwattr $C$DW$457, DW_AT_name("OldElecTheta")
    8666                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_OldElecTheta")
    8667                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8668                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    8669              
    8670              $C$DW$458       .dwtag  DW_TAG_member
    8671                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  190

    8672                      .dwattr $C$DW$458, DW_AT_name("Speed")
    8673                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_Speed")
    8674                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8675                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    8676              
    8677              $C$DW$459       .dwtag  DW_TAG_member
    8678                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$39)
    8679                      .dwattr $C$DW$459, DW_AT_name("BaseRpm")
    8680                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_BaseRpm")
    8681                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8682                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    8683              
    8684              $C$DW$460       .dwtag  DW_TAG_member
    8685                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$43)
    8686                      .dwattr $C$DW$460, DW_AT_name("K1")
    8687                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_K1")
    8688                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8689                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    8690              
    8691              $C$DW$461       .dwtag  DW_TAG_member
    8692                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$19)
    8693                      .dwattr $C$DW$461, DW_AT_name("K2")
    8694                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_K2")
    8695                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8696                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    8697              
    8698              $C$DW$462       .dwtag  DW_TAG_member
    8699                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$19)
    8700                      .dwattr $C$DW$462, DW_AT_name("K3")
    8701                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_K3")
    8702                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8703                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    8704              
    8705              $C$DW$463       .dwtag  DW_TAG_member
    8706                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$44)
    8707                      .dwattr $C$DW$463, DW_AT_name("SpeedRpm")
    8708                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_SpeedRpm")
    8709                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8710                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    8711              
    8712              $C$DW$464       .dwtag  DW_TAG_member
    8713                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$19)
    8714                      .dwattr $C$DW$464, DW_AT_name("Tmp")
    8715                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_Tmp")
    8716                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8717                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    8718              
    8719                      .dwendtag $C$DW$T$45
    8720              
    8721              $C$DW$T$80      .dwtag  DW_TAG_typedef
    8722                      .dwattr $C$DW$T$80, DW_AT_name("SPEED_MEAS_QEP")
    8723                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$45)
    8724                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    8725              
    8726              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  191

    8727              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    8728                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x12)
    8729              $C$DW$465       .dwtag  DW_TAG_member
    8730                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$21)
    8731                      .dwattr $C$DW$465, DW_AT_name("ElecTheta")
    8732                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_ElecTheta")
    8733                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8734                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    8735              
    8736              $C$DW$466       .dwtag  DW_TAG_member
    8737                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$21)
    8738                      .dwattr $C$DW$466, DW_AT_name("MechTheta")
    8739                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_MechTheta")
    8740                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8741                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    8742              
    8743              $C$DW$467       .dwtag  DW_TAG_member
    8744                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$37)
    8745                      .dwattr $C$DW$467, DW_AT_name("DirectionQep")
    8746                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_DirectionQep")
    8747                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8748                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    8749              
    8750              $C$DW$468       .dwtag  DW_TAG_member
    8751                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$37)
    8752                      .dwattr $C$DW$468, DW_AT_name("QepPeriod")
    8753                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_QepPeriod")
    8754                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8755                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    8756              
    8757              $C$DW$469       .dwtag  DW_TAG_member
    8758                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$39)
    8759                      .dwattr $C$DW$469, DW_AT_name("QepCountIndex")
    8760                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_QepCountIndex")
    8761                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8762                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    8763              
    8764              $C$DW$470       .dwtag  DW_TAG_member
    8765                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$44)
    8766                      .dwattr $C$DW$470, DW_AT_name("RawTheta")
    8767                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_RawTheta")
    8768                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8769                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    8770              
    8771              $C$DW$471       .dwtag  DW_TAG_member
    8772                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$21)
    8773                      .dwattr $C$DW$471, DW_AT_name("MechScaler")
    8774                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_MechScaler")
    8775                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8776                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    8777              
    8778              $C$DW$472       .dwtag  DW_TAG_member
    8779                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$37)
    8780                      .dwattr $C$DW$472, DW_AT_name("LineEncoder")
    8781                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_LineEncoder")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  192

    8782                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8783                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    8784              
    8785              $C$DW$473       .dwtag  DW_TAG_member
    8786                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$37)
    8787                      .dwattr $C$DW$473, DW_AT_name("PolePairs")
    8788                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_PolePairs")
    8789                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8790                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    8791              
    8792              $C$DW$474       .dwtag  DW_TAG_member
    8793                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$44)
    8794                      .dwattr $C$DW$474, DW_AT_name("CalibratedAngle")
    8795                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_CalibratedAngle")
    8796                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8797                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    8798              
    8799              $C$DW$475       .dwtag  DW_TAG_member
    8800                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$37)
    8801                      .dwattr $C$DW$475, DW_AT_name("IndexSyncFlag")
    8802                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_IndexSyncFlag")
    8803                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8804                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    8805              
    8806                      .dwendtag $C$DW$T$46
    8807              
    8808              $C$DW$T$81      .dwtag  DW_TAG_typedef
    8809                      .dwattr $C$DW$T$81, DW_AT_name("QEP")
    8810                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$46)
    8811                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    8812              
    8813              
    8814              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    8815                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x07)
    8816              $C$DW$476       .dwtag  DW_TAG_member
    8817                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$47)
    8818                      .dwattr $C$DW$476, DW_AT_name("stat_reg1")
    8819                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_stat_reg1")
    8820                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8821                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    8822              
    8823              $C$DW$477       .dwtag  DW_TAG_member
    8824                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$48)
    8825                      .dwattr $C$DW$477, DW_AT_name("stat_reg2")
    8826                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_stat_reg2")
    8827                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8828                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    8829              
    8830              $C$DW$478       .dwtag  DW_TAG_member
    8831                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$49)
    8832                      .dwattr $C$DW$478, DW_AT_name("cntrl_reg1")
    8833                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_cntrl_reg1")
    8834                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8835                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    8836              
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  193

    8837              $C$DW$479       .dwtag  DW_TAG_member
    8838                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$50)
    8839                      .dwattr $C$DW$479, DW_AT_name("cntrl_reg2")
    8840                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_cntrl_reg2")
    8841                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8842                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    8843              
    8844              $C$DW$480       .dwtag  DW_TAG_member
    8845                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$37)
    8846                      .dwattr $C$DW$480, DW_AT_name("readCntrl1")
    8847                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_readCntrl1")
    8848                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8849                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    8850              
    8851              $C$DW$481       .dwtag  DW_TAG_member
    8852                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$37)
    8853                      .dwattr $C$DW$481, DW_AT_name("readCntrl2")
    8854                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_readCntrl2")
    8855                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8856                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    8857              
    8858              $C$DW$482       .dwtag  DW_TAG_member
    8859                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$37)
    8860                      .dwattr $C$DW$482, DW_AT_name("DRV_fault")
    8861                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_DRV_fault")
    8862                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8863                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    8864              
    8865                      .dwendtag $C$DW$T$51
    8866              
    8867              $C$DW$T$82      .dwtag  DW_TAG_typedef
    8868                      .dwattr $C$DW$T$82, DW_AT_name("DRV8301_Vars")
    8869                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$51)
    8870                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    8871              
    8872              
    8873              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    8874                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x15)
    8875              $C$DW$483       .dwtag  DW_TAG_member
    8876                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$37)
    8877                      .dwattr $C$DW$483, DW_AT_name("Rsvd0")
    8878                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_Rsvd0")
    8879                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8880                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    8881              
    8882              $C$DW$484       .dwtag  DW_TAG_member
    8883                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$52)
    8884                      .dwattr $C$DW$484, DW_AT_name("status1_wwd")
    8885                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_status1_wwd")
    8886                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8887                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    8888              
    8889              $C$DW$485       .dwtag  DW_TAG_member
    8890                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$53)
    8891                      .dwattr $C$DW$485, DW_AT_name("status2_ov_vds")
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  194

    8892                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_status2_ov_vds")
    8893                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8894                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    8895              
    8896              $C$DW$486       .dwtag  DW_TAG_member
    8897                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$54)
    8898                      .dwattr $C$DW$486, DW_AT_name("status3_IC")
    8899                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_status3_IC")
    8900                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8901                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    8902              
    8903              $C$DW$487       .dwtag  DW_TAG_member
    8904                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$55)
    8905                      .dwattr $C$DW$487, DW_AT_name("status4_gd_Vgs")
    8906                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    8907                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8908                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    8909              
    8910              $C$DW$488       .dwtag  DW_TAG_member
    8911                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$56)
    8912                      .dwattr $C$DW$488, DW_AT_name("cntrl5_hs_gd")
    8913                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    8914                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8915                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    8916              
    8917              $C$DW$489       .dwtag  DW_TAG_member
    8918                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$57)
    8919                      .dwattr $C$DW$489, DW_AT_name("cntrl6_ls_gd")
    8920                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    8921                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8922                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    8923              
    8924              $C$DW$490       .dwtag  DW_TAG_member
    8925                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$58)
    8926                      .dwattr $C$DW$490, DW_AT_name("cntrl7_gd")
    8927                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_cntrl7_gd")
    8928                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8929                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    8930              
    8931              $C$DW$491       .dwtag  DW_TAG_member
    8932                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$37)
    8933                      .dwattr $C$DW$491, DW_AT_name("Rsvd8")
    8934                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_Rsvd8")
    8935                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8936                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    8937              
    8938              $C$DW$492       .dwtag  DW_TAG_member
    8939                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$59)
    8940                      .dwattr $C$DW$492, DW_AT_name("cntrl9_IC_ops")
    8941                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    8942                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8943                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    8944              
    8945              $C$DW$493       .dwtag  DW_TAG_member
    8946                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$60)
TMS320C2000 Assembler PC v20.2.1 Tue May 11 14:30:52 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
MonoMtrServo.asm                                                     PAGE  195

    8947                      .dwattr $C$DW$493, DW_AT_name("cntrlA_shunt_amp")
    8948                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    8949                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8950                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    8951              
    8952              $C$DW$494       .dwtag  DW_TAG_member
    8953                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$61)
    8954                      .dwattr $C$DW$494, DW_AT_name("cntrlB_Vreg")
    8955                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    8956                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8957                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    8958              
    8959              $C$DW$495       .dwtag  DW_TAG_member
    8960                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$62)
    8961                      .dwattr $C$DW$495, DW_AT_name("cntrlC_Vds_SNS")
    8962                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
    8963                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8964                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    8965              
    8966              $C$DW$496       .dwtag  DW_TAG_member
    8967                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$37)
