TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Fri Jul 31 12:17:38 2020                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../utility Src Files/DLOG_4CH_F.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Chiaming\CCSworkspace_V10\MonoMtrServo_377s\F2837x_RAM")
      13              ;       C:\ti\ccs1010\ccs\tools\compiler\ti-cgt-c2000_20.2.1.LTS\bin\ac2000.exe -@C:\\Users\\Chiaming\\AppDat
      14 00000000               .sect   ".text"
      15                      .clink

     312 000000b4 0AC4          INC       *+XAR4[0]             ; [CPU_ALU] |47| 
     313                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 48,column 4,is_stmt,isa 0
     314 000000b5 0217          MOVB      ACC,#23               ; [CPU_ALU] |48| 
     315 000000b6 0744          ADDL      ACC,*-SP[4]           ; [CPU_ALU] |48| 
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    7

     316 000000b7 8AA9          MOVL      XAR4,ACC              ; [CPU_ALU] |48| 
     317 000000b8 88C4          MOVZ      AR6,*+XAR4[0]         ; [CPU_ALU] |48| 
     318 000000b9 0218          MOVB      ACC,#24               ; [CPU_ALU] |48| 
     319 000000ba 0744          ADDL      ACC,*-SP[4]           ; [CPU_ALU] |48| 
     320 000000bb 8AA9          MOVL      XAR4,ACC              ; [CPU_ALU] |48| 
     321 000000bc 92A6          MOV       AL,AR6                ; [CPU_ALU] |48| 
     322 000000bd 54C4          CMP       AL,*+XAR4[0]          ; [CPU_ALU] |48| 
     323 000000be 6014          B         $C$L4,NEQ             ; [CPU_ALU] |48| 
     324                      ; branchcc occurs ; [] |48| 
     325                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 50,column 5,is_stmt,isa 0
     326 000000bf 0218          MOVB      ACC,#24               ; [CPU_ALU] |50| 
     327 000000c0 0744          ADDL      ACC,*-SP[4]           ; [CPU_ALU] |50| 
     328 000000c1 8AA9          MOVL      XAR4,ACC              ; [CPU_ALU] |50| 
     329 000000c2 2BC4          MOV       *+XAR4[0],#0          ; [CPU_ALU] |50| 
     330                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 51,column 5,is_stmt,isa 0
     331 000000c3 0214          MOVB      ACC,#20               ; [CPU_ALU] |51| 
     332 000000c4 0744          ADDL      ACC,*-SP[4]           ; [CPU_ALU] |51| 
     333 000000c5 8AA9          MOVL      XAR4,ACC              ; [CPU_ALU] |51| 
     334 000000c6 56BF          MOVB      *+XAR4[0],#1,UNC      ; [CPU_ALU] |51| 
         000000c7 01C4 
     335                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 54,column 3,is_stmt,isa 0
     336 000000c8 6F0A          B         $C$L4,UNC             ; [CPU_ALU] |54| 
     337                      ; branch occurs ; [] |54| 
     338 000000c9       $C$L3:    
     339                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 29,column 2,is_stmt,isa 0
     340 000000c9 0214          MOVB      ACC,#20               ; [CPU_ALU] |29| 
     341 000000ca 0744          ADDL      ACC,*-SP[4]           ; [CPU_ALU] |29| 
     342 000000cb 8AA9          MOVL      XAR4,ACC              ; [CPU_ALU] |29| 
     343 000000cc 92C4          MOV       AL,*+XAR4[0]          ; [CPU_ALU] |29| 
     344 000000cd 5201          CMPB      AL,#1                 ; [CPU_ALU] |29| 
     345 000000ce FFE1          B         $C$L1,EQ              ; [CPU_ALU] |29| 
         000000cf FF72 
     346                      ; branchcc occurs ; [] |29| 
     347 000000d0 5202          CMPB      AL,#2                 ; [CPU_ALU] |29| 
     348 000000d1 6191          B         $C$L2,EQ              ; [CPU_ALU] |29| 
     349                      ; branchcc occurs ; [] |29| 
     350 000000d2       $C$L4:    
     351                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 56,column 2,is_stmt,isa 0
     352 000000d2 8344          MOVL      XAR5,*-SP[4]          ; [CPU_ALU] |56| 
     353 000000d3 83C5          MOVL      XAR5,*+XAR5[0]        ; [CPU_ALU] |56| 
     354 000000d4 0210          MOVB      ACC,#16               ; [CPU_ALU] |56| 
     355 000000d5 0744          ADDL      ACC,*-SP[4]           ; [CPU_ALU] |56| 
     356 000000d6 8AA9          MOVL      XAR4,ACC              ; [CPU_ALU] |56| 
     357 000000d7 C4C5          MOVL      XAR6,*+XAR5[0]        ; [CPU_ALU] |56| 
     358 000000d8 C2C4          MOVL      *+XAR4[0],XAR6        ; [CPU_ALU] |56| 
     359                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 57,column 1,is_stmt,isa 0
     360 000000d9 FE84          SUBB      SP,#4                 ; [CPU_ARAU] 
     361                      .dwcfi  cfa_offset, -2
     362              $C$DW$8 .dwtag  DW_TAG_TI_branch
     363                      .dwattr $C$DW$8, DW_AT_low_pc(0x00)
     364                      .dwattr $C$DW$8, DW_AT_TI_return
     365              
     366 000000da 0006          LRETR     ; [CPU_ALU] 
     367                      ; return occurs ; [] 
     368                      .dwattr $C$DW$5, DW_AT_TI_end_file("../utility Src Files/DLOG_4CH_F.c")
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    8

     369                      .dwattr $C$DW$5, DW_AT_TI_end_line(0x39)
     370                      .dwattr $C$DW$5, DW_AT_TI_end_column(0x01)
     371                      .dwendentry
     372                      .dwendtag $C$DW$5
     373              
     374              
     375              ;***************************************************************
     376              ;* TYPE INFORMATION                                            *
     377              ;***************************************************************
     378              
     379              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     380                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x1a)
     381              $C$DW$9 .dwtag  DW_TAG_member
     382                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$20)
     383                      .dwattr $C$DW$9, DW_AT_name("input_ptr1")
     384                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_input_ptr1")
     385                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     386                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     387              
     388              $C$DW$10        .dwtag  DW_TAG_member
     389                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$20)
     390                      .dwattr $C$DW$10, DW_AT_name("input_ptr2")
     391                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_input_ptr2")
     392                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     393                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     394              
     395              $C$DW$11        .dwtag  DW_TAG_member
     396                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$20)
     397                      .dwattr $C$DW$11, DW_AT_name("input_ptr3")
     398                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_input_ptr3")
     399                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     400                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     401              
     402              $C$DW$12        .dwtag  DW_TAG_member
     403                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$20)
     404                      .dwattr $C$DW$12, DW_AT_name("input_ptr4")
     405                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_input_ptr4")
     406                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     407                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     408              
     409              $C$DW$13        .dwtag  DW_TAG_member
     410                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$20)
     411                      .dwattr $C$DW$13, DW_AT_name("output_ptr1")
     412                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_output_ptr1")
     413                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     414                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     415              
     416              $C$DW$14        .dwtag  DW_TAG_member
     417                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$20)
     418                      .dwattr $C$DW$14, DW_AT_name("output_ptr2")
     419                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_output_ptr2")
     420                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     421                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     422              
     423              $C$DW$15        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    9

     424                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$20)
     425                      .dwattr $C$DW$15, DW_AT_name("output_ptr3")
     426                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_output_ptr3")
     427                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     428                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     429              
     430              $C$DW$16        .dwtag  DW_TAG_member
     431                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$20)
     432                      .dwattr $C$DW$16, DW_AT_name("output_ptr4")
     433                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_output_ptr4")
     434                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     435                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     436              
     437              $C$DW$17        .dwtag  DW_TAG_member
     438                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     439                      .dwattr $C$DW$17, DW_AT_name("prev_value")
     440                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_prev_value")
     441                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     442                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     443              
     444              $C$DW$18        .dwtag  DW_TAG_member
     445                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     446                      .dwattr $C$DW$18, DW_AT_name("trig_value")
     447                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_trig_value")
     448                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     449                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     450              
     451              $C$DW$19        .dwtag  DW_TAG_member
     452                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$21)
     453                      .dwattr $C$DW$19, DW_AT_name("status")
     454                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_status")
     455                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     456                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     457              
     458              $C$DW$20        .dwtag  DW_TAG_member
     459                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$21)
     460                      .dwattr $C$DW$20, DW_AT_name("pre_scalar")
     461                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_pre_scalar")
     462                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     463                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     464              
     465              $C$DW$21        .dwtag  DW_TAG_member
     466                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$21)
     467                      .dwattr $C$DW$21, DW_AT_name("skip_count")
     468                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_skip_count")
     469                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     470                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     471              
     472              $C$DW$22        .dwtag  DW_TAG_member
     473                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$21)
     474                      .dwattr $C$DW$22, DW_AT_name("size")
     475                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_size")
     476                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     477                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     478              
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE   10

     479              $C$DW$23        .dwtag  DW_TAG_member
     480                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$21)
     481                      .dwattr $C$DW$23, DW_AT_name("count")
     482                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_count")
     483                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     484                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     485              
     486                      .dwendtag $C$DW$T$22
     487              
     488              $C$DW$T$23      .dwtag  DW_TAG_typedef
     489                      .dwattr $C$DW$T$23, DW_AT_name("DLOG_4CH_F")
     490                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     491                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     492              
     493              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
     494                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     495                      .dwattr $C$DW$T$24, DW_AT_address_class(0x20)
     496              
     497              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     498                      .dwattr $C$DW$T$2, DW_AT_name("void")
     499              
     500              $C$DW$T$4       .dwtag  DW_TAG_base_type
     501                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     502                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     503                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     504              
     505              $C$DW$T$5       .dwtag  DW_TAG_base_type
     506                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     507                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     508                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     509              
     510              $C$DW$T$6       .dwtag  DW_TAG_base_type
     511                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     512                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     513                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     514              
     515              $C$DW$T$7       .dwtag  DW_TAG_base_type
     516                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     517                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     518                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     519              
     520              $C$DW$T$8       .dwtag  DW_TAG_base_type
     521                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     522                      .dwattr $C$DW$T$8, DW_AT_name("short")
     523                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     524              
     525              $C$DW$T$9       .dwtag  DW_TAG_base_type
     526                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     527                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     528                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     529              
     530              $C$DW$T$10      .dwtag  DW_TAG_base_type
     531                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     532                      .dwattr $C$DW$T$10, DW_AT_name("int")
     533                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v20.2.1 Fri Jul 31 12:17:38 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE   11

     534              
     535              $C$DW$T$21      .dwtag  DW_TAG_typedef
     536                      .dwattr $C$DW$T$21, DW_AT_name("int16")
     537                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$10)
     538                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     539              
     540              $C$DW$T$11      .dwtag  DW_TAG_base_type
     541                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     542                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     543                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
